-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_4_5\basic.log
  log type:  text
 opened on:   6 Mar 2020, 20:43:51

. /*****
> 
> Uses pro- and anti-drug testing state legislation by year from IDFW documentation
> to generate D-in-D style estimates of drug testing impacts by demographic group.
> 
> Estimates baseline specs with cubics in time plus their interactions with demographics
> instead of year dummies. Adds employment growth for high testing sector industries.
> Now omits DC.
> 
> *****/
> 
> set matsize 800 ;

. set more off ;

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_March_CPS/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_March_CPS

. use Output/marcps.dta ;

. cd ../Tables/Table_4_5/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_4_5

. *use "/afs/crc.nd.edu/user/a/awaggone/Private/Private/Drugs_2011/_june2012/marcps.dta" ;
. *use "/afs/crc.nd.edu/user/a/awaggone/Private/Private/Drugs_2011/_june2012/marcps_test.dta" ;
. /** Construct variables for estimation **/
> 
> * Pro and anti dummies, by state-year ;
. gen pro=0 ;

. replace pro=1 if (year>=yrpro & yrpro~=0) ;
(287,572 real changes made)

. gen anti=0 ;

. replace anti=1 if (year>=yranti & yranti~=0) ;
(119,778 real changes made)

. /*
> bysort pro: tab1 yrpro yranti ;
> bysort pro: summ year ;
> bysort anti: tab1 yrpro yranti ;
> bysort anti: summ year ;
> bysort year: summ pro anti ;
> */
> 
> * Reduce education groups to 2 ;
. gen lowskill=1 if edgrp4==1 | edgrp4==2 ;
(1,354,018 missing values generated)

. replace lowskill=0 if edgrp4==3 | edgrp4==4 ;
(1,354,018 real changes made)

. gen young=(age<=25) ;

. summ young lowskill ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       young |  2,760,713    .2112277    .4081796          0          1
    lowskill |  2,760,713    .5095405    .4999091          0          1

. gen age2=age*age ;

. * demog-pro and anit interactions ;
. gen blackpro=black*pro ;

. gen hisppro=hisp*pro ;

. gen femalepro=female*pro ;

. gen youngpro=young*pro ;

. gen lowskillpro=lowskill*pro ;

. gen blackanti=black*anti ;

. gen hispanti=hisp*anti ;

. gen femaleanti=female*anti ;

. gen younganti=young*anti ;

. gen lowskillanti=lowskill*anti ;

. * Time cubics and their double interactions ;
. gen ttrend=year - 1980 ;

. sum ttrend ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ttrend |  2,760,713    15.82609    9.249745          0         30

. gen ttrend2=ttrend^2 ;

. gen ttrend3=ttrend^3 ;

. gen ttrendbl=ttrend*black ;

.  gen ttrend2bl=ttrend2*black ;

.  gen ttrend3bl=ttrend3*black ;

. gen ttrendhi=ttrend*hisp ;

.  gen ttrend2hi=ttrend2*hisp ;

.  gen ttrend3hi=ttrend3*hisp ;

. gen ttrendfe=ttrend*female ;

.  gen ttrend2fe=ttrend2*female ;

.  gen ttrend3fe=ttrend3*female ;

. gen ttrendyo=ttrend*young ;

.  gen ttrend2yo=ttrend2*young ;

.  gen ttrend3yo=ttrend3*young ;

. gen ttrendlo=ttrend*lowskill ;

.  gen ttrend2lo=ttrend2*lowskill ;

.  gen ttrend3lo=ttrend3*lowskill ;

. * State dummies and their interactions with demographics plus linear state trends ;
. ** These results largely robust to full set of state-level cubic time trends. ;
. char statefip[omit] 17 ;

.  * omit IL - set this so not omitting a pro or anti state ;
. xi, prefix(_S) i.statefip*black i.statefip*hisp i.statefip*female i.statefip*young i.statefip*lowskill 
>   i.statefip*ttrend i.statefip*ttrend2 i.statefip*ttrend3 ;
i.statefip        _Sstatefip_1-56     (naturally coded; _Sstatefip_17 omitted)
i.state~p*black   _SstaXblac_#        (coded as above)
i.statefip*hisp   _SstaXhisp_#        (coded as above)
i.stat~p*female   _SstaXfema_#        (coded as above)
i.state~p*young   _SstaXyoun_#        (coded as above)
i.stat~p*lows~l   _SstaXlows_#        (coded as above)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)
i.stat~p*ttre~2   _SstaXttrea#        (coded as above)
i.stat~p*ttre~3   _SstaXttreb#        (coded as above)

. /** Outcome variables **/
> 
> gen empdhi=1 if empd==1 & inlist(ind1,1,4,5,3,11)==1 ;
(2,189,585 missing values generated)

. replace empdhi=0 if empd==1 & inlist(ind1,1,4,5,3,11)~=1 ;
(1,504,219 real changes made)

. summ empdhi ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      empdhi |  2,075,347    .2751964    .4466133          0          1

. gen empdmid=1 if firmsizer==2 | firmsizer==3 ;
(2,292,171 missing values generated)

. replace empdmid=0 if firmsizer==1 | firmsizer==4 ;
(1,266,443 real changes made)

. gen empdlg=1 if firmsizer==4 ;
(2,005,557 missing values generated)

. replace empdlg=0 if firmsizer==1 | firmsizer==2 | firmsizer==3 ;
(979,829 real changes made)

. gen ph=. ;
(2,760,713 missing values generated)

. replace ph=1 if pensionr==1 | inclughr==1 ;
(1,524,078 real changes made)

. replace ph=0 if pensionr==0 & inclughr==0 ;
(764,615 real changes made)

. replace ph=. if pensionr==. | inclughr==. ;
(0 real changes made)

. summ empdmid empdlg ph ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     empdmid |  1,734,985    .2700554    .4439883          0          1
      empdlg |  1,734,985    .4352522    .4957901          0          1
          ph |  2,288,693    .6659163    .4716692          0          1

. gen lrhw=log(rhwage) ;
(608,313 missing values generated)

. /** Estimations **/
> 
> /** Main specification with DTI interactions **/
> 
> summ year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |  2,760,713    1995.826    9.249745       1980       2010

. global controls blackpro hisppro femalepro youngpro lowskillpro pro
>   black hisp female lowskill age age2
>   eg* minwage unemploymentrate incarcr
>   tt* _S* ;

.   global outvars blackpro hisppro femalepro youngpro lowskillpro pro
>   black hisp female lowskill age age2 minwage unemploymentrate incarcr eg200 eg300 eg400 eg500 eg900 ;

. summ $outvars year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    blackpro |  2,760,713    .0170246    .1293629          0          1
     hisppro |  2,760,713    .0123008    .1102248          0          1
   femalepro |  2,760,713    .0543816    .2267692          0          1
    youngpro |  2,760,713    .0200477    .1401635          0          1
 lowskillpro |  2,760,713    .0487128     .215267          0          1
-------------+---------------------------------------------------------
         pro |  2,760,713    .1041658    .3054756          0          1
       black |  2,760,713     .097498    .2966347          0          1
        hisp |  2,760,713    .1341588    .3408229          0          1
      female |  2,760,713    .5172175    .4997036          0          1
    lowskill |  2,760,713    .5095405    .4999091          0          1
-------------+---------------------------------------------------------
         age |  2,760,713    35.78253    10.54069         18         55
        age2 |  2,760,713    1391.495    767.7232        324       3025
     minwage |  2,760,713    4.756709    1.355888        3.1       8.55
unemployme~e |  2,760,713    6.196906    2.099791        2.3       17.4
     incarcr |  2,760,713    .0066997    .0034167   .0006989    .019237
-------------+---------------------------------------------------------
       eg200 |  2,728,333    .0109681    .0984045  -.3821094   1.083832
       eg300 |  2,750,804     .012534    .0651275  -.2894042    .298291
       eg400 |  2,757,779   -.0179936    .0432723  -.3251267   .1539795
       eg500 |  2,750,602    .0003187    .0615135  -.4237287   .1940089
       eg900 |  2,760,713    .0093388    .0139579  -.0594112   .0677045
-------------+---------------------------------------------------------
        year |  2,760,713    1995.826    9.249745       1980       2010

. summ statefip year $controls empdhi empd empdlg ph lrhw if
>   (eg200~=. & minwage~=. & unemploymentrate~=. & incarcr~=. & statefip~=. & year~=. & black~=. & hisp~=. & female~=. 
>   & lowskill~=. & age~=. & empd~=.) ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    statefip |  2,727,660    28.25376    15.58964          1         56
        year |  2,727,660    1995.723    9.247327       1980       2010
    blackpro |  2,727,660     .017195    .1299973          0          1
     hisppro |  2,727,660    .0123494    .1104396          0          1
   femalepro |  2,727,660    .0545068     .227015          0          1
-------------+---------------------------------------------------------
    youngpro |  2,727,660    .0200773    .1402647          0          1
 lowskillpro |  2,727,660    .0488276    .2155074          0          1
         pro |  2,727,660    .1043231    .3056793          0          1
       black |  2,727,660    .0974396    .2965554          0          1
        hisp |  2,727,660    .1348229    .3415344          0          1
-------------+---------------------------------------------------------
      female |  2,727,660    .5172958    .4997009          0          1
    lowskill |  2,727,660    .5104199    .4998915          0          1
         age |  2,727,660     35.7657    10.53965         18         55
        age2 |  2,727,660    1390.269    767.5768        324       3025
       eg200 |  2,727,660    .0109494    .0984029  -.3821094   1.083832
-------------+---------------------------------------------------------
       eg300 |  2,724,738    .0127265    .0650908  -.2894042    .298291
       eg400 |  2,724,738   -.0174835    .0426593  -.1896234   .1539795
       eg500 |  2,723,193    .0006266     .061202  -.4237287   .1940089
       eg900 |  2,727,660    .0093495    .0139946  -.0594112   .0677045
     minwage |  2,727,660    4.737676    1.350261        3.1       8.55
-------------+---------------------------------------------------------
unemployme~e |  2,727,660     6.20226    2.098143        2.3       17.4
     incarcr |  2,727,660    .0066598    .0033627   .0006989    .019237
      ttrend |  2,727,660    15.72335    9.247327          0         30
     ttrend2 |  2,727,660    332.7368    289.3668          0        900
     ttrend3 |  2,727,660    7824.761    8390.549          0      27000
-------------+---------------------------------------------------------
    ttrendbl |  2,727,660    1.606594    5.671379          0         30
   ttrend2bl |  2,727,660    34.74567    139.7669          0        900
   ttrend3bl |  2,727,660    827.6652    3675.075          0      27000
    ttrendhi |  2,727,660    2.369398    6.836073          0         30
   ttrend2hi |  2,727,660    52.34592    170.3939          0        900
-------------+---------------------------------------------------------
   ttrend3hi |  2,727,660     1259.61    4512.818          0      27000
    ttrendfe |  2,727,660    8.142222    10.30035          0         30
   ttrend2fe |  2,727,660     172.393    266.5734          0        900
   ttrend3fe |  2,727,660    4055.091    7195.634          0      27000
    ttrendyo |  2,727,660    3.074989     7.37107          0         30
-------------+---------------------------------------------------------
   ttrend2yo |  2,727,660    63.78821    181.5481          0        900
   ttrend3yo |  2,727,660    1491.633    4783.704          0      27000
    ttrendlo |  2,727,660    7.352765    9.812819          0         30
   ttrend2lo |  2,727,660    150.3545    250.9284          0        900
   ttrend3lo |  2,727,660    3476.643    6725.621          0      27000
-------------+---------------------------------------------------------
_Sstatefip_1 |  2,727,660    .0129283    .1129653          0          1
_Sstatefip_2 |  2,727,660    .0138789    .1169885          0          1
_Sstatefip_4 |  2,727,660    .0139709    .1173702          0          1
_Sstatefip_5 |  2,727,660    .0118362    .1081483          0          1
_Sstatefip_6 |  2,727,660    .0945264    .2925598          0          1
-------------+---------------------------------------------------------
_Sstatefip_8 |  2,727,660     .017585    .1314375          0          1
_Sstatefip_9 |  2,727,660    .0141095    .1179426          0          1
_Sstatefi~10 |  2,727,660     .007171    .0843775          0          1
_Sstatefi~12 |  2,727,660    .0419851    .2005551          0          1
_Sstatefi~13 |  2,727,660    .0168533    .1287216          0          1
-------------+---------------------------------------------------------
_Sstatefi~15 |  2,727,660    .0127347    .1121274          0          1
_Sstatefi~16 |  2,727,660    .0118897    .1083897          0          1
_Sstatefi~18 |  2,727,660    .0152204    .1224284          0          1
_Sstatefi~19 |  2,727,660    .0147009    .1203527          0          1
_Sstatefi~20 |  2,727,660    .0134995    .1154004          0          1
-------------+---------------------------------------------------------
_Sstatefi~21 |  2,727,660    .0131725     .114013          0          1
_Sstatefi~22 |  2,727,660     .011247    .1054538          0          1
_Sstatefi~23 |  2,727,660    .0110905    .1047257          0          1
_Sstatefi~24 |  2,727,660    .0160629    .1257173          0          1
_Sstatefi~25 |  2,727,660    .0257433    .1583686          0          1
-------------+---------------------------------------------------------
_Sstatefi~26 |  2,727,660    .0329953    .1786243          0          1
_Sstatefi~27 |  2,727,660    .0161798    .1261666          0          1
_Sstatefi~28 |  2,727,660    .0114541    .1064093          0          1
_Sstatefi~29 |  2,727,660     .014412    .1191817          0          1
_Sstatefi~30 |  2,727,660     .011805    .1080076          0          1
-------------+---------------------------------------------------------
_Sstatefi~31 |  2,727,660    .0138764    .1169778          0          1
_Sstatefi~32 |  2,727,660    .0145946    .1199232          0          1
_Sstatefi~33 |  2,727,660    .0130962    .1136869          0          1
_Sstatefi~34 |  2,727,660    .0314684    .1745798          0          1
_Sstatefi~35 |  2,727,660    .0142925    .1186937          0          1
-------------+---------------------------------------------------------
_Sstatefi~36 |  2,727,660    .0597179    .2369634          0          1
_Sstatefi~37 |  2,727,660    .0263941    .1603041          0          1
_Sstatefi~38 |  2,727,660    .0127219    .1120716          0          1
_Sstatefi~39 |  2,727,660    .0352687    .1844582          0          1
_Sstatefi~40 |  2,727,660    .0129118    .1128942          0          1
-------------+---------------------------------------------------------
_Sstatefi~41 |  2,727,660    .0130566    .1135171          0          1
_Sstatefi~42 |  2,727,660    .0366105    .1878036          0          1
_Sstatefi~44 |  2,727,660     .009587    .0974426          0          1
_Sstatefi~45 |  2,727,660    .0123153     .110289          0          1
_Sstatefi~46 |  2,727,660     .014085    .1178414          0          1
-------------+---------------------------------------------------------
_Sstatefi~47 |  2,727,660    .0128993    .1128404          0          1
_Sstatefi~48 |  2,727,660    .0558886    .2297064          0          1
_Sstatefi~49 |  2,727,660    .0137902    .1166192          0          1
_Sstatefi~50 |  2,727,660    .0094587    .0967946          0          1
_Sstatefi~51 |  2,727,660    .0178402    .1323704          0          1
-------------+---------------------------------------------------------
_Sstatefi~53 |  2,727,660    .0151001    .1219513          0          1
_Sstatefi~54 |  2,727,660    .0117665    .1078334          0          1
_Sstatefi~55 |  2,727,660     .016204    .1262594          0          1
_Sstatefi~56 |  2,727,660    .0114266     .106283          0          1
_SstaXblac_1 |  2,727,660    .0033094    .0574324          0          1
-------------+---------------------------------------------------------
_SstaXblac_2 |  2,727,660     .000507    .0225116          0          1
_SstaXblac_4 |  2,727,660    .0004014     .020032          0          1
_SstaXblac_5 |  2,727,660    .0017451    .0417378          0          1
_SstaXblac_6 |  2,727,660    .0054787    .0738151          0          1
_SstaXblac_8 |  2,727,660    .0006504    .0254941          0          1
-------------+---------------------------------------------------------
_SstaXblac_9 |  2,727,660     .001263    .0355161          0          1
_SstaXbla~10 |  2,727,660    .0012282    .0350236          0          1
_SstaXbla~12 |  2,727,660    .0059941    .0771895          0          1
_SstaXbla~13 |  2,727,660    .0049112    .0699074          0          1
_SstaXbla~15 |  2,727,660     .000228    .0150991          0          1
-------------+---------------------------------------------------------
_SstaXbla~16 |  2,727,660    .0000455    .0067423          0          1
_SstaXbla~18 |  2,727,660    .0011497    .0338878          0          1
_SstaXbla~19 |  2,727,660    .0003171    .0178051          0          1
_SstaXbla~20 |  2,727,660    .0008157    .0285491          0          1
_SstaXbla~21 |  2,727,660    .0009382    .0306151          0          1
-------------+---------------------------------------------------------
_SstaXbla~22 |  2,727,660    .0032013    .0564892          0          1
_SstaXbla~23 |  2,727,660    .0000466    .0068233          0          1
_SstaXbla~24 |  2,727,660    .0040383    .0634189          0          1
_SstaXbla~25 |  2,727,660    .0012326    .0350862          0          1
_SstaXbla~26 |  2,727,660    .0040104    .0632006          0          1
-------------+---------------------------------------------------------
_SstaXbla~27 |  2,727,660    .0005411    .0232558          0          1
_SstaXbla~28 |  2,727,660    .0040489     .063502          0          1
_SstaXbla~29 |  2,727,660    .0014456    .0379931          0          1
_SstaXbla~30 |  2,727,660    .0000304    .0055162          0          1
_SstaXbla~31 |  2,727,660    .0004872    .0220679          0          1
-------------+---------------------------------------------------------
_SstaXbla~32 |  2,727,660    .0009576    .0309303          0          1
_SstaXbla~33 |  2,727,660    .0000931    .0096494          0          1
_SstaXbla~34 |  2,727,660    .0036991     .060708          0          1
_SstaXbla~35 |  2,727,660    .0002379    .0154232          0          1
_SstaXbla~36 |  2,727,660    .0089392    .0941236          0          1
-------------+---------------------------------------------------------
_SstaXbla~37 |  2,727,660    .0053804    .0731539          0          1
_SstaXbla~38 |  2,727,660    .0000814    .0090212          0          1
_SstaXbla~39 |  2,727,660    .0037475    .0611023          0          1
_SstaXbla~40 |  2,727,660    .0009389    .0306271          0          1
_SstaXbla~41 |  2,727,660    .0001947    .0139511          0          1
-------------+---------------------------------------------------------
_SstaXbla~42 |  2,727,660    .0031456     .055997          0          1
_SstaXbla~44 |  2,727,660    .0004623    .0214962          0          1
_SstaXbla~45 |  2,727,660    .0035287    .0592977          0          1
_SstaXbla~46 |  2,727,660    .0001276    .0112945          0          1
_SstaXbla~47 |  2,727,660    .0020618    .0453607          0          1
-------------+---------------------------------------------------------
_SstaXbla~48 |  2,727,660    .0052987    .0725989          0          1
_SstaXbla~49 |  2,727,660    .0000909    .0095348          0          1
_SstaXbla~50 |  2,727,660    .0000411    .0064077          0          1
_SstaXbla~51 |  2,727,660    .0034326    .0584879          0          1
_SstaXbla~53 |  2,727,660    .0004454    .0211007          0          1
-------------+---------------------------------------------------------
_SstaXbla~54 |  2,727,660    .0003336    .0182622          0          1
_SstaXbla~55 |  2,727,660    .0007497    .0273709          0          1
_SstaXbla~56 |  2,727,660    .0000741    .0086053          0          1
_SstaXhisp_1 |  2,727,660    .0001976    .0140558          0          1
_SstaXhisp_2 |  2,727,660    .0005972    .0244307          0          1
-------------+---------------------------------------------------------
_SstaXhisp_4 |  2,727,660    .0045108     .067011          0          1
_SstaXhisp_5 |  2,727,660    .0003923    .0198021          0          1
_SstaXhisp_6 |  2,727,660    .0366585     .187922          0          1
_SstaXhisp_8 |  2,727,660    .0035903    .0598111          0          1
_SstaXhisp_9 |  2,727,660    .0014786    .0384236          0          1
-------------+---------------------------------------------------------
_SstaXhis~10 |  2,727,660    .0003285    .0181212          0          1
_SstaXhis~12 |  2,727,660    .0098363     .098689          0          1
_SstaXhis~13 |  2,727,660    .0009195    .0303088          0          1
_SstaXhis~15 |  2,727,660    .0007101    .0266389          0          1
_SstaXhis~16 |  2,727,660    .0011911    .0344922          0          1
-------------+---------------------------------------------------------
_SstaXhis~18 |  2,727,660    .0005661    .0237851          0          1
_SstaXhis~19 |  2,727,660    .0006225    .0249424          0          1
_SstaXhis~20 |  2,727,660    .0008659    .0294142          0          1
_SstaXhis~21 |  2,727,660    .0002394    .0154707          0          1
_SstaXhis~22 |  2,727,660    .0004033    .0200777          0          1
-------------+---------------------------------------------------------
_SstaXhis~23 |  2,727,660    .0000818    .0090415          0          1
_SstaXhis~24 |  2,727,660    .0010526     .032426          0          1
_SstaXhis~25 |  2,727,660    .0016146    .0401493          0          1
_SstaXhis~26 |  2,727,660    .0011211    .0334642          0          1
_SstaXhis~27 |  2,727,660    .0005653    .0237697          0          1
-------------+---------------------------------------------------------
_SstaXhis~28 |  2,727,660    .0001631    .0127717          0          1
_SstaXhis~29 |  2,727,660    .0003556    .0188544          0          1
_SstaXhis~30 |  2,727,660     .000286    .0169079          0          1
_SstaXhis~31 |  2,727,660       .0009    .0299871          0          1
_SstaXhis~32 |  2,727,660    .0032016    .0564924          0          1
-------------+---------------------------------------------------------
_SstaXhis~33 |  2,727,660     .000268    .0163684          0          1
_SstaXhis~34 |  2,727,660    .0049335    .0700656          0          1
_SstaXhis~35 |  2,727,660    .0067989    .0821745          0          1
_SstaXhis~36 |  2,727,660    .0104166    .1015289          0          1
_SstaXhis~37 |  2,727,660    .0011112    .0333163          0          1
-------------+---------------------------------------------------------
_SstaXhis~38 |  2,727,660    .0001503    .0122593          0          1
_SstaXhis~39 |  2,727,660    .0007369    .0271358          0          1
_SstaXhis~40 |  2,727,660    .0006793    .0260552          0          1
_SstaXhis~41 |  2,727,660    .0011493    .0338824          0          1
_SstaXhis~42 |  2,727,660    .0013172      .03627          0          1
-------------+---------------------------------------------------------
_SstaXhis~44 |  2,727,660    .0007798    .0279138          0          1
_SstaXhis~45 |  2,727,660    .0002669    .0163348          0          1
_SstaXhis~46 |  2,727,660    .0002372    .0153995          0          1
_SstaXhis~47 |  2,727,660    .0003311    .0181919          0          1
_SstaXhis~48 |  2,727,660    .0225897    .1485914          0          1
-------------+---------------------------------------------------------
_SstaXhis~49 |  2,727,660    .0013832    .0371662          0          1
_SstaXhis~50 |  2,727,660    .0000891    .0094382          0          1
_SstaXhis~51 |  2,727,660    .0010309    .0320914          0          1
_SstaXhis~53 |  2,727,660    .0010104    .0317706          0          1
_SstaXhis~54 |  2,727,660    .0000766    .0087531          0          1
-------------+---------------------------------------------------------
_SstaXhis~55 |  2,727,660    .0007175    .0267759          0          1
_SstaXhis~56 |  2,727,660    .0009613    .0309894          0          1
_SstaXfema_1 |  2,727,660    .0068729    .0826177          0          1
_SstaXfema_2 |  2,727,660    .0069191     .082893          0          1
_SstaXfema_4 |  2,727,660    .0071809    .0844353          0          1
-------------+---------------------------------------------------------
_SstaXfema_5 |  2,727,660    .0061668    .0782866          0          1
_SstaXfema_6 |  2,727,660    .0482919    .2143825          0          1
_SstaXfema_8 |  2,727,660     .008904    .0939398          0          1
_SstaXfema_9 |  2,727,660    .0073814    .0855975          0          1
_SstaXfem~10 |  2,727,660    .0037299    .0609592          0          1
-------------+---------------------------------------------------------
_SstaXfem~12 |  2,727,660    .0218502    .1461944          0          1
_SstaXfem~13 |  2,727,660    .0089344    .0940988          0          1
_SstaXfem~15 |  2,727,660    .0065034    .0803809          0          1
_SstaXfem~16 |  2,727,660     .006048    .0775336          0          1
_SstaXfem~18 |  2,727,660    .0078965    .0885108          0          1
-------------+---------------------------------------------------------
_SstaXfem~19 |  2,727,660     .007498    .0862658          0          1
_SstaXfem~20 |  2,727,660    .0068913    .0827271          0          1
_SstaXfem~21 |  2,727,660    .0068913    .0827271          0          1
_SstaXfem~22 |  2,727,660    .0060059    .0772646          0          1
_SstaXfem~23 |  2,727,660    .0057042    .0753102          0          1
-------------+---------------------------------------------------------
_SstaXfem~24 |  2,727,660    .0084255    .0914032          0          1
_SstaXfem~25 |  2,727,660    .0133653    .1148333          0          1
_SstaXfem~26 |  2,727,660    .0171029    .1296551          0          1
_SstaXfem~27 |  2,727,660    .0081575      .08995          0          1
_SstaXfem~28 |  2,727,660    .0061544     .078208          0          1
-------------+---------------------------------------------------------
_SstaXfem~29 |  2,727,660    .0074573    .0860331          0          1
_SstaXfem~30 |  2,727,660    .0059648    .0770016          0          1
_SstaXfem~31 |  2,727,660    .0070753    .0838167          0          1
_SstaXfem~32 |  2,727,660    .0073338    .0853228          0          1
_SstaXfem~33 |  2,727,660    .0066878     .081505          0          1
-------------+---------------------------------------------------------
_SstaXfem~34 |  2,727,660    .0164188    .1270798          0          1
_SstaXfem~35 |  2,727,660    .0073866    .0856271          0          1
_SstaXfem~36 |  2,727,660    .0319068    .1757521          0          1
_SstaXfem~37 |  2,727,660     .013733    .1163805          0          1
_SstaXfem~38 |  2,727,660    .0063949    .0797118          0          1
-------------+---------------------------------------------------------
_SstaXfem~39 |  2,727,660    .0184191    .1344613          0          1
_SstaXfem~40 |  2,727,660    .0066555    .0813095          0          1
_SstaXfem~41 |  2,727,660    .0066526    .0812917          0          1
_SstaXfem~42 |  2,727,660    .0190882     .136835          0          1
_SstaXfem~44 |  2,727,660    .0050344    .0707744          0          1
-------------+---------------------------------------------------------
_SstaXfem~45 |  2,727,660    .0065173    .0804664          0          1
_SstaXfem~46 |  2,727,660    .0070962    .0839395          0          1
_SstaXfem~47 |  2,727,660    .0067589    .0819343          0          1
_SstaXfem~48 |  2,727,660    .0288401     .167357          0          1
_SstaXfem~49 |  2,727,660    .0070522    .0836807          0          1
-------------+---------------------------------------------------------
_SstaXfem~50 |  2,727,660    .0048785     .069676          0          1
_SstaXfem~51 |  2,727,660    .0092259    .0956072          0          1
_SstaXfem~53 |  2,727,660    .0077301    .0875804          0          1
_SstaXfem~54 |  2,727,660    .0061602     .078245          0          1
_SstaXfem~55 |  2,727,660    .0082228    .0903061          0          1
-------------+---------------------------------------------------------
_SstaXfem~56 |  2,727,660    .0057419    .0755576          0          1
_SstaXyoun_1 |  2,727,660    .0027701    .0525592          0          1
_SstaXyoun_2 |  2,727,660    .0028999    .0537728          0          1
_SstaXyoun_4 |  2,727,660     .003147      .05601          0          1
_SstaXyoun_5 |  2,727,660    .0026096    .0510172          0          1
-------------+---------------------------------------------------------
_SstaXyoun_6 |  2,727,660    .0211159    .1437707          0          1
_SstaXyoun_8 |  2,727,660    .0034509    .0586433          0          1
_SstaXyoun_9 |  2,727,660     .002556    .0504926          0          1
_SstaXyou~10 |  2,727,660    .0016322    .0403671          0          1
_SstaXyou~12 |  2,727,660    .0084695    .0916395          0          1
-------------+---------------------------------------------------------
_SstaXyou~13 |  2,727,660    .0034275    .0584443          0          1
_SstaXyou~15 |  2,727,660     .002629    .0512063          0          1
_SstaXyou~16 |  2,727,660    .0025652    .0505828          0          1
_SstaXyou~18 |  2,727,660     .003242     .056846          0          1
_SstaXyou~19 |  2,727,660    .0031778    .0562825          0          1
-------------+---------------------------------------------------------
_SstaXyou~20 |  2,727,660    .0029754    .0544664          0          1
_SstaXyou~21 |  2,727,660    .0027397    .0522705          0          1
_SstaXyou~22 |  2,727,660    .0026044    .0509671          0          1
_SstaXyou~23 |  2,727,660    .0021311     .046115          0          1
_SstaXyou~24 |  2,727,660    .0031654    .0561723          0          1
-------------+---------------------------------------------------------
_SstaXyou~25 |  2,727,660    .0054281    .0734754          0          1
_SstaXyou~26 |  2,727,660    .0069943    .0833388          0          1
_SstaXyou~27 |  2,727,660     .003385    .0580818          0          1
_SstaXyou~28 |  2,727,660    .0025568    .0504998          0          1
_SstaXyou~29 |  2,727,660    .0030744    .0553623          0          1
-------------+---------------------------------------------------------
_SstaXyou~30 |  2,727,660    .0024343    .0492788          0          1
_SstaXyou~31 |  2,727,660    .0029831    .0545366          0          1
_SstaXyou~32 |  2,727,660    .0028739    .0535316          0          1
_SstaXyou~33 |  2,727,660    .0023815    .0487428          0          1
_SstaXyou~34 |  2,727,660    .0063949    .0797118          0          1
-------------+---------------------------------------------------------
_SstaXyou~35 |  2,727,660    .0031741    .0562501          0          1
_SstaXyou~36 |  2,727,660    .0128044    .1124297          0          1
_SstaXyou~37 |  2,727,660    .0054369    .0735346          0          1
_SstaXyou~38 |  2,727,660    .0028233    .0530597          0          1
_SstaXyou~39 |  2,727,660    .0073338    .0853228          0          1
-------------+---------------------------------------------------------
_SstaXyou~40 |  2,727,660    .0028413    .0532277          0          1
_SstaXyou~41 |  2,727,660    .0025538    .0504709          0          1
_SstaXyou~42 |  2,727,660    .0074247    .0858461          0          1
_SstaXyou~44 |  2,727,660    .0019786    .0444377          0          1
_SstaXyou~45 |  2,727,660    .0025051     .049988          0          1
-------------+---------------------------------------------------------
_SstaXyou~46 |  2,727,660    .0031467    .0560067          0          1
_SstaXyou~47 |  2,727,660     .002736    .0522356          0          1
_SstaXyou~48 |  2,727,660     .012697    .1119632          0          1
_SstaXyou~49 |  2,727,660    .0035525    .0594969          0          1
_SstaXyou~50 |  2,727,660    .0018052    .0424494          0          1
-------------+---------------------------------------------------------
_SstaXyou~51 |  2,727,660    .0035503    .0594785          0          1
_SstaXyou~53 |  2,727,660     .002996    .0546535          0          1
_SstaXyou~54 |  2,727,660    .0023346    .0482613          0          1
_SstaXyou~55 |  2,727,660    .0033677    .0579343          0          1
_SstaXyou~56 |  2,727,660    .0023588    .0485102          0          1
-------------+---------------------------------------------------------
_SstaXlows_1 |  2,727,660    .0074976    .0862637          0          1
_SstaXlows_2 |  2,727,660    .0064253       .0799          0          1
_SstaXlows_4 |  2,727,660      .00712    .0840793          0          1
_SstaXlows_5 |  2,727,660    .0072854    .0850429          0          1
_SstaXlows_6 |  2,727,660    .0477823    .2133054          0          1
-------------+---------------------------------------------------------
_SstaXlows_8 |  2,727,660    .0075116    .0863432          0          1
_SstaXlows_9 |  2,727,660     .006066     .077648          0          1
_SstaXlow~10 |  2,727,660    .0039367    .0626196          0          1
_SstaXlow~12 |  2,727,660    .0213901     .144681          0          1
_SstaXlow~13 |  2,727,660    .0089538    .0942001          0          1
-------------+---------------------------------------------------------
_SstaXlow~15 |  2,727,660    .0056675    .0750691          0          1
_SstaXlow~16 |  2,727,660    .0060818    .0777482          0          1
_SstaXlow~18 |  2,727,660    .0089667     .094267          0          1
_SstaXlow~19 |  2,727,660    .0072703    .0849557          0          1
_SstaXlow~20 |  2,727,660    .0059194    .0767093          0          1
-------------+---------------------------------------------------------
_SstaXlow~21 |  2,727,660    .0076336    .0870367          0          1
_SstaXlow~22 |  2,727,660    .0065595    .0807245          0          1
_SstaXlow~23 |  2,727,660    .0059952    .0771966          0          1
_SstaXlow~24 |  2,727,660    .0073609    .0854793          0          1
_SstaXlow~25 |  2,727,660    .0116089    .1071172          0          1
-------------+---------------------------------------------------------
_SstaXlow~26 |  2,727,660    .0170406    .1294227          0          1
_SstaXlow~27 |  2,727,660    .0069089    .0828319          0          1
_SstaXlow~28 |  2,727,660    .0064634    .0801351          0          1
_SstaXlow~29 |  2,727,660    .0076007    .0868498          0          1
_SstaXlow~30 |  2,727,660    .0056954    .0752524          0          1
-------------+---------------------------------------------------------
_SstaXlow~31 |  2,727,660    .0064348    .0799588          0          1
_SstaXlow~32 |  2,727,660    .0079687    .0889114          0          1
_SstaXlow~33 |  2,727,660    .0056382    .0748758          0          1
_SstaXlow~34 |  2,727,660    .0154246    .1232342          0          1
_SstaXlow~35 |  2,727,660    .0079812    .0889804          0          1
-------------+---------------------------------------------------------
_SstaXlow~36 |  2,727,660    .0303909    .1716604          0          1
_SstaXlow~37 |  2,727,660    .0143489    .1189245          0          1
_SstaXlow~38 |  2,727,660    .0053621    .0730298          0          1
_SstaXlow~39 |  2,727,660    .0193529    .1377618          0          1
_SstaXlow~40 |  2,727,660    .0069191     .082893          0          1
-------------+---------------------------------------------------------
_SstaXlow~41 |  2,727,660    .0060972     .077846          0          1
_SstaXlow~42 |  2,727,660    .0206565    .1422317          0          1
_SstaXlow~44 |  2,727,660    .0048342      .06936          0          1
_SstaXlow~45 |  2,727,660    .0069158    .0828733          0          1
_SstaXlow~46 |  2,727,660    .0069228    .0829148          0          1
-------------+---------------------------------------------------------
_SstaXlow~47 |  2,727,660    .0074423     .085947          0          1
_SstaXlow~48 |  2,727,660    .0313093    .1741522          0          1
_SstaXlow~49 |  2,727,660    .0060928     .077818          0          1
_SstaXlow~50 |  2,727,660    .0047708    .0689057          0          1
_SstaXlow~51 |  2,727,660    .0084255    .0914032          0          1
-------------+---------------------------------------------------------
_SstaXlow~53 |  2,727,660    .0064634    .0801351          0          1
_SstaXlow~54 |  2,727,660    .0076413    .0870802          0          1
_SstaXlow~55 |  2,727,660    .0080538    .0893808          0          1
_SstaXlow~56 |  2,727,660     .005376    .0731241          0          1
_SstaXttre_1 |  2,727,660    .1983979    2.030124          0         30
-------------+---------------------------------------------------------
_SstaXttre_2 |  2,727,660    .2061577    2.067788          0         30
_SstaXttre_4 |  2,727,660    .2246486    2.183529          0         30
_SstaXttre_5 |  2,727,660     .178255    1.913611          0         30
_SstaXttre_6 |  2,727,660    1.496719    5.444228          0         30
_SstaXttre_8 |  2,727,660    .3049673    2.602771          0         30
-------------+---------------------------------------------------------
_SstaXttre_9 |  2,727,660    .2606036    2.447108          0         30
_SstaXtt~_10 |  2,727,660    .0882001     1.26383          0         27
_SstaXtt~_12 |  2,727,660    .6825623    3.721469          0         30
_SstaXtt~_13 |  2,727,660    .2856617    2.519463          0         30
_SstaXtt~_15 |  2,727,660    .2224581     2.23392          0         30
-------------+---------------------------------------------------------
_SstaXtt~_16 |  2,727,660    .1847246     1.96887          0         30
_SstaXtt~_18 |  2,727,660    .2391871    2.263727          0         30
_SstaXtt~_19 |  2,727,660    .2468372    2.331547          0         30
_SstaXtt~_20 |  2,727,660    .2243872    2.198298          0         30
_SstaXtt~_21 |  2,727,660    .2116451    2.130829          0         30
-------------+---------------------------------------------------------
_SstaXtt~_22 |  2,727,660    .1664408    1.847527          0         30
_SstaXtt~_23 |  2,727,660    .1688389    1.848257          0         27
_SstaXtt~_24 |  2,727,660    .2763431    2.505063          0         30
_SstaXtt~_25 |  2,727,660    .3561283    2.565064          0         30
_SstaXtt~_26 |  2,727,660    .4834052    3.064622          0         30
-------------+---------------------------------------------------------
_SstaXtt~_27 |  2,727,660    .2822265    2.533435          0         30
_SstaXtt~_28 |  2,727,660    .1673409    1.837529          0         30
_SstaXtt~_29 |  2,727,660    .2285431    2.226801          0         30
_SstaXtt~_30 |  2,727,660    .1715661    1.853841          0         30
_SstaXtt~_31 |  2,727,660    .2278392    2.211093          0         30
-------------+---------------------------------------------------------
_SstaXtt~_32 |  2,727,660    .2486098    2.334896          0         30
_SstaXtt~_33 |  2,727,660     .243633     2.36867          0         30
_SstaXtt~_34 |  2,727,660    .4627091    2.983043          0         30
_SstaXtt~_35 |  2,727,660    .2072747    2.034344          0         30
_SstaXtt~_36 |  2,727,660    .8762107    4.093777          0         30
-------------+---------------------------------------------------------
_SstaXtt~_37 |  2,727,660    .3907892    2.741393          0         30
_SstaXtt~_38 |  2,727,660    .1982494    2.037074          0         30
_SstaXtt~_39 |  2,727,660    .5174153    3.179602          0         30
_SstaXtt~_40 |  2,727,660      .19993    2.043517          0         30
_SstaXtt~_41 |  2,727,660    .2129818    2.145531          0         30
-------------+---------------------------------------------------------
_SstaXtt~_42 |  2,727,660    .5494427     3.29994          0         30
_SstaXtt~_44 |  2,727,660     .156653    1.853909          0         29
_SstaXtt~_45 |  2,727,660    .1966931    2.042975          0         30
_SstaXtt~_46 |  2,727,660    .2247274    2.183561          0         30
_SstaXtt~_47 |  2,727,660    .2041145    2.079847          0         30
-------------+---------------------------------------------------------
_SstaXtt~_48 |  2,727,660    .8836992     4.24018          0         30
_SstaXtt~_49 |  2,727,660    .2178142    2.152312          0         30
_SstaXtt~_50 |  2,727,660    .1612488    1.910464          0         30
_SstaXtt~_51 |  2,727,660    .2957055    2.536374          0         30
_SstaXtt~_53 |  2,727,660    .2548177    2.364345          0         30
-------------+---------------------------------------------------------
_SstaXtt~_54 |  2,727,660    .1836241    1.956544          0         30
_SstaXtt~_55 |  2,727,660    .2739154    2.442502          0         30
_SstaXtt~_56 |  2,727,660     .188382    2.018311          0         30
_SstaXttrea1 |  2,727,660    4.160763    48.51712          0        900
_SstaXttrea2 |  2,727,660    4.318245    50.67809          0        900
-------------+---------------------------------------------------------
_SstaXttrea4 |  2,727,660    4.818265    52.72612          0        900
_SstaXttrea5 |  2,727,660    3.693682    45.74038          0        900
_SstaXttrea6 |  2,727,660    31.87977      133.66          0        900
_SstaXttrea8 |  2,727,660    6.867417    64.79802          0        900
_SstaXttrea9 |  2,727,660     6.05625    62.20009          0        900
-------------+---------------------------------------------------------
_SstaXtt~a10 |  2,727,660    1.605044    27.75741          0        729
_SstaXtt~a12 |  2,727,660    14.31522    89.49002          0        900
_SstaXtt~a13 |  2,727,660    6.429292    63.30411          0        900
_SstaXtt~a15 |  2,727,660    5.039884    56.08626          0        900
_SstaXtt~a16 |  2,727,660    3.910569    47.79486          0        900
-------------+---------------------------------------------------------
_SstaXtt~a18 |  2,727,660     5.18167    55.29668          0        900
_SstaXtt~a19 |  2,727,660    5.497036    58.05925          0        900
_SstaXtt~a20 |  2,727,660    4.882861    53.69473          0        900
_SstaXtt~a21 |  2,727,660    4.585223    52.16633          0        900
_SstaXtt~a22 |  2,727,660    3.441056    43.96523          0        900
-------------+---------------------------------------------------------
_SstaXtt~a23 |  2,727,660    3.444559     42.1724          0        729
_SstaXtt~a24 |  2,727,660    6.351703    63.91256          0        900
_SstaXtt~a25 |  2,727,660    6.706379    58.34159          0        900
_SstaXtt~a26 |  2,727,660    9.625585    71.74489          0        900
_SstaXtt~a27 |  2,727,660     6.49794    64.34994          0        900
-------------+---------------------------------------------------------
_SstaXtt~a28 |  2,727,660    3.404516    43.53041          0        900
_SstaXtt~a29 |  2,727,660    5.010872    55.20937          0        900
_SstaXtt~a30 |  2,727,660    3.466161    43.62048          0        900
_SstaXtt~a31 |  2,727,660    4.940843    53.97111          0        900
_SstaXtt~a32 |  2,727,660    5.513545    57.36251          0        900
-------------+---------------------------------------------------------
_SstaXtt~a33 |  2,727,660    5.669952    60.05772          0        900
_SstaXtt~a34 |  2,727,660    9.112643    69.44644          0        900
_SstaXtt~a35 |  2,727,660    4.181515    47.61341          0        900
_SstaXtt~a36 |  2,727,660    17.52675    96.25986          0        900
_SstaXtt~a37 |  2,727,660    7.667948    63.93874          0        900
-------------+---------------------------------------------------------
_SstaXtt~a38 |  2,727,660     4.18897     49.1939          0        900
_SstaXtt~a39 |  2,727,660    10.37758    74.89858          0        900
_SstaXtt~a40 |  2,727,660    4.215932    49.29066          0        900
_SstaXtt~a41 |  2,727,660    4.648662    52.47447          0        900
_SstaXtt~a42 |  2,727,660    11.19149    78.10813          0        900
-------------+---------------------------------------------------------
_SstaXtt~a44 |  2,727,660    3.461518    46.03977          0        841
_SstaXtt~a45 |  2,727,660    4.212433    49.95478          0        900
_SstaXtt~a46 |  2,727,660    4.818441    53.26412          0        900
_SstaXtt~a47 |  2,727,660    4.367424    50.66624          0        900
_SstaXtt~a48 |  2,727,660    18.76004    103.6352          0        900
-------------+---------------------------------------------------------
_SstaXtt~a49 |  2,727,660    4.679889     52.1722          0        900
_SstaXtt~a50 |  2,727,660    3.675872    48.14732          0        900
_SstaXtt~a51 |  2,727,660     6.52063    63.01873          0        900
_SstaXtt~a53 |  2,727,660    5.655057    58.46225          0        900
_SstaXtt~a54 |  2,727,660    3.861781    46.79586          0        900
-------------+---------------------------------------------------------
_SstaXtt~a55 |  2,727,660    6.040843    60.21615          0        900
_SstaXtt~a56 |  2,727,660    4.109065    49.26848          0        900
_SstaXttreb1 |  2,727,660     96.7022     1247.06          0      27000
_SstaXttreb2 |  2,727,660    102.5242     1338.79          0      27000
_SstaXttreb4 |  2,727,660    113.3595    1363.972          0      27000
-------------+---------------------------------------------------------
_SstaXttreb5 |  2,727,660    85.61819    1182.794          0      27000
_SstaXttreb6 |  2,727,660     754.655    3520.237          0      27000
_SstaXttreb8 |  2,727,660    167.3472    1705.072          0      27000
_SstaXttreb9 |  2,727,660    151.0796    1658.706          0      27000
_SstaXtt~b10 |  2,727,660    33.89504    671.0029          0      19683
-------------+---------------------------------------------------------
_SstaXtt~b12 |  2,727,660    333.1707    2322.352          0      27000
_SstaXtt~b13 |  2,727,660    157.8408    1685.965          0      27000
_SstaXtt~b15 |  2,727,660    123.8662    1486.934          0      27000
_SstaXtt~b16 |  2,727,660    92.24642     1246.58          0      27000
_SstaXtt~b18 |  2,727,660    123.5231    1436.945          0      27000
-------------+---------------------------------------------------------
_SstaXtt~b19 |  2,727,660    133.7295    1533.662          0      27000
_SstaXtt~b20 |  2,727,660    116.3433    1398.351          0      27000
_SstaXtt~b21 |  2,727,660    109.3942      1364.5          0      27000
_SstaXtt~b22 |  2,727,660    79.47693    1131.359          0      27000
_SstaXtt~b23 |  2,727,660    76.84902    1017.281          0      19683
-------------+---------------------------------------------------------
_SstaXtt~b24 |  2,727,660    158.7547    1714.514          0      27000
_SstaXtt~b25 |  2,727,660     145.893    1479.385          0      27000
_SstaXtt~b26 |  2,727,660    217.0326    1837.624          0      27000
_SstaXtt~b27 |  2,727,660    161.8572    1715.489          0      27000
_SstaXtt~b28 |  2,727,660    78.05581    1121.207          0      27000
-------------+---------------------------------------------------------
_SstaXtt~b29 |  2,727,660    121.2177    1455.134          0      27000
_SstaXtt~b30 |  2,727,660    78.91218    1117.707          0      27000
_SstaXtt~b31 |  2,727,660    117.5746    1406.654          0      27000
_SstaXtt~b32 |  2,727,660    132.4523     1495.53          0      27000
_SstaXtt~b33 |  2,727,660    141.1688    1596.958          0      27000
-------------+---------------------------------------------------------
_SstaXtt~b34 |  2,727,660    203.9379    1777.887          0      27000
_SstaXtt~b35 |  2,727,660    94.72004    1213.518          0      27000
_SstaXtt~b36 |  2,727,660    396.0843    2471.865          0      27000
_SstaXtt~b37 |  2,727,660    171.7508    1643.853          0      27000
_SstaXtt~b38 |  2,727,660    98.32372    1277.423          0      27000
-------------+---------------------------------------------------------
_SstaXtt~b39 |  2,727,660    235.5439    1926.207          0      27000
_SstaXtt~b40 |  2,727,660    98.80239    1280.695          0      27000
_SstaXtt~b41 |  2,727,660    110.9661    1367.926          0      27000
_SstaXtt~b42 |  2,727,660     255.844    2008.436          0      27000
_SstaXtt~b44 |  2,727,660    84.01517    1207.404          0      24389
-------------+---------------------------------------------------------
_SstaXtt~b45 |  2,727,660    100.1593    1310.101          0      27000
_SstaXtt~b46 |  2,727,660    114.3703    1392.232          0      27000
_SstaXtt~b47 |  2,727,660    103.5126    1323.704          0      27000
_SstaXtt~b48 |  2,727,660    443.5085     2723.29          0      27000
_SstaXtt~b49 |  2,727,660    110.5734    1351.671          0      27000
-------------+---------------------------------------------------------
_SstaXtt~b50 |  2,727,660    90.80506    1277.628          0      27000
_SstaXtt~b51 |  2,727,660    157.9901    1666.055          0      27000
_SstaXtt~b53 |  2,727,660    136.6624    1533.347          0      27000
_SstaXtt~b54 |  2,727,660    89.82515    1204.018          0      27000
_SstaXtt~b55 |  2,727,660    145.4225    1577.474          0      27000
-------------+---------------------------------------------------------
_SstaXtt~b56 |  2,727,660    97.89172    1283.153          0      27000
      empdhi |  2,050,173    .2756641    .4468484          0          1
        empd |  2,727,660    .7516234    .4320715          0          1
      empdlg |  1,706,676    .4348048    .4957315          0          1
          ph |  2,260,384    .6655944    .4717823          0          1
-------------+---------------------------------------------------------
        lrhw |  2,125,529    2.445311     .776934  -8.419633   12.68814

. summ empd empdhi inclughr pensionr lrhw if pro==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |  2,472,634    .7512171    .4323078          0          1
      empdhi |  1,857,485    .2781347    .4480802          0          1
    inclughr |  2,052,252     .536496    .4986664          0          1
    pensionr |  2,052,250    .5263676    .4993044          0          1
        lrhw |  1,928,242    2.444686     .779834  -8.419633   11.12423

. reg empd $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 4,323,425,360)

Linear regression                               Number of obs     =  2,723,128
                                                F(30, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0871
                                                Root MSE          =     .41415

                                  (Std. Err. adjusted for 50 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
            empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
        blackpro |   .0004871   .0063939     0.08   0.940    -.0123618    .0133361
         hisppro |  -.0074774   .0079195    -0.94   0.350    -.0233923    .0084375
       femalepro |   .0006602   .0078474     0.08   0.933    -.0151098    .0164301
        youngpro |   .0023549   .0048385     0.49   0.629    -.0073685    .0120782
     lowskillpro |   .0004671   .0048277     0.10   0.923    -.0092345    .0101687
             pro |   .0091687   .0070242     1.31   0.198     -.004947    .0232844
           black |  -.1556118   .0054273   -28.67   0.000    -.1665185   -.1447052
            hisp |  -.0655856   .0056977   -11.51   0.000    -.0770356   -.0541356
          female |  -.2248147    .006426   -34.99   0.000    -.2377282   -.2119011
        lowskill |  -.0868636   .0028959   -30.00   0.000    -.0926832    -.081044
             age |   .0401851   .0009922    40.50   0.000     .0381911    .0421791
            age2 |  -.0005032   .0000128   -39.39   0.000    -.0005288   -.0004775
           eg200 |   .0051638   .0033204     1.56   0.126    -.0015087    .0118364
           eg300 |  -.0453845    .008425    -5.39   0.000    -.0623152   -.0284539
           eg400 |  -.0559201   .0151299    -3.70   0.001    -.0863247   -.0255154
           eg500 |  -.0177963   .0093436    -1.90   0.063     -.036573    .0009804
           eg900 |   .0954613   .0461646     2.07   0.044     .0026901    .1882326
         minwage |   .0037674   .0011925     3.16   0.003      .001371    .0061638
unemploymentrate |  -.0117701    .000546   -21.56   0.000    -.0128673    -.010673
         incarcr |  -.9062145   1.096406    -0.83   0.413    -3.109524    1.297095
          ttrend |   .0005228   .0008232     0.64   0.528    -.0011316    .0021772
         ttrend2 |  -.0002257    .000048    -4.70   0.000    -.0003223   -.0001292
         ttrend3 |   4.55e-06   1.15e-06     3.97   0.000     2.24e-06    6.85e-06
        ttrendbl |  -.0074197   .0021076    -3.52   0.001    -.0116551   -.0031843
       ttrend2bl |   .0006702   .0001742     3.85   0.000     .0003202    .0010202
       ttrend3bl |  -.0000139   3.70e-06    -3.75   0.000    -.0000213   -6.44e-06
        ttrendhi |  -.0051392    .000937    -5.48   0.000    -.0070222   -.0032562
       ttrend2hi |   .0006017   .0000862     6.98   0.000     .0004285     .000775
       ttrend3hi |  -.0000124   1.83e-06    -6.77   0.000    -.0000161   -8.71e-06
        ttrendfe |   .0142023   .0012583    11.29   0.000     .0116737    .0167309
       ttrend2fe |  -.0006282   .0000852    -7.37   0.000    -.0007994    -.000457
       ttrend3fe |   .0000102   1.76e-06     5.79   0.000     6.65e-06    .0000137
        ttrendyo |  -.0008845   .0019823    -0.45   0.657    -.0048681    .0030992
       ttrend2yo |     .00005   .0001348     0.37   0.712     -.000221    .0003209
       ttrend3yo |  -3.14e-06   2.71e-06    -1.16   0.251    -8.58e-06    2.30e-06
        ttrendlo |  -.0060617    .000669    -9.06   0.000    -.0074062   -.0047172
       ttrend2lo |   .0004885   .0000516     9.46   0.000     .0003848    .0005922
       ttrend3lo |  -.0000116   1.24e-06    -9.39   0.000    -.0000141   -9.14e-06
    _Sstatefip_1 |   .0132788   .0054499     2.44   0.019     .0023268    .0242308
    _Sstatefip_2 |  -.0473085   .0052873    -8.95   0.000    -.0579337   -.0366833
    _Sstatefip_4 |  -.0053369   .0057227    -0.93   0.356    -.0168372    .0061633
    _Sstatefip_5 |  -.0181962   .0037655    -4.83   0.000    -.0257632   -.0106291
    _Sstatefip_6 |    .008223   .0028594     2.88   0.006     .0024768    .0139692
    _Sstatefip_8 |   -.012186   .0029051    -4.19   0.000    -.0180241    -.006348
    _Sstatefip_9 |  -.0270599   .0032679    -8.28   0.000     -.033627   -.0204928
   _Sstatefip_10 |  -.0468499   .0046993    -9.97   0.000    -.0562935   -.0374062
   _Sstatefip_12 |  -.0271442   .0055195    -4.92   0.000     -.038236   -.0160523
   _Sstatefip_13 |   .0032657   .0055311     0.59   0.558    -.0078494    .0143808
   _Sstatefip_15 |  -.0400359   .0033314   -12.02   0.000    -.0467306   -.0333412
   _Sstatefip_16 |  -.0797979   .0039232   -20.34   0.000    -.0876818    -.071914
   _Sstatefip_18 |  -.0155956   .0033771    -4.62   0.000     -.022382   -.0088091
   _Sstatefip_19 |  -.0704585   .0045105   -15.62   0.000    -.0795227   -.0613943
   _Sstatefip_20 |  -.0391319   .0033006   -11.86   0.000    -.0457648   -.0324991
   _Sstatefip_21 |   .0009383   .0028344     0.33   0.742    -.0047577    .0066344
   _Sstatefip_22 |   .0190584   .0050457     3.78   0.000     .0089187    .0291981
   _Sstatefip_23 |   -.067498   .0031972   -21.11   0.000     -.073923   -.0610731
   _Sstatefip_24 |  -.0224263   .0033888    -6.62   0.000    -.0292362   -.0156163
   _Sstatefip_25 |  -.0386938   .0036407   -10.63   0.000      -.04601   -.0313776
   _Sstatefip_26 |  -.0101243    .003927    -2.58   0.013    -.0180159   -.0022327
   _Sstatefip_27 |  -.0459641     .00364   -12.63   0.000    -.0532789   -.0386493
   _Sstatefip_28 |   .0284342   .0047605     5.97   0.000     .0188676    .0380008
   _Sstatefip_29 |  -.0208579   .0029691    -7.02   0.000    -.0268246   -.0148912
   _Sstatefip_30 |  -.0864822    .002968   -29.14   0.000    -.0924466   -.0805177
   _Sstatefip_31 |  -.0624818    .003198   -19.54   0.000    -.0689085   -.0560551
   _Sstatefip_32 |   .0053517   .0045698     1.17   0.247    -.0038316    .0145351
   _Sstatefip_33 |  -.0389973   .0038325   -10.18   0.000    -.0466991   -.0312956
   _Sstatefip_34 |  -.0260503   .0028933    -9.00   0.000    -.0318647    -.020236
   _Sstatefip_35 |  -.0220636   .0030961    -7.13   0.000    -.0282855   -.0158417
   _Sstatefip_36 |   -.013328   .0027441    -4.86   0.000    -.0188425   -.0078136
   _Sstatefip_37 |  -.0192969   .0049066    -3.93   0.000    -.0291571   -.0094366
   _Sstatefip_38 |  -.0934356   .0036459   -25.63   0.000    -.1007623   -.0861089
   _Sstatefip_39 |  -.0168402   .0037862    -4.45   0.000     -.024449   -.0092315
   _Sstatefip_40 |  -.0168068   .0036475    -4.61   0.000    -.0241367    -.009477
   _Sstatefip_41 |  -.0478469   .0030041   -15.93   0.000    -.0538839   -.0418099
   _Sstatefip_42 |  -.0383903   .0029451   -13.04   0.000    -.0443087    -.032472
   _Sstatefip_44 |  -.0237013   .0030786    -7.70   0.000    -.0298881   -.0175146
   _Sstatefip_45 |   .0029169   .0078819     0.37   0.713    -.0129224    .0187562
   _Sstatefip_46 |  -.0737293   .0036583   -20.15   0.000    -.0810808   -.0663777
   _Sstatefip_47 |   -.023092   .0042107    -5.48   0.000    -.0315537   -.0146303
   _Sstatefip_48 |   .0077038   .0044803     1.72   0.092    -.0012997    .0167072
   _Sstatefip_49 |  -.0749915    .004478   -16.75   0.000    -.0839904   -.0659927
   _Sstatefip_50 |  -.0552636   .0031763   -17.40   0.000    -.0616467   -.0488805
   _Sstatefip_51 |  -.0334101   .0032367   -10.32   0.000    -.0399145   -.0269056
   _Sstatefip_53 |  -.0384202   .0034816   -11.04   0.000    -.0454169   -.0314236
   _Sstatefip_54 |   .0054214   .0032397     1.67   0.101     -.001089    .0119317
   _Sstatefip_55 |   -.057093    .003088   -18.49   0.000    -.0632985   -.0508874
   _Sstatefip_56 |  -.0268841   .0036175    -7.43   0.000    -.0341537   -.0196145
    _SstaXblac_1 |   .0675837    .003559    18.99   0.000     .0604317    .0747358
    _SstaXblac_2 |   .1836472   .0021633    84.89   0.000     .1792998    .1879945
    _SstaXblac_4 |     .10504   .0041762    25.15   0.000     .0966477    .1134324
    _SstaXblac_5 |   .0421402   .0022276    18.92   0.000     .0376637    .0466166
    _SstaXblac_6 |   .0824584   .0003815   216.17   0.000     .0816918    .0832249
    _SstaXblac_8 |   .0728504   .0004009   181.70   0.000     .0720447    .0736561
    _SstaXblac_9 |   .1024305   .0002653   386.13   0.000     .1018974    .1029636
   _SstaXblac_10 |   .1067989   .0013611    78.47   0.000     .1040636    .1095341
   _SstaXblac_12 |   .0973341    .002764    35.22   0.000     .0917797    .1028885
   _SstaXblac_13 |   .0988024   .0032365    30.53   0.000     .0922983    .1053065
   _SstaXblac_15 |   .1197535    .000701   170.84   0.000     .1183448    .1211621
   _SstaXblac_16 |   .0209362   .0034684     6.04   0.000     .0139663    .0279062
   _SstaXblac_18 |   .0372068   .0004759    78.17   0.000     .0362503    .0381632
   _SstaXblac_19 |  -.0225776   .0036844    -6.13   0.000    -.0299817   -.0151734
   _SstaXblac_20 |   .0397987   .0003945   100.88   0.000     .0390058    .0405915
   _SstaXblac_21 |   .0847072   .0003197   264.92   0.000     .0840647    .0853498
   _SstaXblac_22 |   .0575558   .0019763    29.12   0.000     .0535844    .0615273
   _SstaXblac_23 |   .1647068   .0004902   336.03   0.000     .1637218    .1656918
   _SstaXblac_24 |    .114666   .0003262   351.48   0.000     .1140104    .1153216
   _SstaXblac_25 |    .058063   .0005001   116.11   0.000     .0570581     .059068
   _SstaXblac_26 |    .005207   .0003729    13.97   0.000     .0044577    .0059563
   _SstaXblac_27 |   .0060698   .0006032    10.06   0.000     .0048577     .007282
   _SstaXblac_28 |   .0724224   .0028482    25.43   0.000     .0666987     .078146
   _SstaXblac_29 |   .0594859   .0003323   179.01   0.000     .0588181    .0601537
   _SstaXblac_30 |   .1105249   .0008068   136.99   0.000     .1089036    .1121462
   _SstaXblac_31 |    .011071   .0003119    35.49   0.000     .0104442    .0116978
   _SstaXblac_32 |   .0877634   .0005445   161.17   0.000     .0866691    .0888577
   _SstaXblac_33 |   .0579068   .0011136    52.00   0.000      .055669    .0601446
   _SstaXblac_34 |   .0899993   .0003265   275.62   0.000     .0893431    .0906555
   _SstaXblac_35 |   .0925209   .0004035   229.29   0.000       .09171    .0933318
   _SstaXblac_36 |    .056607   .0003093   183.00   0.000     .0559854    .0572287
   _SstaXblac_37 |   .0939377   .0002991   314.12   0.000     .0933367    .0945386
   _SstaXblac_38 |   .1307035   .0007046   185.51   0.000     .1292876    .1321194
   _SstaXblac_39 |   .0439033   .0024583    17.86   0.000     .0389631    .0488434
   _SstaXblac_40 |   .0558167   .0003714   150.31   0.000     .0550704    .0565629
   _SstaXblac_41 |   .0312951   .0003027   103.39   0.000     .0306868    .0319033
   _SstaXblac_42 |   .0207921   .0003854    53.95   0.000     .0200176    .0215666
   _SstaXblac_44 |   .0686657   .0003397   202.15   0.000     .0679831    .0693483
   _SstaXblac_45 |   .0761434    .005696    13.37   0.000     .0646968    .0875901
   _SstaXblac_46 |   .1403174   .0012044   116.50   0.000     .1378971    .1427378
   _SstaXblac_47 |   .1083134   .0029037    37.30   0.000     .1024781    .1141487
   _SstaXblac_48 |   .0946598   .0003131   302.37   0.000     .0940306    .0952889
   _SstaXblac_49 |   .1295984   .0031033    41.76   0.000     .1233622    .1358346
   _SstaXblac_50 |   .0530284   .0011453    46.30   0.000     .0507268      .05533
   _SstaXblac_51 |   .1237933   .0003385   365.72   0.000      .123113    .1244735
   _SstaXblac_53 |   .0867736   .0003747   231.57   0.000     .0860206    .0875267
   _SstaXblac_54 |   .1184635    .000597   198.43   0.000     .1172637    .1196632
   _SstaXblac_55 |  -.0373235   .0003196  -116.78   0.000    -.0379657   -.0366812
   _SstaXblac_56 |   .0944688   .0004457   211.98   0.000     .0935732    .0953644
    _SstaXhisp_1 |   .0931419   .0048859    19.06   0.000     .0833233    .1029604
    _SstaXhisp_2 |   .0716625   .0034109    21.01   0.000      .064808     .078517
    _SstaXhisp_4 |  -.0069014     .00519    -1.33   0.190    -.0173311    .0035284
    _SstaXhisp_5 |   .0782383   .0035993    21.74   0.000     .0710052    .0854714
    _SstaXhisp_6 |   .0264881   .0004766    55.58   0.000     .0255303    .0274459
    _SstaXhisp_8 |  -.0231195   .0006779   -34.10   0.000    -.0244819   -.0217571
    _SstaXhisp_9 |  -.0822288   .0007823  -105.11   0.000     -.083801   -.0806566
   _SstaXhisp_10 |  -.0431506   .0011899   -36.26   0.000    -.0455419   -.0407594
   _SstaXhisp_12 |   .0155926   .0037439     4.16   0.000      .008069    .0231163
   _SstaXhisp_13 |   .0384551   .0045938     8.37   0.000     .0292235    .0476867
   _SstaXhisp_15 |  -.0078771   .0010102    -7.80   0.000    -.0099072    -.005847
   _SstaXhisp_16 |   .0061167   .0040995     1.49   0.142    -.0021216    .0143549
   _SstaXhisp_18 |  -.0239299   .0009848   -24.30   0.000     -.025909   -.0219508
   _SstaXhisp_19 |  -.0467659   .0052091    -8.98   0.000    -.0572339   -.0362979
   _SstaXhisp_20 |  -.0032693   .0008026    -4.07   0.000    -.0048822   -.0016565
   _SstaXhisp_21 |   .0410154   .0015519    26.43   0.000     .0378966    .0441341
   _SstaXhisp_22 |   .0154988   .0030134     5.14   0.000     .0094431    .0215544
   _SstaXhisp_23 |  -.0296251   .0011517   -25.72   0.000    -.0319395   -.0273107
   _SstaXhisp_24 |   .0574581   .0016629    34.55   0.000     .0541163    .0607999
   _SstaXhisp_25 |  -.0955762   .0006894  -138.64   0.000    -.0969615   -.0941909
   _SstaXhisp_26 |  -.0349818   .0006219   -56.25   0.000    -.0362315   -.0337321
   _SstaXhisp_27 |  -.0334395   .0014292   -23.40   0.000    -.0363116   -.0305674
   _SstaXhisp_28 |   .0776955   .0043782    17.75   0.000     .0688971    .0864939
   _SstaXhisp_29 |   .0124654    .001152    10.82   0.000     .0101504    .0147803
   _SstaXhisp_30 |  -.0152987   .0006547   -23.37   0.000    -.0166143   -.0139831
   _SstaXhisp_31 |    -.04412   .0012227   -36.08   0.000    -.0465771   -.0416629
   _SstaXhisp_32 |   .0199512   .0014948    13.35   0.000     .0169473    .0229551
   _SstaXhisp_33 |   .0385945   .0013916    27.73   0.000      .035798    .0413911
   _SstaXhisp_34 |  -.0040529   .0005054    -8.02   0.000    -.0050685   -.0030373
   _SstaXhisp_35 |   .0247461    .000623    39.72   0.000     .0234941    .0259981
   _SstaXhisp_36 |  -.0544126   .0006414   -84.84   0.000    -.0557015   -.0531237
   _SstaXhisp_37 |   .0192915     .00244     7.91   0.000     .0143882    .0241948
   _SstaXhisp_38 |  -.0205247   .0009159   -22.41   0.000    -.0223653    -.018684
   _SstaXhisp_39 |  -.0246059   .0038146    -6.45   0.000    -.0322715   -.0169402
   _SstaXhisp_40 |   .0369578   .0006812    54.25   0.000     .0355888    .0383268
   _SstaXhisp_41 |    .026506   .0011981    22.12   0.000     .0240983    .0289137
   _SstaXhisp_42 |  -.0775566     .00112   -69.25   0.000    -.0798074   -.0753058
   _SstaXhisp_44 |  -.0579314   .0006533   -88.67   0.000    -.0592444   -.0566185
   _SstaXhisp_45 |   .0115555   .0060465     1.91   0.062    -.0005954    .0237065
   _SstaXhisp_46 |  -.0223654   .0015922   -14.05   0.000    -.0255651   -.0191658
   _SstaXhisp_47 |   .0381043   .0046177     8.25   0.000     .0288246     .047384
   _SstaXhisp_48 |  -.0085857   .0004892   -17.55   0.000    -.0095687   -.0076026
   _SstaXhisp_49 |  -.0088787   .0036578    -2.43   0.019    -.0162292   -.0015281
   _SstaXhisp_50 |   .0511002   .0004503   113.49   0.000     .0501954     .052005
   _SstaXhisp_51 |   .0366983   .0014844    24.72   0.000     .0337153    .0396814
   _SstaXhisp_53 |   .0100269   .0015246     6.58   0.000      .006963    .0130907
   _SstaXhisp_54 |   .0108104   .0011199     9.65   0.000     .0085599     .013061
   _SstaXhisp_55 |  -.0533053   .0016069   -33.17   0.000    -.0565345    -.050076
   _SstaXhisp_56 |   .0025114    .000857     2.93   0.005     .0007893    .0042335
    _SstaXfema_1 |  -.0291914   .0039562    -7.38   0.000    -.0371417   -.0212412
    _SstaXfema_2 |   .0207706   .0023616     8.80   0.000     .0160248    .0255163
    _SstaXfema_4 |   -.054901   .0047082   -11.66   0.000    -.0643624   -.0454395
    _SstaXfema_5 |  -.0119378   .0024509    -4.87   0.000    -.0168632   -.0070125
    _SstaXfema_6 |  -.0381758   .0002432  -156.98   0.000    -.0386645   -.0376871
    _SstaXfema_8 |  -.0135789    .000352   -38.57   0.000    -.0142863   -.0128714
    _SstaXfema_9 |   .0173506    .000108   160.65   0.000     .0171336    .0175676
   _SstaXfema_10 |   .0069427   .0009494     7.31   0.000     .0050349    .0088506
   _SstaXfema_12 |  -.0140045   .0031653    -4.42   0.000    -.0203654   -.0076435
   _SstaXfema_13 |  -.0204452   .0037529    -5.45   0.000     -.027987   -.0129033
   _SstaXfema_15 |   .0116201   .0001668    69.67   0.000     .0112849    .0119552
   _SstaXfema_16 |  -.0090187   .0034019    -2.65   0.011    -.0158551   -.0021822
   _SstaXfema_18 |  -.0065204   .0000884   -73.78   0.000     -.006698   -.0063428
   _SstaXfema_19 |   .0230578   .0038892     5.93   0.000     .0152421    .0308735
   _SstaXfema_20 |    .002003   .0000899    22.27   0.000     .0018223    .0021837
   _SstaXfema_21 |  -.0179461     .00008  -224.38   0.000    -.0181068   -.0177854
   _SstaXfema_22 |  -.0338084   .0020246   -16.70   0.000     -.037877   -.0297397
   _SstaXfema_23 |   .0293878   .0004269    68.84   0.000       .02853    .0302457
   _SstaXfema_24 |   .0192888   .0001136   169.75   0.000     .0190604    .0195171
   _SstaXfema_25 |   .0294252   .0000848   346.96   0.000     .0292548    .0295956
   _SstaXfema_26 |   .0129517   .0000958   135.14   0.000     .0127591    .0131443
   _SstaXfema_27 |   .0496756   .0001162   427.45   0.000     .0494421    .0499092
   _SstaXfema_28 |  -.0294392   .0031662    -9.30   0.000    -.0358018   -.0230766
   _SstaXfema_29 |   .0217576   .0001048   207.69   0.000     .0215471    .0219681
   _SstaXfema_30 |   .0346035   .0000823   420.62   0.000     .0344382    .0347688
   _SstaXfema_31 |   .0188042   .0000832   225.92   0.000      .018637    .0189715
   _SstaXfema_32 |  -.0269518   .0007686   -35.07   0.000    -.0284963   -.0254073
   _SstaXfema_33 |   .0125846   .0001852    67.95   0.000     .0122124    .0129568
   _SstaXfema_34 |  -.0214116   .0000935  -229.01   0.000    -.0215995   -.0212237
   _SstaXfema_35 |  -.0106913   .0001972   -54.21   0.000    -.0110876    -.010295
   _SstaXfema_36 |  -.0150045   .0001025  -146.35   0.000    -.0152105   -.0147985
   _SstaXfema_37 |  -.0097737   .0002685   -36.40   0.000    -.0103134   -.0092341
   _SstaXfema_38 |   .0413223   .0001324   312.06   0.000     .0410562    .0415884
   _SstaXfema_39 |  -.0027904   .0025877    -1.08   0.286    -.0079905    .0024098
   _SstaXfema_40 |  -.0252032   .0001067  -236.12   0.000    -.0254177   -.0249887
   _SstaXfema_41 |   .0038655   .0002051    18.84   0.000     .0034533    .0042778
   _SstaXfema_42 |  -.0051432   .0000916   -56.12   0.000    -.0053274   -.0049591
   _SstaXfema_44 |   .0314464   .0003689    85.25   0.000     .0307051    .0321877
   _SstaXfema_45 |  -.0096723   .0066705    -1.45   0.153    -.0230771    .0037325
   _SstaXfema_46 |   .0356542   .0000918   388.33   0.000     .0354697    .0358387
   _SstaXfema_47 |  -.0122478   .0032515    -3.77   0.000     -.018782   -.0057136
   _SstaXfema_48 |  -.0503245   .0002989  -168.37   0.000    -.0509252   -.0497239
   _SstaXfema_49 |  -.0609687   .0030305   -20.12   0.000    -.0670586   -.0548788
   _SstaXfema_50 |   .0408476   .0001841   221.88   0.000     .0404776    .0412175
   _SstaXfema_51 |  -.0133454   .0001944   -68.65   0.000     -.013736   -.0129548
   _SstaXfema_53 |  -.0107118   .0003147   -34.04   0.000    -.0113442   -.0100795
   _SstaXfema_54 |  -.0344614   .0001791  -192.40   0.000    -.0348213   -.0341014
   _SstaXfema_55 |   .0509467   .0001021   499.12   0.000     .0507416    .0511519
   _SstaXfema_56 |  -.0128029   .0004145   -30.89   0.000    -.0136359   -.0119698
    _SstaXyoun_1 |   .0182456   .0089632     2.04   0.047     .0002333     .036258
    _SstaXyoun_2 |   .0300219   .0090152     3.33   0.002     .0119051    .0481386
    _SstaXyoun_4 |   .0738991   .0090785     8.14   0.000     .0556552    .0921431
    _SstaXyoun_5 |   .0391505    .009061     4.32   0.000     .0209417    .0573593
    _SstaXyoun_6 |   .0383173   .0095417     4.02   0.000     .0191426     .057492
    _SstaXyoun_8 |   .0508817   .0094841     5.36   0.000     .0318226    .0699408
    _SstaXyoun_9 |  -.0001224   .0094056    -0.01   0.990    -.0190237    .0187789
   _SstaXyoun_10 |   .0261315   .0090407     2.89   0.006     .0079636    .0442995
   _SstaXyoun_12 |   .0559328   .0091711     6.10   0.000     .0375027    .0743628
   _SstaXyoun_13 |   .0161117   .0090294     1.78   0.081    -.0020336    .0342569
   _SstaXyoun_15 |   .0165459   .0094293     1.75   0.086     -.002403    .0354949
   _SstaXyoun_16 |   .0538848   .0090074     5.98   0.000     .0357837    .0719859
   _SstaXyoun_18 |   .0202646   .0093674     2.16   0.035     .0014402     .039089
   _SstaXyoun_19 |   .0372847   .0088226     4.23   0.000      .019555    .0550145
   _SstaXyoun_20 |   .0417708   .0093858     4.45   0.000     .0229092    .0606323
   _SstaXyoun_21 |   .0486399   .0094473     5.15   0.000     .0296547     .067625
   _SstaXyoun_22 |   .0259048   .0090701     2.86   0.006     .0076778    .0441318
   _SstaXyoun_23 |   .0275591   .0092901     2.97   0.005     .0088899    .0462282
   _SstaXyoun_24 |   .0148523   .0094153     1.58   0.121    -.0040686    .0337731
   _SstaXyoun_25 |   .0210598   .0093177     2.26   0.028     .0023352    .0397843
   _SstaXyoun_26 |   .0479763   .0093923     5.11   0.000     .0291018    .0668508
   _SstaXyoun_27 |   .0587731   .0092612     6.35   0.000     .0401621    .0773842
   _SstaXyoun_28 |  -.0200404   .0090933    -2.20   0.032    -.0383141   -.0017667
   _SstaXyoun_29 |   .0487812    .009379     5.20   0.000     .0299335     .067629
   _SstaXyoun_30 |   .0239696   .0093638     2.56   0.014     .0051523    .0427869
   _SstaXyoun_31 |   .0503766   .0093582     5.38   0.000     .0315706    .0691826
   _SstaXyoun_32 |   .0597809   .0097415     6.14   0.000     .0402047    .0793572
   _SstaXyoun_33 |   .0502011   .0095085     5.28   0.000     .0310931    .0693092
   _SstaXyoun_34 |    .002707   .0094032     0.29   0.775    -.0161894    .0216034
   _SstaXyoun_35 |   .0300608   .0095469     3.15   0.003     .0108757    .0492459
   _SstaXyoun_36 |  -.0287855   .0093953    -3.06   0.004    -.0476661   -.0099049
   _SstaXyoun_37 |   .0224601   .0095144     2.36   0.022     .0033401      .04158
   _SstaXyoun_38 |   .0245656   .0093167     2.64   0.011      .005843    .0432882
   _SstaXyoun_39 |   .0470976   .0089864     5.24   0.000     .0290388    .0651563
   _SstaXyoun_40 |   .0410618   .0093572     4.39   0.000     .0222578    .0598657
   _SstaXyoun_41 |    .039322   .0094602     4.16   0.000      .020311    .0583331
   _SstaXyoun_42 |   .0234995   .0093727     2.51   0.016     .0046644    .0423345
   _SstaXyoun_44 |   .0584773    .009229     6.34   0.000     .0399308    .0770237
   _SstaXyoun_45 |   .0065492   .0089745     0.73   0.469    -.0114857    .0245841
   _SstaXyoun_46 |   .0326716   .0093973     3.48   0.001      .013787    .0515563
   _SstaXyoun_47 |   .0363526   .0090397     4.02   0.000     .0181867    .0545185
   _SstaXyoun_48 |   .0380516   .0095328     3.99   0.000     .0188947    .0572085
   _SstaXyoun_49 |   .0834133   .0091241     9.14   0.000     .0650777    .1017488
   _SstaXyoun_50 |   .0140196    .009255     1.51   0.136     -.004579    .0326181
   _SstaXyoun_51 |   .0104421   .0095303     1.10   0.279    -.0087096    .0295939
   _SstaXyoun_53 |   .0537491   .0095376     5.64   0.000     .0345825    .0729157
   _SstaXyoun_54 |    .008871   .0093409     0.95   0.347    -.0099002    .0276422
   _SstaXyoun_55 |   .0538039   .0093421     5.76   0.000     .0350303    .0725775
   _SstaXyoun_56 |   .0117806   .0091472     1.29   0.204    -.0066015    .0301626
    _SstaXlows_1 |  -.0249987   .0025114    -9.95   0.000    -.0300455    -.019952
    _SstaXlows_2 |  -.0122921   .0013782    -8.92   0.000    -.0150617   -.0095226
    _SstaXlows_4 |   .0063902   .0028999     2.20   0.032     .0005627    .0122177
    _SstaXlows_5 |  -.0028278   .0015561    -1.82   0.075    -.0059548    .0002993
    _SstaXlows_6 |  -.0211082   .0003607   -58.51   0.000    -.0218331   -.0203833
    _SstaXlows_8 |    .032109   .0003221    99.70   0.000     .0314618    .0327562
    _SstaXlows_9 |   .0435979   .0003279   132.97   0.000      .042939    .0442568
   _SstaXlows_10 |   .0363245   .0005707    63.65   0.000     .0351776    .0374713
   _SstaXlows_12 |   .0231573   .0019852    11.66   0.000     .0191679    .0271468
   _SstaXlows_13 |   .0087521   .0023607     3.71   0.001     .0040081    .0134961
   _SstaXlows_15 |   .0114378   .0003152    36.29   0.000     .0108045    .0120712
   _SstaXlows_16 |   .0424749   .0020589    20.63   0.000     .0383374    .0466124
   _SstaXlows_18 |    .014595   .0003276    44.56   0.000     .0139368    .0152533
   _SstaXlows_19 |   .0451952   .0023504    19.23   0.000     .0404719    .0499184
   _SstaXlows_20 |   .0348457   .0002697   129.21   0.000     .0343037    .0353876
   _SstaXlows_21 |  -.0460583   .0003894  -118.27   0.000    -.0468408   -.0452757
   _SstaXlows_22 |  -.0348229   .0012716   -27.39   0.000    -.0373782   -.0322676
   _SstaXlows_23 |   .0015762    .000442     3.57   0.001     .0006879    .0024645
   _SstaXlows_24 |   .0098211   .0003594    27.32   0.000     .0090987    .0105434
   _SstaXlows_25 |   .0126873   .0003097    40.97   0.000     .0120649    .0133096
   _SstaXlows_26 |  -.0191353    .000327   -58.52   0.000    -.0197924   -.0184783
   _SstaXlows_27 |   .0318089   .0003143   101.22   0.000     .0311774    .0324404
   _SstaXlows_28 |  -.0270014     .00197   -13.71   0.000    -.0309603   -.0230426
   _SstaXlows_29 |   .0096254   .0003158    30.48   0.000     .0089907    .0102601
   _SstaXlows_30 |   .0138783   .0002881    48.17   0.000     .0132993    .0144573
   _SstaXlows_31 |   .0436562   .0003082   141.67   0.000     .0430369    .0442754
   _SstaXlows_32 |   .0412623   .0004553    90.64   0.000     .0403475    .0421772
   _SstaXlows_33 |   .0454989    .000276   164.83   0.000     .0449442    .0460536
   _SstaXlows_34 |   .0305791   .0003371    90.71   0.000     .0299016    .0312566
   _SstaXlows_35 |  -.0289594   .0003538   -81.84   0.000    -.0296704   -.0282483
   _SstaXlows_36 |  -.0103352   .0003335   -30.99   0.000    -.0110054    -.009665
   _SstaXlows_37 |   .0197776   .0003629    54.49   0.000     .0190483     .020507
   _SstaXlows_38 |   .0309201   .0002522   122.58   0.000     .0304132     .031427
   _SstaXlows_39 |  -.0104342   .0015982    -6.53   0.000    -.0136459   -.0072225
   _SstaXlows_40 |   .0086681   .0003173    27.32   0.000     .0080304    .0093057
   _SstaXlows_41 |   .0154879   .0002973    52.10   0.000     .0148905    .0160853
   _SstaXlows_42 |   .0130727   .0003252    40.20   0.000     .0124192    .0137262
   _SstaXlows_44 |   .0005054   .0003463     1.46   0.151    -.0001905    .0012012
   _SstaXlows_45 |   .0079793   .0041945     1.90   0.063    -.0004499    .0164084
   _SstaXlows_46 |    .045384   .0002597   174.79   0.000     .0448622    .0459058
   _SstaXlows_47 |  -.0186251   .0020898    -8.91   0.000    -.0228248   -.0144254
   _SstaXlows_48 |    .015091   .0003875    38.94   0.000     .0143122    .0158698
   _SstaXlows_49 |   .0610618   .0018418    33.15   0.000     .0573606    .0647631
   _SstaXlows_50 |   .0256523   .0003625    70.77   0.000     .0249238    .0263807
   _SstaXlows_51 |   .0256698   .0003492    73.52   0.000     .0249681    .0263714
   _SstaXlows_53 |    .015489   .0003103    49.91   0.000     .0148654    .0161126
   _SstaXlows_54 |  -.1093517   .0003464  -315.66   0.000    -.1100479   -.1086556
   _SstaXlows_55 |   .0487992   .0002728   178.88   0.000      .048251    .0493474
   _SstaXlows_56 |   .0242838   .0003922    61.92   0.000     .0234957    .0250718
    _SstaXttre_1 |   .0008721   .0005982     1.46   0.151    -.0003299    .0020742
    _SstaXttre_2 |  -.0006144   .0008067    -0.76   0.450    -.0022356    .0010067
    _SstaXttre_4 |   .0023812   .0006177     3.85   0.000     .0011398    .0036225
    _SstaXttre_5 |   .0017491   .0003676     4.76   0.000     .0010104    .0024878
    _SstaXttre_6 |    .001392   .0005209     2.67   0.010     .0003452    .0024387
    _SstaXttre_8 |  -.0041296   .0004411    -9.36   0.000    -.0050161   -.0032431
    _SstaXttre_9 |   .0022572   .0005499     4.11   0.000     .0011522    .0033622
   _SstaXttre_10 |   .0046978   .0007627     6.16   0.000     .0031651    .0062304
   _SstaXttre_12 |   .0081035   .0007012    11.56   0.000     .0066945    .0095126
   _SstaXttre_13 |   .0039614   .0006039     6.56   0.000     .0027478    .0051749
   _SstaXttre_15 |  -.0022021   .0007224    -3.05   0.004    -.0036539   -.0007503
   _SstaXttre_16 |   .0020799   .0007654     2.72   0.009     .0005417    .0036182
   _SstaXttre_18 |   .0003513   .0005112     0.69   0.495    -.0006761    .0013787
   _SstaXttre_19 |   .0044694   .0007494     5.96   0.000     .0029634    .0059754
   _SstaXttre_20 |  -.0000168   .0003065    -0.05   0.956    -.0006328    .0005991
   _SstaXttre_21 |  -.0053566   .0002333   -22.96   0.000    -.0058254   -.0048877
   _SstaXttre_22 |  -.0014228   .0004679    -3.04   0.004    -.0023631   -.0004826
   _SstaXttre_23 |   .0026158   .0007357     3.56   0.001     .0011374    .0040943
   _SstaXttre_24 |   .0043289   .0002926    14.79   0.000     .0037409    .0049169
   _SstaXttre_25 |    .000519   .0003872     1.34   0.186     -.000259     .001297
   _SstaXttre_26 |  -.0008241   .0004034    -2.04   0.046    -.0016348   -.0000134
   _SstaXttre_27 |   .0011179   .0005071     2.20   0.032      .000099    .0021369
   _SstaXttre_28 |   .0042314   .0008759     4.83   0.000     .0024713    .0059915
   _SstaXttre_29 |  -.0050022   .0003362   -14.88   0.000    -.0056777   -.0043267
   _SstaXttre_30 |   .0046597   .0005918     7.87   0.000     .0034705    .0058489
   _SstaXttre_31 |   .0013919   .0005515     2.52   0.015     .0002836    .0025001
   _SstaXttre_32 |   .0012306   .0004657     2.64   0.011     .0002947    .0021666
   _SstaXttre_33 |  -.0000627   .0007537    -0.08   0.934    -.0015773    .0014519
   _SstaXttre_34 |   .0023951   .0005555     4.31   0.000     .0012787    .0035114
   _SstaXttre_35 |  -.0035663   .0005003    -7.13   0.000    -.0045718   -.0025609
   _SstaXttre_36 |  -.0019594   .0003797    -5.16   0.000    -.0027226   -.0011963
   _SstaXttre_37 |   .0047927   .0005634     8.51   0.000     .0036605    .0059248
   _SstaXttre_38 |    .002124   .0005992     3.54   0.001     .0009198    .0033282
   _SstaXttre_39 |  -.0011877   .0005684    -2.09   0.042      -.00233   -.0000455
   _SstaXttre_40 |  -.0016815   .0005033    -3.34   0.002    -.0026929     -.00067
   _SstaXttre_41 |  -.0009532    .000441    -2.16   0.036    -.0018394   -.0000669
   _SstaXttre_42 |   -.001739    .000422    -4.12   0.000    -.0025869    -.000891
   _SstaXttre_44 |  -.0014276   .0005816    -2.45   0.018    -.0025963   -.0002588
   _SstaXttre_45 |   .0016663   .0011198     1.49   0.143    -.0005841    .0039167
   _SstaXttre_46 |  -.0015725   .0004488    -3.50   0.001    -.0024743   -.0006706
   _SstaXttre_47 |    .002144   .0007778     2.76   0.008     .0005809    .0037071
   _SstaXttre_48 |   .0023465   .0010015     2.34   0.023     .0003339    .0043591
   _SstaXttre_49 |   .0019768   .0006804     2.91   0.005     .0006096    .0033441
   _SstaXttre_50 |  -.0006259   .0005098    -1.23   0.225    -.0016504    .0003986
   _SstaXttre_51 |    .005878   .0003533    16.64   0.000     .0051681    .0065879
   _SstaXttre_53 |  -.0021816   .0005203    -4.19   0.000    -.0032273    -.001136
   _SstaXttre_54 |  -.0007222   .0005655    -1.28   0.208    -.0018587    .0004143
   _SstaXttre_55 |  -.0011735   .0007727    -1.52   0.135    -.0027263    .0003793
   _SstaXttre_56 |  -.0051924   .0007102    -7.31   0.000    -.0066196   -.0037652
    _SstaXttrea1 |  -.0001948   .0000542    -3.59   0.001    -.0003038   -.0000859
    _SstaXttrea2 |   8.52e-06   .0000565     0.15   0.881     -.000105     .000122
    _SstaXttrea4 |  -.0001949   .0000542    -3.60   0.001    -.0003038    -.000086
    _SstaXttrea5 |  -.0000685    .000027    -2.54   0.014    -.0001227   -.0000143
    _SstaXttrea6 |  -.0003984   .0000367   -10.86   0.000    -.0004721   -.0003247
    _SstaXttrea8 |    .000327   .0000351     9.31   0.000     .0002564    .0003976
    _SstaXttrea9 |  -.0003886   .0000598    -6.50   0.000    -.0005087   -.0002685
   _SstaXttrea10 |  -.0003157   .0000622    -5.07   0.000    -.0004408   -.0001907
   _SstaXttrea12 |  -.0007774   .0000537   -14.47   0.000    -.0008854   -.0006694
   _SstaXttrea13 |    -.00054   .0000545    -9.90   0.000    -.0006496   -.0004304
   _SstaXttrea15 |   .0001657   .0000599     2.76   0.008     .0000453    .0002862
   _SstaXttrea16 |   .0000907   .0000649     1.40   0.169    -.0000397    .0002212
   _SstaXttrea18 |   5.62e-06   .0000294     0.19   0.849    -.0000535    .0000648
   _SstaXttrea19 |  -.0000908   .0000657    -1.38   0.173    -.0002228    .0000411
   _SstaXttrea20 |   .0001615   .0000259     6.23   0.000     .0001094    .0002136
   _SstaXttrea21 |   .0003583    .000017    21.09   0.000     .0003241    .0003924
   _SstaXttrea22 |  -2.73e-06    .000053    -0.05   0.959    -.0001093    .0001038
   _SstaXttrea23 |  -.0002187   .0000568    -3.85   0.000    -.0003328   -.0001045
   _SstaXttrea24 |  -.0003325   .0000271   -12.26   0.000     -.000387    -.000278
   _SstaXttrea25 |  -.0001525   .0000312    -4.88   0.000    -.0002153   -.0000898
   _SstaXttrea26 |  -.0000106   .0000145    -0.73   0.466    -.0000397    .0000185
   _SstaXttrea27 |  -.0000317   .0000301    -1.06   0.296    -.0000922    .0000287
   _SstaXttrea28 |  -.0005308   .0000939    -5.65   0.000    -.0007195    -.000342
   _SstaXttrea29 |    .000479   .0000293    16.35   0.000     .0004201    .0005379
   _SstaXttrea30 |  -.0002843   .0000414    -6.87   0.000    -.0003674   -.0002012
   _SstaXttrea31 |   .0001774   .0000412     4.31   0.000     .0000946    .0002602
   _SstaXttrea32 |   -.000292   .0000389    -7.51   0.000    -.0003701   -.0002139
   _SstaXttrea33 |  -.0000607   .0000593    -1.02   0.311    -.0001798    .0000585
   _SstaXttrea34 |  -.0002819   .0000448    -6.29   0.000    -.0003719   -.0001918
   _SstaXttrea35 |   .0003332   .0000403     8.27   0.000     .0002523    .0004141
   _SstaXttrea36 |  -4.26e-07   .0000271    -0.02   0.988    -.0000549    .0000541
   _SstaXttrea37 |  -.0003988   .0000313   -12.74   0.000    -.0004618   -.0003359
   _SstaXttrea38 |   .0001422   .0000392     3.63   0.001     .0000635    .0002209
   _SstaXttrea39 |   .0000973   .0000407     2.39   0.021     .0000155     .000179
   _SstaXttrea40 |  -.0000267   .0000419    -0.64   0.526     -.000111    .0000575
   _SstaXttrea41 |   .0001544   .0000345     4.48   0.000     .0000851    .0002237
   _SstaXttrea42 |   .0001722   .0000312     5.53   0.000     .0001096    .0002348
   _SstaXttrea44 |  -.0000101   .0000453    -0.22   0.825    -.0001011    .0000809
   _SstaXttrea45 |  -.0003167   .0000666    -4.75   0.000    -.0004506   -.0001827
   _SstaXttrea46 |   .0004261    .000031    13.74   0.000     .0003638    .0004884
   _SstaXttrea47 |  -.0002324   .0000604    -3.85   0.000    -.0003536   -.0001111
   _SstaXttrea48 |   -.000216   .0001162    -1.86   0.069    -.0004496    .0000175
   _SstaXttrea49 |   .0002147   .0000494     4.35   0.000     .0001155     .000314
   _SstaXttrea50 |   .0000147   .0000351     0.42   0.677    -.0000559    .0000853
   _SstaXttrea51 |  -.0004789   .0000268   -17.84   0.000    -.0005328   -.0004249
   _SstaXttrea53 |   .0001298   .0000331     3.92   0.000     .0000633    .0001963
   _SstaXttrea54 |  -.0000582   .0000328    -1.78   0.082    -.0001242    7.69e-06
   _SstaXttrea55 |   .0002447   .0000552     4.43   0.000     .0001337    .0003557
   _SstaXttrea56 |   .0005017   .0000501    10.02   0.000     .0004011    .0006023
    _SstaXttreb1 |   4.19e-06   1.24e-06     3.37   0.001     1.69e-06    6.69e-06
    _SstaXttreb2 |   1.01e-06   1.19e-06     0.85   0.401    -1.38e-06    3.39e-06
    _SstaXttreb4 |   2.62e-06   1.19e-06     2.19   0.033     2.21e-07    5.01e-06
    _SstaXttreb5 |   6.77e-08   4.86e-07     0.14   0.890    -9.09e-07    1.04e-06
    _SstaXttreb6 |   .0000115   7.69e-07    14.98   0.000     9.97e-06    .0000131
    _SstaXttreb8 |  -6.09e-06   6.59e-07    -9.25   0.000    -7.41e-06   -4.77e-06
    _SstaXttreb9 |    .000011   1.37e-06     8.03   0.000     8.24e-06    .0000138
   _SstaXttreb10 |   6.10e-06   1.42e-06     4.30   0.000     3.25e-06    8.95e-06
   _SstaXttreb12 |   .0000173   1.01e-06    17.26   0.000     .0000153    .0000194
   _SstaXttreb13 |   .0000134   1.12e-06    11.96   0.000     .0000112    .0000157
   _SstaXttreb15 |  -2.34e-06   1.24e-06    -1.88   0.066    -4.84e-06    1.58e-07
   _SstaXttreb16 |  -3.59e-06   1.19e-06    -3.02   0.004    -5.98e-06   -1.21e-06
   _SstaXttreb18 |  -5.43e-07   6.49e-07    -0.84   0.406    -1.85e-06    7.60e-07
   _SstaXttreb19 |   2.57e-07   1.38e-06     0.19   0.852    -2.51e-06    3.02e-06
   _SstaXttreb20 |  -4.44e-06   6.07e-07    -7.32   0.000    -5.66e-06   -3.23e-06
   _SstaXttreb21 |  -6.70e-06   4.77e-07   -14.05   0.000    -7.66e-06   -5.74e-06
   _SstaXttreb22 |   1.17e-06   1.13e-06     1.04   0.304    -1.09e-06    3.44e-06
   _SstaXttreb23 |   6.02e-06   1.33e-06     4.53   0.000     3.35e-06    8.70e-06
   _SstaXttreb24 |   6.41e-06   5.88e-07    10.90   0.000     5.23e-06    7.59e-06
   _SstaXttreb25 |   3.97e-06   6.87e-07     5.77   0.000     2.59e-06    5.35e-06
   _SstaXttreb26 |   1.54e-06   2.80e-07     5.51   0.000     9.80e-07    2.11e-06
   _SstaXttreb27 |   8.01e-07   6.07e-07     1.32   0.193    -4.19e-07    2.02e-06
   _SstaXttreb28 |   .0000131   1.93e-06     6.78   0.000     9.19e-06    .0000169
   _SstaXttreb29 |  -.0000104   5.56e-07   -18.68   0.000    -.0000115   -9.27e-06
   _SstaXttreb30 |   6.55e-06   7.73e-07     8.48   0.000     5.00e-06    8.10e-06
   _SstaXttreb31 |  -5.52e-06   8.96e-07    -6.15   0.000    -7.32e-06   -3.71e-06
   _SstaXttreb32 |   8.59e-06   8.43e-07    10.19   0.000     6.90e-06    .0000103
   _SstaXttreb33 |   2.59e-06   1.27e-06     2.03   0.048     2.94e-08    5.15e-06
   _SstaXttreb34 |   7.30e-06   9.69e-07     7.53   0.000     5.35e-06    9.25e-06
   _SstaXttreb35 |  -8.94e-06   8.49e-07   -10.52   0.000    -.0000106   -7.23e-06
   _SstaXttreb36 |   2.49e-06   5.53e-07     4.50   0.000     1.38e-06    3.60e-06
   _SstaXttreb37 |   8.69e-06   5.10e-07    17.04   0.000     7.67e-06    9.72e-06
   _SstaXttreb38 |  -3.49e-06   8.77e-07    -3.99   0.000    -5.26e-06   -1.73e-06
   _SstaXttreb39 |  -1.36e-06   7.31e-07    -1.86   0.068    -2.83e-06    1.06e-07
   _SstaXttreb40 |   3.55e-06   8.69e-07     4.09   0.000     1.81e-06    5.30e-06
   _SstaXttreb41 |  -4.02e-06   7.85e-07    -5.12   0.000    -5.60e-06   -2.44e-06
   _SstaXttreb42 |  -2.51e-06   6.68e-07    -3.76   0.000    -3.85e-06   -1.17e-06
   _SstaXttreb44 |   2.27e-06   9.65e-07     2.36   0.023     3.34e-07    4.21e-06
   _SstaXttreb45 |   8.99e-06   1.20e-06     7.49   0.000     6.58e-06    .0000114
   _SstaXttreb46 |    -.00001   6.06e-07   -16.57   0.000    -.0000113   -8.82e-06
   _SstaXttreb47 |   5.60e-06   1.10e-06     5.10   0.000     3.39e-06    7.81e-06
   _SstaXttreb48 |   4.68e-06   2.67e-06     1.75   0.086    -6.88e-07    .0000101
   _SstaXttreb49 |  -8.60e-06   9.22e-07    -9.32   0.000    -.0000104   -6.74e-06
   _SstaXttreb50 |   1.23e-06   7.57e-07     1.62   0.111    -2.92e-07    2.75e-06
   _SstaXttreb51 |   .0000103   5.44e-07    18.95   0.000     9.21e-06    .0000114
   _SstaXttreb53 |  -1.51e-06   6.78e-07    -2.22   0.031    -2.87e-06   -1.45e-07
   _SstaXttreb54 |   2.20e-06   6.39e-07     3.44   0.001     9.16e-07    3.48e-06
   _SstaXttreb55 |  -5.55e-06   9.92e-07    -5.60   0.000    -7.54e-06   -3.56e-06
   _SstaXttreb56 |  -9.45e-06   9.80e-07    -9.64   0.000    -.0000114   -7.48e-06
           _cons |    .259447   .0174209    14.89   0.000     .2244384    .2944555
----------------------------------------------------------------------------------

. estimates store empd ;

. test blackpro=femalepro ;

 ( 1)  blackpro - femalepro = 0

       F(  1,    49) =    0.00
            Prob > F =    0.9854

. test blackpro=lowskillpro ;

 ( 1)  blackpro - lowskillpro = 0

       F(  1,    49) =    0.00
            Prob > F =    0.9978

. quietly reg empdhi $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdhi ;

. test blackpro=femalepro ;

 ( 1)  blackpro - femalepro = 0

       F(  1,    49) =    3.95
            Prob > F =    0.0526

. test blackpro=lowskillpro ;

 ( 1)  blackpro - lowskillpro = 0

       F(  1,    49) =    0.48
            Prob > F =    0.4912

. quietly reg empdlg $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdlg ;

. test blackpro=femalepro ;

 ( 1)  blackpro - femalepro = 0

       F(  1,    49) =    8.30
            Prob > F =    0.0059

. test blackpro=lowskillpro ;

 ( 1)  blackpro - lowskillpro = 0

       F(  1,    49) =    0.98
            Prob > F =    0.3270

. * note group health coverage and pension are conditional on being asked the question ;
. quietly reg ph $controls [pw=wtsupp], cluster(statefip) ;

. estimates store ph ;

. test blackpro=femalepro ;

 ( 1)  blackpro - femalepro = 0

       F(  1,    49) =   11.19
            Prob > F =    0.0016

. test blackpro=lowskillpro ;

 ( 1)  blackpro - lowskillpro = 0

       F(  1,    49) =    2.90
            Prob > F =    0.0950

. quietly reg lrhw $controls [pw=wtsupp] if hwagesamp==1, cluster(statefip) ;

. estimates store lrhw ;

. test blackpro=femalepro ;

 ( 1)  blackpro - femalepro = 0

       F(  1,    49) =    2.59
            Prob > F =    0.1138

. test blackpro=lowskillpro ;

 ( 1)  blackpro - lowskillpro = 0

       F(  1,    49) =    0.03
            Prob > F =    0.8690

. ****** ESTIMATES WITH PRO TESTING DUMMY ONLY ******* ;
. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) se(%7.3f) stats(N) ;

----------------------------------------------------------------
    Variable |  empd     empdhi    empdlg      ph       lrhw    
-------------+--------------------------------------------------
    blackpro |   0.000     0.016     0.020     0.030     0.014  
             |   0.006     0.011     0.010     0.008     0.008  
     hisppro |  -0.007    -0.008    -0.003    -0.001    -0.020  
             |   0.008     0.010     0.023     0.027     0.012  
   femalepro |   0.001    -0.016    -0.014    -0.012    -0.009  
             |   0.008     0.008     0.005     0.007     0.009  
    youngpro |   0.002    -0.010    -0.003     0.009    -0.004  
             |   0.005     0.007     0.006     0.006     0.007  
 lowskillpro |   0.000     0.008     0.010     0.013     0.013  
             |   0.005     0.006     0.006     0.005     0.005  
         pro |   0.009    -0.005     0.006     0.001     0.026  
             |   0.007     0.009     0.008     0.010     0.009  
       black |  -0.156     0.046     0.117     0.005    -0.108  
             |   0.005     0.009     0.052     0.007     0.008  
        hisp |  -0.066     0.120    -0.160     0.014    -0.082  
             |   0.006     0.005     0.041     0.010     0.014  
      female |  -0.225    -0.183    -0.017    -0.143    -0.393  
             |   0.006     0.005     0.019     0.004     0.005  
    lowskill |  -0.087     0.137    -0.113    -0.056    -0.183  
             |   0.003     0.004     0.027     0.003     0.005  
         age |   0.040     0.021    -0.004     0.039     0.069  
             |   0.001     0.001     0.001     0.001     0.001  
        age2 |  -0.001    -0.000     0.000    -0.000    -0.001  
             |   0.000     0.000     0.000     0.000     0.000  
     minwage |   0.004     0.008     0.004     0.004    -0.007  
             |   0.001     0.002     0.002     0.002     0.005  
unemployme~e |  -0.012    -0.002    -0.002    -0.004    -0.003  
             |   0.001     0.001     0.001     0.001     0.001  
     incarcr |  -0.906     1.442     1.920    -0.922    -8.119  
             |   1.096     0.968     2.383     1.109     4.365  
       eg200 |   0.005    -0.006    -0.029    -0.014    -0.053  
             |   0.003     0.005     0.008     0.007     0.010  
       eg300 |  -0.045    -0.017    -0.014     0.010     0.019  
             |   0.008     0.011     0.024     0.020     0.034  
       eg400 |  -0.056     0.041    -0.020    -0.129    -0.246  
             |   0.015     0.024     0.033     0.023     0.056  
       eg500 |  -0.018    -0.036    -0.033    -0.035    -0.024  
             |   0.009     0.014     0.014     0.011     0.025  
       eg900 |   0.095    -0.008     0.211    -0.008     0.309  
             |   0.046     0.052     0.075     0.045     0.101  
-------------+--------------------------------------------------
           N | 2723128   2046460   1703280   2256956   1994803  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |    empd        empdhi       empdlg         ph          lrhw     
-------------+-----------------------------------------------------------------
    blackpro |   0.000        0.016        0.020*       0.030***     0.014     
     hisppro |  -0.007       -0.008       -0.003       -0.001       -0.020     
   femalepro |   0.001       -0.016       -0.014**     -0.012       -0.009     
    youngpro |   0.002       -0.010       -0.003        0.009       -0.004     
 lowskillpro |   0.000        0.008        0.010        0.013*       0.013*    
         pro |   0.009       -0.005        0.006        0.001        0.026**   
       black |  -0.156***     0.046***     0.117*       0.005       -0.108***  
        hisp |  -0.066***     0.120***    -0.160***     0.014       -0.082***  
      female |  -0.225***    -0.183***    -0.017       -0.143***    -0.393***  
    lowskill |  -0.087***     0.137***    -0.113***    -0.056***    -0.183***  
         age |   0.040***     0.021***    -0.004***     0.039***     0.069***  
        age2 |  -0.001***    -0.000***     0.000***    -0.000***    -0.001***  
     minwage |   0.004**      0.008***     0.004*       0.004       -0.007     
unemployme~e |  -0.012***    -0.002*      -0.002       -0.004***    -0.003*    
     incarcr |  -0.906        1.442        1.920       -0.922       -8.119     
       eg200 |   0.005       -0.006       -0.029***    -0.014       -0.053***  
       eg300 |  -0.045***    -0.017       -0.014        0.010        0.019     
       eg400 |  -0.056***     0.041       -0.020       -0.129***    -0.246***  
       eg500 |  -0.018       -0.036*      -0.033*      -0.035**     -0.024     
       eg900 |   0.095*      -0.008        0.211**     -0.008        0.309**   
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. macro drop all ;

. estimates clear ;

. global controls blackpro hisppro femalepro youngpro lowskillpro
>   blackanti hispanti femaleanti younganti lowskillanti pro anti
>   black hisp female lowskill age age2
>   eg* minwage unemploymentrate incarcr
>   tt* _S* ;

.   global outvars blackpro hisppro femalepro youngpro lowskillpro
>   blackanti hispanti femaleanti younganti lowskillanti pro anti
>   black hisp female lowskill age age2 ;

. summ $outvars year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    blackpro |  2,760,713    .0170246    .1293629          0          1
     hisppro |  2,760,713    .0123008    .1102248          0          1
   femalepro |  2,760,713    .0543816    .2267692          0          1
    youngpro |  2,760,713    .0200477    .1401635          0          1
 lowskillpro |  2,760,713    .0487128     .215267          0          1
-------------+---------------------------------------------------------
   blackanti |  2,760,713    .0022827    .0477235          0          1
    hispanti |  2,760,713    .0029536    .0542666          0          1
  femaleanti |  2,760,713     .022458    .1481675          0          1
   younganti |  2,760,713    .0077734    .0878233          0          1
lowskillanti |  2,760,713    .0176081    .1315222          0          1
-------------+---------------------------------------------------------
         pro |  2,760,713    .1041658    .3054756          0          1
        anti |  2,760,713    .0433866    .2037259          0          1
       black |  2,760,713     .097498    .2966347          0          1
        hisp |  2,760,713    .1341588    .3408229          0          1
      female |  2,760,713    .5172175    .4997036          0          1
-------------+---------------------------------------------------------
    lowskill |  2,760,713    .5095405    .4999091          0          1
         age |  2,760,713    35.78253    10.54069         18         55
        age2 |  2,760,713    1391.495    767.7232        324       3025
        year |  2,760,713    1995.826    9.249745       1980       2010

. summ empd empdhi inclughr pensionr lrhw if pro==0 & anti==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |  2,352,916    .7495265    .4332858          0          1
      empdhi |  1,763,573    .2806371    .4493106          0          1
    inclughr |  1,949,484    .5385045    .4985153          0          1
    pensionr |  1,949,482      .52407    .4994204          0          1
        lrhw |  1,831,661    2.438917    .7797621  -8.419633   11.12423

.   reg empd $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 4,323,425,360)

Linear regression                               Number of obs     =  2,723,128
                                                F(36, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0871
                                                Root MSE          =     .41414

                                  (Std. Err. adjusted for 50 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
            empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
        blackpro |   .0005962   .0064632     0.09   0.927    -.0123921    .0135844
         hisppro |  -.0073041   .0080366    -0.91   0.368    -.0234543    .0088461
       femalepro |   .0008492   .0079636     0.11   0.916    -.0151542    .0168526
        youngpro |   .0028969   .0048704     0.59   0.555    -.0068906    .0126844
     lowskillpro |  -.0002454    .004809    -0.05   0.960    -.0099094    .0094186
       blackanti |   .0031164   .0181064     0.17   0.864    -.0332698    .0395026
        hispanti |   .0018513   .0148692     0.12   0.901    -.0280295     .031732
      femaleanti |   .0036382   .0105186     0.35   0.731    -.0174997    .0247761
       younganti |   .0112311   .0110473     1.02   0.314    -.0109693    .0334316
    lowskillanti |   -.014453   .0078093    -1.85   0.070    -.0301463    .0012403
             pro |   .0093099    .007079     1.32   0.195     -.004916    .0235357
            anti |   .0146063   .0045478     3.21   0.002     .0054672    .0237454
           black |  -.1555702   .0054407   -28.59   0.000    -.1665036   -.1446368
            hisp |  -.0655137   .0057591   -11.38   0.000     -.077087   -.0539404
          female |  -.2247135   .0064711   -34.73   0.000    -.2377176   -.2117093
        lowskill |  -.0871804   .0029314   -29.74   0.000    -.0930713   -.0812894
             age |     .04018   .0009937    40.44   0.000     .0381832    .0421769
            age2 |  -.0005031   .0000128   -39.33   0.000    -.0005288   -.0004774
           eg200 |   .0053283   .0032869     1.62   0.111     -.001277    .0119336
           eg300 |  -.0455708   .0084607    -5.39   0.000    -.0625731   -.0285684
           eg400 |  -.0558295   .0151722    -3.68   0.001    -.0863191   -.0253398
           eg500 |   -.017558   .0093357    -1.88   0.066    -.0363187    .0012027
           eg900 |   .0964451   .0460974     2.09   0.042     .0038088    .1890814
         minwage |   .0037736   .0011915     3.17   0.003     .0013792    .0061681
unemploymentrate |  -.0117561   .0005442   -21.60   0.000    -.0128498   -.0106624
         incarcr |  -.9073656   1.095189    -0.83   0.411    -3.108231      1.2935
          ttrend |   .0005222   .0008175     0.64   0.526    -.0011206     .002165
         ttrend2 |  -.0002259   .0000478    -4.73   0.000    -.0003219   -.0001298
         ttrend3 |   4.55e-06   1.14e-06     3.97   0.000     2.25e-06    6.85e-06
        ttrendbl |  -.0074039   .0021137    -3.50   0.001    -.0116516   -.0031563
       ttrend2bl |   .0006685    .000175     3.82   0.000     .0003168    .0010201
       ttrend3bl |  -.0000138   3.71e-06    -3.73   0.001    -.0000213   -6.37e-06
        ttrendhi |  -.0051204   .0009402    -5.45   0.000    -.0070099   -.0032309
       ttrend2hi |   .0005995   .0000872     6.88   0.000     .0004243    .0007747
       ttrend3hi |  -.0000123   1.85e-06    -6.68   0.000    -.0000161   -8.63e-06
        ttrendfe |   .0142247   .0012613    11.28   0.000     .0116902    .0167593
       ttrend2fe |  -.0006308    .000086    -7.33   0.000    -.0008036   -.0004579
       ttrend3fe |   .0000102   1.77e-06     5.77   0.000     6.67e-06    .0000138
        ttrendyo |  -.0008092    .001984    -0.41   0.685    -.0047962    .0031778
       ttrend2yo |   .0000422   .0001348     0.31   0.756    -.0002288    .0003131
       ttrend3yo |  -2.99e-06   2.71e-06    -1.10   0.276    -8.43e-06    2.46e-06
        ttrendlo |  -.0061414   .0006564    -9.36   0.000    -.0074606   -.0048222
       ttrend2lo |   .0004978   .0000499     9.98   0.000     .0003976     .000598
       ttrend3lo |  -.0000118   1.20e-06    -9.81   0.000    -.0000142   -9.39e-06
    _Sstatefip_1 |   .0131486   .0054299     2.42   0.019     .0022368    .0240604
    _Sstatefip_2 |  -.0474372   .0052475    -9.04   0.000    -.0579823    -.036892
    _Sstatefip_4 |  -.0054349   .0057234    -0.95   0.347    -.0169366    .0060668
    _Sstatefip_5 |  -.0182725   .0037632    -4.86   0.000    -.0258349     -.01071
    _Sstatefip_6 |   .0081507   .0028738     2.84   0.007     .0023756    .0139258
    _Sstatefip_8 |  -.0122396    .002915    -4.20   0.000    -.0180975   -.0063818
    _Sstatefip_9 |  -.0308074   .0036059    -8.54   0.000    -.0380537   -.0235611
   _Sstatefip_10 |   -.046876   .0046903    -9.99   0.000    -.0563014   -.0374505
   _Sstatefip_12 |  -.0272045   .0055006    -4.95   0.000    -.0382584   -.0161506
   _Sstatefip_13 |   .0031998   .0055152     0.58   0.564    -.0078834    .0142831
   _Sstatefip_15 |  -.0400586   .0033347   -12.01   0.000    -.0467599   -.0333573
   _Sstatefip_16 |    -.07987    .003941   -20.27   0.000    -.0877897   -.0719503
   _Sstatefip_18 |   -.015581     .00339    -4.60   0.000    -.0223935   -.0087684
   _Sstatefip_19 |  -.0705492   .0045378   -15.55   0.000    -.0796682   -.0614302
   _Sstatefip_20 |  -.0391493    .003308   -11.83   0.000     -.045797   -.0325015
   _Sstatefip_21 |   .0009731     .00285     0.34   0.734    -.0047541    .0067003
   _Sstatefip_22 |    .018962   .0050206     3.78   0.000     .0088727    .0290514
   _Sstatefip_23 |  -.0695342   .0033792   -20.58   0.000    -.0763251   -.0627434
   _Sstatefip_24 |  -.0224265   .0033982    -6.60   0.000    -.0292554   -.0155976
   _Sstatefip_25 |  -.0386835    .003651   -10.60   0.000    -.0460205   -.0313465
   _Sstatefip_26 |  -.0101784   .0039328    -2.59   0.013    -.0180816   -.0022751
   _Sstatefip_27 |  -.0478938   .0044968   -10.65   0.000    -.0569304   -.0388573
   _Sstatefip_28 |   .0283104   .0047275     5.99   0.000     .0188101    .0378107
   _Sstatefip_29 |  -.0208162   .0029899    -6.96   0.000    -.0268247   -.0148076
   _Sstatefip_30 |  -.0867905   .0030828   -28.15   0.000    -.0929855   -.0805954
   _Sstatefip_31 |  -.0624824   .0032098   -19.47   0.000    -.0689326   -.0560321
   _Sstatefip_32 |   .0053347   .0045781     1.17   0.250    -.0038654    .0145348
   _Sstatefip_33 |   -.038998   .0038444   -10.14   0.000    -.0467237   -.0312724
   _Sstatefip_34 |  -.0260681   .0029094    -8.96   0.000    -.0319148   -.0202215
   _Sstatefip_35 |  -.0220831   .0031145    -7.09   0.000    -.0283419   -.0158243
   _Sstatefip_36 |  -.0133448   .0027603    -4.83   0.000    -.0188917   -.0077978
   _Sstatefip_37 |  -.0192664   .0049229    -3.91   0.000    -.0291595   -.0093734
   _Sstatefip_38 |  -.0934757   .0036614   -25.53   0.000    -.1008337   -.0861178
   _Sstatefip_39 |  -.0169391   .0037926    -4.47   0.000    -.0245605   -.0093177
   _Sstatefip_40 |  -.0209369   .0038458    -5.44   0.000    -.0286652   -.0132086
   _Sstatefip_41 |  -.0478867   .0030172   -15.87   0.000    -.0539501   -.0418234
   _Sstatefip_42 |  -.0383518   .0029632   -12.94   0.000    -.0443065   -.0323971
   _Sstatefip_44 |  -.0251913    .003291    -7.65   0.000    -.0318049   -.0185777
   _Sstatefip_45 |   .0027356   .0078636     0.35   0.729    -.0130669    .0185381
   _Sstatefip_46 |  -.0736755    .003668   -20.09   0.000    -.0810466   -.0663044
   _Sstatefip_47 |  -.0231654   .0042019    -5.51   0.000    -.0316095   -.0147213
   _Sstatefip_48 |   .0076995   .0044843     1.72   0.092    -.0013121     .016711
   _Sstatefip_49 |  -.0751029   .0044959   -16.70   0.000    -.0841378    -.066068
   _Sstatefip_50 |  -.0574069    .003349   -17.14   0.000    -.0641369   -.0506769
   _Sstatefip_51 |  -.0333912    .003255   -10.26   0.000    -.0399324     -.02685
   _Sstatefip_53 |  -.0384893   .0034902   -11.03   0.000    -.0455031   -.0314755
   _Sstatefip_54 |   .0054523    .003249     1.68   0.100    -.0010767    .0119814
   _Sstatefip_55 |  -.0571067   .0031059   -18.39   0.000    -.0633482   -.0508652
   _Sstatefip_56 |  -.0269512   .0036272    -7.43   0.000    -.0342404   -.0196621
    _SstaXblac_1 |   .0675254   .0035967    18.77   0.000     .0602976    .0747533
    _SstaXblac_2 |   .1836211   .0021872    83.95   0.000     .1792257    .1880165
    _SstaXblac_4 |   .1049779   .0042059    24.96   0.000     .0965258      .11343
    _SstaXblac_5 |   .0421042   .0022506    18.71   0.000     .0375815    .0466269
    _SstaXblac_6 |   .0824543   .0003835   214.99   0.000     .0816836     .083225
    _SstaXblac_8 |    .072853   .0004022   181.14   0.000     .0720448    .0736613
    _SstaXblac_9 |   .1007059   .0101441     9.93   0.000     .0803205    .1210913
   _SstaXblac_10 |   .1067749   .0013847    77.11   0.000     .1039923    .1095574
   _SstaXblac_12 |   .0972951   .0027895    34.88   0.000     .0916893    .1029008
   _SstaXblac_13 |   .0987563   .0032656    30.24   0.000     .0921938    .1053188
   _SstaXblac_15 |   .1197908   .0007023   170.57   0.000     .1183795    .1212022
   _SstaXblac_16 |   .0208741   .0034888     5.98   0.000     .0138631    .0278852
   _SstaXblac_18 |   .0372093   .0004781    77.83   0.000     .0362485    .0381701
   _SstaXblac_19 |  -.0226439   .0037198    -6.09   0.000    -.0301191   -.0151686
   _SstaXblac_20 |   .0397873   .0003972   100.18   0.000     .0389892    .0405854
   _SstaXblac_21 |   .0847146   .0003203   264.52   0.000      .084071    .0853582
   _SstaXblac_22 |   .0575214    .001998    28.79   0.000     .0535062    .0615365
   _SstaXblac_23 |   .1626647   .0078331    20.77   0.000     .1469235    .1784059
   _SstaXblac_24 |   .1146681   .0003272   350.42   0.000     .1140105    .1153257
   _SstaXblac_25 |   .0580572   .0005105   113.72   0.000     .0570312    .0590832
   _SstaXblac_26 |   .0052052   .0003743    13.90   0.000     .0044529    .0059575
   _SstaXblac_27 |   .0038724   .0134781     0.29   0.775    -.0232128    .0309576
   _SstaXblac_28 |   .0723774   .0028781    25.15   0.000     .0665936    .0781611
   _SstaXblac_29 |   .0594894   .0003336   178.30   0.000     .0588189    .0601598
   _SstaXblac_30 |   .1086421    .005875    18.49   0.000     .0968358    .1204483
   _SstaXblac_31 |   .0110574   .0003142    35.19   0.000      .010426    .0116888
   _SstaXblac_32 |   .0877708     .00056   156.72   0.000     .0866454    .0888963
   _SstaXblac_33 |   .0579641   .0011369    50.98   0.000     .0556793    .0602488
   _SstaXblac_34 |   .0899996   .0003276   274.73   0.000     .0893413    .0906579
   _SstaXblac_35 |   .0925217   .0004143   223.30   0.000      .091689    .0933543
   _SstaXblac_36 |    .056611   .0003099   182.66   0.000     .0559882    .0572338
   _SstaXblac_37 |   .0939416   .0003012   311.90   0.000     .0933363    .0945469
   _SstaXblac_38 |   .1307571   .0007061   185.18   0.000     .1293382    .1321761
   _SstaXblac_39 |   .0438649    .002484    17.66   0.000     .0388732    .0488566
   _SstaXblac_40 |   .0545124   .0074585     7.31   0.000      .039524    .0695008
   _SstaXblac_41 |   .0312905   .0003085   101.44   0.000     .0306706    .0319103
   _SstaXblac_42 |   .0207893   .0003868    53.75   0.000     .0200121    .0215665
   _SstaXblac_44 |   .0677822   .0062408    10.86   0.000     .0552409    .0803235
   _SstaXblac_45 |   .0760579    .005757    13.21   0.000     .0644887    .0876271
   _SstaXblac_46 |   .1402796   .0012276   114.27   0.000     .1378125    .1427466
   _SstaXblac_47 |   .1082684   .0029329    36.91   0.000     .1023745    .1141623
   _SstaXblac_48 |   .0946708    .000315   300.54   0.000     .0940378    .0953038
   _SstaXblac_49 |   .1295564   .0031186    41.54   0.000     .1232892    .1358235
   _SstaXblac_50 |   .0516349   .0111614     4.63   0.000     .0292052    .0740646
   _SstaXblac_51 |   .1238052   .0003387   365.52   0.000     .1231245    .1244858
   _SstaXblac_53 |   .0867737   .0003809   227.83   0.000     .0860083    .0875391
   _SstaXblac_54 |   .1184642   .0006019   196.83   0.000     .1172547    .1196736
   _SstaXblac_55 |  -.0373334   .0003239  -115.27   0.000    -.0379842   -.0366825
   _SstaXblac_56 |   .0945025   .0004486   210.67   0.000      .093601    .0954039
    _SstaXhisp_1 |   .0930691   .0049393    18.84   0.000     .0831433    .1029949
    _SstaXhisp_2 |   .0716324   .0034598    20.70   0.000     .0646797    .0785852
    _SstaXhisp_4 |  -.0069807   .0052619    -1.33   0.191     -.017555    .0035935
    _SstaXhisp_5 |   .0782026   .0036363    21.51   0.000     .0708953    .0855099
    _SstaXhisp_6 |   .0264901   .0004795    55.24   0.000     .0255264    .0274537
    _SstaXhisp_8 |  -.0231195   .0006833   -33.84   0.000    -.0244927   -.0217464
    _SstaXhisp_9 |  -.0826895   .0100256    -8.25   0.000    -.1028366   -.0625424
   _SstaXhisp_10 |  -.0432228   .0012089   -35.75   0.000    -.0456521   -.0407934
   _SstaXhisp_12 |   .0155506   .0037971     4.10   0.000     .0079201    .0231812
   _SstaXhisp_13 |   .0383894   .0046429     8.27   0.000     .0290592    .0477197
   _SstaXhisp_15 |  -.0078286   .0010251    -7.64   0.000    -.0098887   -.0057685
   _SstaXhisp_16 |   .0060585   .0041551     1.46   0.151    -.0022914    .0144084
   _SstaXhisp_18 |  -.0239237   .0009977   -23.98   0.000    -.0259286   -.0219189
   _SstaXhisp_19 |  -.0468463   .0052701    -8.89   0.000    -.0574371   -.0362556
   _SstaXhisp_20 |  -.0032944   .0008106    -4.06   0.000    -.0049233   -.0016655
   _SstaXhisp_21 |    .041042   .0015729    26.09   0.000     .0378812    .0442028
   _SstaXhisp_22 |   .0154689   .0030629     5.05   0.000     .0093138    .0216241
   _SstaXhisp_23 |  -.0305999   .0069783    -4.39   0.000    -.0446233   -.0165765
   _SstaXhisp_24 |   .0574157   .0016864    34.05   0.000     .0540268    .0608046
   _SstaXhisp_25 |  -.0955801   .0006963  -137.27   0.000    -.0969794   -.0941808
   _SstaXhisp_26 |  -.0349581   .0006266   -55.79   0.000    -.0362174   -.0336989
   _SstaXhisp_27 |  -.0332304   .0125187    -2.65   0.011    -.0583877   -.0080732
   _SstaXhisp_28 |   .0776466   .0044223    17.56   0.000     .0687596    .0865336
   _SstaXhisp_29 |   .0124994   .0011673    10.71   0.000     .0101536    .0148451
   _SstaXhisp_30 |  -.0153106   .0044068    -3.47   0.001    -.0241663   -.0064549
   _SstaXhisp_31 |   -.044146   .0012414   -35.56   0.000    -.0466406   -.0416513
   _SstaXhisp_32 |   .0199742   .0015201    13.14   0.000     .0169195     .023029
   _SstaXhisp_33 |   .0386245   .0014107    27.38   0.000     .0357895    .0414595
   _SstaXhisp_34 |   -.004059   .0005088    -7.98   0.000    -.0050816   -.0030365
   _SstaXhisp_35 |   .0247734   .0006307    39.28   0.000      .023506    .0260408
   _SstaXhisp_36 |  -.0543957   .0006512   -83.53   0.000    -.0557044    -.053087
   _SstaXhisp_37 |   .0192769   .0024787     7.78   0.000     .0142958    .0242579
   _SstaXhisp_38 |  -.0205232   .0009261   -22.16   0.000    -.0223843   -.0186621
   _SstaXhisp_39 |  -.0246461   .0038629    -6.38   0.000     -.032409   -.0168833
   _SstaXhisp_40 |   .0363459   .0085116     4.27   0.000     .0192412    .0534505
   _SstaXhisp_41 |   .0264972   .0012152    21.80   0.000     .0240551    .0289392
   _SstaXhisp_42 |    -.07754    .001137   -68.20   0.000    -.0798249   -.0752552
   _SstaXhisp_44 |  -.0580627   .0066207    -8.77   0.000    -.0713676   -.0447579
   _SstaXhisp_45 |   .0114321   .0061198     1.87   0.068    -.0008662    .0237304
   _SstaXhisp_46 |  -.0223986   .0016116   -13.90   0.000    -.0256372     -.01916
   _SstaXhisp_47 |   .0380536   .0046626     8.16   0.000     .0286838    .0474234
   _SstaXhisp_48 |  -.0085709   .0004919   -17.43   0.000    -.0095593   -.0075825
   _SstaXhisp_49 |  -.0089267   .0037006    -2.41   0.020    -.0163633   -.0014901
   _SstaXhisp_50 |   .0501595   .0069467     7.22   0.000     .0361996    .0641194
   _SstaXhisp_51 |   .0367003   .0015075    24.34   0.000     .0336708    .0397298
   _SstaXhisp_53 |   .0100419   .0015497     6.48   0.000     .0069277    .0131561
   _SstaXhisp_54 |   .0108819   .0011224     9.69   0.000     .0086263    .0131375
   _SstaXhisp_55 |    -.05331   .0016305   -32.70   0.000    -.0565865   -.0500335
   _SstaXhisp_56 |   .0025157   .0008746     2.88   0.006     .0007582    .0042732
    _SstaXfema_1 |  -.0293003   .0040134    -7.30   0.000    -.0373654   -.0212351
    _SstaXfema_2 |   .0206981   .0023964     8.64   0.000     .0158824    .0255137
    _SstaXfema_4 |  -.0550121   .0047578   -11.56   0.000    -.0645733   -.0454509
    _SstaXfema_5 |  -.0120059   .0024839    -4.83   0.000    -.0169975   -.0070144
    _SstaXfema_6 |   -.038169   .0002512  -151.96   0.000    -.0386738   -.0376642
    _SstaXfema_8 |  -.0135661   .0003665   -37.01   0.000    -.0143027   -.0128295
    _SstaXfema_9 |   .0151969   .0053641     2.83   0.007     .0044174    .0259765
   _SstaXfema_10 |   .0068929   .0009998     6.89   0.000     .0048837     .008902
   _SstaXfema_12 |  -.0140843   .0031997    -4.40   0.000    -.0205142   -.0076544
   _SstaXfema_13 |  -.0205385   .0037949    -5.41   0.000    -.0281647   -.0129123
   _SstaXfema_15 |   .0116249     .00017    68.39   0.000     .0112833    .0119665
   _SstaXfema_16 |  -.0091078    .003443    -2.65   0.011    -.0160268   -.0021888
   _SstaXfema_18 |  -.0065237   .0000893   -73.07   0.000    -.0067032   -.0063443
   _SstaXfema_19 |   .0229502   .0039484     5.81   0.000     .0150156    .0308848
   _SstaXfema_20 |   .0020021   .0000911    21.97   0.000     .0018189    .0021852
   _SstaXfema_21 |  -.0179479   .0000813  -220.67   0.000    -.0181114   -.0177845
   _SstaXfema_22 |  -.0338717   .0020585   -16.45   0.000    -.0380084   -.0297349
   _SstaXfema_23 |   .0282174   .0031006     9.10   0.000     .0219864    .0344484
   _SstaXfema_24 |   .0192924   .0001149   167.92   0.000     .0190615    .0195233
   _SstaXfema_25 |   .0294276   .0000854   344.50   0.000     .0292559    .0295993
   _SstaXfema_26 |   .0129509   .0000965   134.26   0.000      .012757    .0131447
   _SstaXfema_27 |   .0473573    .006362     7.44   0.000     .0345723    .0601424
   _SstaXfema_28 |  -.0295291   .0032116    -9.19   0.000    -.0359832   -.0230751
   _SstaXfema_29 |   .0217584   .0001065   204.40   0.000     .0215445    .0219723
   _SstaXfema_30 |   .0336248   .0022387    15.02   0.000      .029126    .0381235
   _SstaXfema_31 |   .0188063   .0000844   222.81   0.000     .0186367    .0189759
   _SstaXfema_32 |  -.0269214   .0008042   -33.48   0.000    -.0285375   -.0253054
   _SstaXfema_33 |    .012598   .0001885    66.83   0.000     .0122191    .0129768
   _SstaXfema_34 |  -.0214139   .0000945  -226.61   0.000    -.0216038    -.021224
   _SstaXfema_35 |  -.0106829   .0002042   -52.32   0.000    -.0110932   -.0102726
   _SstaXfema_36 |   -.015005   .0001039  -144.44   0.000    -.0152138   -.0147963
   _SstaXfema_37 |  -.0097678   .0002801   -34.87   0.000    -.0103306   -.0092049
   _SstaXfema_38 |   .0413165   .0001353   305.38   0.000     .0410446    .0415883
   _SstaXfema_39 |  -.0028677   .0026272    -1.09   0.280    -.0081473    .0024119
   _SstaXfema_40 |  -.0269723   .0043731    -6.17   0.000    -.0357603   -.0181844
   _SstaXfema_41 |   .0038732    .000214    18.10   0.000     .0034432    .0043032
   _SstaXfema_42 |  -.0051449   .0000935   -55.00   0.000    -.0053328   -.0049569
   _SstaXfema_44 |   .0302529   .0028793    10.51   0.000     .0244667    .0360391
   _SstaXfema_45 |  -.0098324   .0067647    -1.45   0.152    -.0234266    .0037618
   _SstaXfema_46 |   .0356525   .0000925   385.38   0.000     .0354666    .0358384
   _SstaXfema_47 |  -.0123364   .0032946    -3.74   0.000    -.0189572   -.0057157
   _SstaXfema_48 |  -.0503169   .0003107  -161.93   0.000    -.0509413   -.0496924
   _SstaXfema_49 |   -.061039   .0030593   -19.95   0.000    -.0671869    -.054891
   _SstaXfema_50 |   .0395303   .0032625    12.12   0.000     .0329741    .0460864
   _SstaXfema_51 |  -.0133418   .0002004   -66.59   0.000    -.0137444   -.0129391
   _SstaXfema_53 |  -.0107022   .0003264   -32.79   0.000    -.0113582   -.0100463
   _SstaXfema_54 |  -.0344636   .0001843  -187.05   0.000    -.0348339   -.0340933
   _SstaXfema_55 |   .0509474   .0001042   488.83   0.000     .0507379    .0511568
   _SstaXfema_56 |  -.0128155   .0004264   -30.05   0.000    -.0136725   -.0119585
    _SstaXyoun_1 |   .0181301   .0089966     2.02   0.049     .0000508    .0362094
    _SstaXyoun_2 |   .0300017   .0090638     3.31   0.002     .0117873    .0482161
    _SstaXyoun_4 |   .0737704   .0091098     8.10   0.000     .0554636    .0920773
    _SstaXyoun_5 |   .0391338   .0091099     4.30   0.000     .0208268    .0574408
    _SstaXyoun_6 |   .0385026   .0096214     4.00   0.000     .0191676    .0578376
    _SstaXyoun_8 |   .0510645   .0095649     5.34   0.000     .0318431    .0702859
    _SstaXyoun_9 |  -.0049998   .0098474    -0.51   0.614    -.0247889    .0147893
   _SstaXyoun_10 |   .0261478   .0090947     2.88   0.006     .0078713    .0444243
   _SstaXyoun_12 |   .0558924   .0092168     6.06   0.000     .0373706    .0744143
   _SstaXyoun_13 |   .0160333   .0090689     1.77   0.083    -.0021913    .0342578
   _SstaXyoun_15 |   .0167077   .0095066     1.76   0.085    -.0023965    .0358119
   _SstaXyoun_16 |   .0538189   .0090486     5.95   0.000     .0356349    .0720028
   _SstaXyoun_18 |     .02038   .0094397     2.16   0.036     .0014102    .0393498
   _SstaXyoun_19 |   .0371681   .0088551     4.20   0.000     .0193731    .0549632
   _SstaXyoun_20 |   .0419136   .0094614     4.43   0.000     .0229003    .0609269
   _SstaXyoun_21 |   .0487862   .0095224     5.12   0.000     .0296502    .0679222
   _SstaXyoun_22 |   .0259076    .009122     2.84   0.007     .0075763    .0442389
   _SstaXyoun_23 |   .0247853   .0092947     2.67   0.010      .006107    .0434636
   _SstaXyoun_24 |   .0149986   .0094903     1.58   0.120    -.0040728    .0340701
   _SstaXyoun_25 |   .0211961   .0093901     2.26   0.028     .0023261    .0400662
   _SstaXyoun_26 |    .048111   .0094653     5.08   0.000     .0290898    .0671323
   _SstaXyoun_27 |   .0527905   .0102439     5.15   0.000     .0322047    .0733764
   _SstaXyoun_28 |  -.0201062    .009135    -2.20   0.032    -.0384637   -.0017488
   _SstaXyoun_29 |   .0489115    .009453     5.17   0.000     .0299149     .067908
   _SstaXyoun_30 |   .0218351   .0092881     2.35   0.023     .0031701    .0405001
   _SstaXyoun_31 |   .0505216   .0094336     5.36   0.000     .0315641     .069479
   _SstaXyoun_32 |   .0600245   .0098324     6.10   0.000     .0402656    .0797834
   _SstaXyoun_33 |   .0503503   .0095842     5.25   0.000     .0310902    .0696104
   _SstaXyoun_34 |   .0028451   .0094766     0.30   0.765    -.0161988     .021889
   _SstaXyoun_35 |   .0302339   .0096259     3.14   0.003     .0108898    .0495779
   _SstaXyoun_36 |  -.0286462   .0094692    -3.03   0.004    -.0476752   -.0096172
   _SstaXyoun_37 |   .0226226   .0095933     2.36   0.022     .0033441    .0419011
   _SstaXyoun_38 |   .0246842   .0093893     2.63   0.011     .0058157    .0435527
   _SstaXyoun_39 |   .0470612   .0090323     5.21   0.000     .0289102    .0652122
   _SstaXyoun_40 |   .0368188   .0096327     3.82   0.000     .0174611    .0561765
   _SstaXyoun_41 |   .0394887   .0095391     4.14   0.000     .0203191    .0586584
   _SstaXyoun_42 |   .0236337   .0094457     2.50   0.016     .0046518    .0426156
   _SstaXyoun_44 |   .0559685   .0091998     6.08   0.000     .0374809     .074456
   _SstaXyoun_45 |   .0062527   .0089809     0.70   0.490    -.0117951    .0243004
   _SstaXyoun_46 |   .0328086   .0094726     3.46   0.001     .0137727    .0518445
   _SstaXyoun_47 |   .0362882   .0090811     4.00   0.000      .018039    .0545373
   _SstaXyoun_48 |    .038229   .0096128     3.98   0.000     .0189113    .0575468
   _SstaXyoun_49 |    .083393   .0091732     9.09   0.000     .0649587    .1018273
   _SstaXyoun_50 |   .0106686   .0093094     1.15   0.257    -.0080393    .0293764
   _SstaXyoun_51 |   .0106028   .0096082     1.10   0.275    -.0087056    .0299112
   _SstaXyoun_53 |   .0539182   .0096176     5.61   0.000     .0345909    .0732456
   _SstaXyoun_54 |   .0090006   .0094128     0.96   0.344    -.0099151    .0279162
   _SstaXyoun_55 |   .0539422   .0094166     5.73   0.000     .0350189    .0728655
   _SstaXyoun_56 |   .0119041   .0092161     1.29   0.203    -.0066163    .0304244
    _SstaXlows_1 |  -.0246573   .0024996    -9.86   0.000    -.0296803   -.0196342
    _SstaXlows_2 |  -.0120849   .0013682    -8.83   0.000    -.0148344   -.0093355
    _SstaXlows_4 |   .0067465   .0028875     2.34   0.024      .000944    .0125491
    _SstaXlows_5 |  -.0026385   .0015495    -1.70   0.095    -.0057524    .0004753
    _SstaXlows_6 |  -.0211487    .000365   -57.94   0.000    -.0218823   -.0204152
    _SstaXlows_8 |   .0320614   .0003245    98.80   0.000     .0314093    .0327135
    _SstaXlows_9 |   .0506535   .0039602    12.79   0.000     .0426952    .0586118
   _SstaXlows_10 |   .0364727   .0005671    64.31   0.000      .035333    .0376123
   _SstaXlows_12 |   .0233929   .0019764    11.84   0.000     .0194212    .0273647
   _SstaXlows_13 |   .0090387   .0023503     3.85   0.000     .0043156    .0137618
   _SstaXlows_15 |   .0114143   .0003177    35.93   0.000     .0107759    .0120527
   _SstaXlows_16 |   .0427489   .0020486    20.87   0.000     .0386321    .0468656
   _SstaXlows_18 |   .0145593     .00033    44.12   0.000     .0138961    .0152225
   _SstaXlows_19 |   .0455439   .0023379    19.48   0.000     .0408458     .050242
   _SstaXlows_20 |    .034847   .0002713   128.45   0.000     .0343018    .0353922
   _SstaXlows_21 |   -.046103   .0003925  -117.46   0.000    -.0468918   -.0453142
   _SstaXlows_22 |  -.0346455    .001264   -27.41   0.000    -.0371857   -.0321054
   _SstaXlows_23 |    .005533   .0023759     2.33   0.024     .0007585    .0103075
   _SstaXlows_24 |   .0098044   .0003631    27.00   0.000     .0090747    .0105342
   _SstaXlows_25 |   .0126868   .0003127    40.57   0.000     .0120583    .0133153
   _SstaXlows_26 |  -.0191535   .0003297   -58.10   0.000    -.0198159    -.018491
   _SstaXlows_27 |    .040165   .0046352     8.67   0.000     .0308501    .0494799
   _SstaXlows_28 |  -.0267313   .0019602   -13.64   0.000    -.0306705   -.0227922
   _SstaXlows_29 |   .0096017   .0003181    30.18   0.000     .0089624    .0102409
   _SstaXlows_30 |    .016829   .0017026     9.88   0.000     .0134075    .0202504
   _SstaXlows_31 |   .0436513   .0003103   140.67   0.000     .0430277    .0442749
   _SstaXlows_32 |   .0411322   .0004556    90.29   0.000     .0402167    .0420477
   _SstaXlows_33 |    .045472   .0002786   163.20   0.000      .044912    .0460319
   _SstaXlows_34 |   .0305689   .0003405    89.77   0.000     .0298846    .0312532
   _SstaXlows_35 |  -.0290134   .0003568   -81.32   0.000    -.0297304   -.0282964
   _SstaXlows_36 |  -.0103472   .0003361   -30.79   0.000    -.0110226   -.0096718
   _SstaXlows_37 |   .0197246    .000367    53.74   0.000      .018987    .0204622
   _SstaXlows_38 |   .0309474   .0002515   123.03   0.000      .030442    .0314529
   _SstaXlows_39 |  -.0102086   .0015894    -6.42   0.000    -.0134026   -.0070145
   _SstaXlows_40 |   .0145685   .0033458     4.35   0.000     .0078449     .021292
   _SstaXlows_41 |   .0154561   .0002992    51.65   0.000     .0148548    .0160575
   _SstaXlows_42 |   .0130492   .0003277    39.82   0.000     .0123906    .0137078
   _SstaXlows_44 |   .0039966   .0020954     1.91   0.062    -.0002142    .0082074
   _SstaXlows_45 |   .0085484   .0041778     2.05   0.046     .0001527     .016944
   _SstaXlows_46 |   .0453752   .0002611   173.76   0.000     .0448504       .0459
   _SstaXlows_47 |  -.0183612   .0020806    -8.82   0.000    -.0225424   -.0141801
   _SstaXlows_48 |   .0150317   .0003923    38.32   0.000     .0142433      .01582
   _SstaXlows_49 |   .0612771   .0018347    33.40   0.000     .0575901     .064964
   _SstaXlows_50 |    .030128   .0024701    12.20   0.000     .0251641    .0350919
   _SstaXlows_51 |   .0256331   .0003531    72.59   0.000     .0249235    .0263427
   _SstaXlows_53 |   .0154493   .0003121    49.51   0.000     .0148222    .0160764
   _SstaXlows_54 |  -.1093901    .000349  -313.42   0.000    -.1100915   -.1086887
   _SstaXlows_55 |   .0487784   .0002747   177.57   0.000     .0482264    .0493305
   _SstaXlows_56 |    .024321   .0003931    61.88   0.000     .0235311    .0251108
    _SstaXttre_1 |   .0008835   .0005988     1.48   0.146    -.0003198    .0020868
    _SstaXttre_2 |  -.0006034   .0008044    -0.75   0.457      -.00222    .0010132
    _SstaXttre_4 |   .0023811   .0006182     3.85   0.000     .0011387    .0036234
    _SstaXttre_5 |   .0017674   .0003668     4.82   0.000     .0010303    .0025046
    _SstaXttre_6 |   .0013941   .0005248     2.66   0.011     .0003395    .0024487
    _SstaXttre_8 |  -.0041282   .0004402    -9.38   0.000    -.0050128   -.0032437
    _SstaXttre_9 |   .0038761   .0006971     5.56   0.000     .0024752    .0052769
   _SstaXttre_10 |   .0047039   .0007629     6.17   0.000     .0031708     .006237
   _SstaXttre_12 |   .0080994    .000701    11.55   0.000     .0066906    .0095081
   _SstaXttre_13 |   .0039661   .0006036     6.57   0.000     .0027531    .0051791
   _SstaXttre_15 |  -.0021922   .0007227    -3.03   0.004    -.0036445   -.0007399
   _SstaXttre_16 |   .0020831   .0007644     2.72   0.009     .0005469    .0036193
   _SstaXttre_18 |   .0003713   .0005099     0.73   0.470    -.0006533     .001396
   _SstaXttre_19 |   .0044793   .0007483     5.99   0.000     .0029755    .0059831
   _SstaXttre_20 |  -.0000115   .0003047    -0.04   0.970    -.0006237    .0006008
   _SstaXttre_21 |  -.0053452   .0002341   -22.83   0.000    -.0058157   -.0048748
   _SstaXttre_22 |  -.0014142    .000467    -3.03   0.004    -.0023527   -.0004758
   _SstaXttre_23 |   .0029091   .0007362     3.95   0.000     .0014297    .0043884
   _SstaXttre_24 |   .0043317   .0002938    14.74   0.000     .0037413    .0049222
   _SstaXttre_25 |    .000516   .0003866     1.33   0.188    -.0002608    .0012929
   _SstaXttre_26 |  -.0008145   .0004031    -2.02   0.049    -.0016246   -4.39e-06
   _SstaXttre_27 |   .0016539   .0005363     3.08   0.003     .0005762    .0027316
   _SstaXttre_28 |   .0042409   .0008728     4.86   0.000     .0024869    .0059949
   _SstaXttre_29 |  -.0050026   .0003375   -14.82   0.000    -.0056809   -.0043243
   _SstaXttre_30 |   .0042809   .0006203     6.90   0.000     .0030345    .0055274
   _SstaXttre_31 |   .0014057     .00055     2.56   0.014     .0003005     .002511
   _SstaXttre_32 |   .0012367   .0004678     2.64   0.011     .0002967    .0021766
   _SstaXttre_33 |  -.0000516   .0007546    -0.07   0.946    -.0015681    .0014648
   _SstaXttre_34 |   .0024034   .0005558     4.32   0.000     .0012866    .0035202
   _SstaXttre_35 |  -.0035726   .0005063    -7.06   0.000      -.00459   -.0025551
   _SstaXttre_36 |  -.0019541   .0003803    -5.14   0.000    -.0027184   -.0011898
   _SstaXttre_37 |   .0047999   .0005626     8.53   0.000     .0036693    .0059305
   _SstaXttre_38 |   .0021297   .0005972     3.57   0.001     .0009296    .0033297
   _SstaXttre_39 |  -.0011701   .0005696    -2.05   0.045    -.0023147   -.0000256
   _SstaXttre_40 |  -.0002388   .0006573    -0.36   0.718    -.0015597    .0010821
   _SstaXttre_41 |   -.000946   .0004416    -2.14   0.037    -.0018334   -.0000585
   _SstaXttre_42 |  -.0017267   .0004225    -4.09   0.000    -.0025758   -.0008776
   _SstaXttre_44 |  -.0012342   .0005839    -2.11   0.040    -.0024076   -.0000609
   _SstaXttre_45 |   .0016923   .0011209     1.51   0.138    -.0005602    .0039449
   _SstaXttre_46 |  -.0015756   .0004505    -3.50   0.001     -.002481   -.0006702
   _SstaXttre_47 |   .0021527   .0007762     2.77   0.008     .0005929    .0037124
   _SstaXttre_48 |   .0023393   .0010004     2.34   0.023     .0003289    .0043498
   _SstaXttre_49 |   .0019911   .0006791     2.93   0.005     .0006265    .0033558
   _SstaXttre_50 |  -.0001998   .0005265    -0.38   0.706    -.0012578    .0008583
   _SstaXttre_51 |   .0058798   .0003541    16.60   0.000     .0051682    .0065914
   _SstaXttre_53 |  -.0021764   .0005201    -4.18   0.000    -.0032216   -.0011311
   _SstaXttre_54 |  -.0007086   .0005636    -1.26   0.215    -.0018412     .000424
   _SstaXttre_55 |  -.0011596   .0007713    -1.50   0.139    -.0027096    .0003904
   _SstaXttre_56 |  -.0051768   .0007089    -7.30   0.000    -.0066012   -.0037523
    _SstaXttrea1 |  -.0001955   .0000542    -3.60   0.001    -.0003046   -.0000865
    _SstaXttrea2 |   7.76e-06   .0000563     0.14   0.891    -.0001053    .0001208
    _SstaXttrea4 |  -.0001951   .0000542    -3.60   0.001     -.000304   -.0000862
    _SstaXttrea5 |  -.0000702   .0000268    -2.62   0.012    -.0001241   -.0000163
    _SstaXttrea6 |  -.0003983   .0000371   -10.75   0.000    -.0004728   -.0003238
    _SstaXttrea8 |   .0003272   .0000351     9.32   0.000     .0002566    .0003978
    _SstaXttrea9 |  -.0005672   .0000786    -7.21   0.000    -.0007252   -.0004092
   _SstaXttrea10 |  -.0003164   .0000622    -5.09   0.000    -.0004414   -.0001914
   _SstaXttrea12 |   -.000777   .0000537   -14.47   0.000    -.0008849   -.0006691
   _SstaXttrea13 |  -.0005405   .0000545    -9.92   0.000      -.00065    -.000431
   _SstaXttrea15 |   .0001648     .00006     2.75   0.008     .0000443    .0002853
   _SstaXttrea16 |   .0000903   .0000648     1.39   0.170    -.0000399    .0002206
   _SstaXttrea18 |   3.76e-06   .0000295     0.13   0.899    -.0000555     .000063
   _SstaXttrea19 |  -.0000918   .0000656    -1.40   0.168    -.0002236      .00004
   _SstaXttrea20 |    .000161   .0000259     6.22   0.000      .000109    .0002129
   _SstaXttrea21 |   .0003569    .000017    20.95   0.000     .0003227    .0003912
   _SstaXttrea22 |  -3.25e-06   .0000529    -0.06   0.951    -.0001096    .0001031
   _SstaXttrea23 |  -.0002218   .0000562    -3.95   0.000    -.0003347   -.0001089
   _SstaXttrea24 |  -.0003329   .0000273   -12.22   0.000    -.0003877   -.0002782
   _SstaXttrea25 |  -.0001526   .0000312    -4.89   0.000    -.0002153   -.0000899
   _SstaXttrea26 |  -.0000113   .0000145    -0.78   0.441    -.0000404    .0000179
   _SstaXttrea27 |  -.0001455   .0000475    -3.06   0.004    -.0002409     -.00005
   _SstaXttrea28 |  -.0005314   .0000937    -5.67   0.000    -.0007197   -.0003432
   _SstaXttrea29 |   .0004787   .0000293    16.32   0.000     .0004198    .0005377
   _SstaXttrea30 |   -.000223   .0000476    -4.68   0.000    -.0003187   -.0001273
   _SstaXttrea31 |   .0001761   .0000411     4.28   0.000     .0000935    .0002587
   _SstaXttrea32 |  -.0002926    .000039    -7.50   0.000     -.000371   -.0002141
   _SstaXttrea33 |   -.000062   .0000593    -1.05   0.301    -.0001811    .0000571
   _SstaXttrea34 |  -.0002827   .0000448    -6.31   0.000    -.0003727   -.0001927
   _SstaXttrea35 |   .0003335   .0000409     8.16   0.000     .0002513    .0004156
   _SstaXttrea36 |  -1.08e-06   .0000271    -0.04   0.968    -.0000556    .0000534
   _SstaXttrea37 |  -.0003998   .0000312   -12.80   0.000    -.0004625    -.000337
   _SstaXttrea38 |   .0001418   .0000391     3.63   0.001     .0000633    .0002203
   _SstaXttrea39 |   .0000959   .0000408     2.35   0.023     .0000139    .0001779
   _SstaXttrea40 |  -.0001602    .000058    -2.76   0.008    -.0002768   -.0000435
   _SstaXttrea41 |   .0001537   .0000345     4.45   0.000     .0000843    .0002231
   _SstaXttrea42 |   .0001707   .0000312     5.48   0.000     .0001081    .0002333
   _SstaXttrea44 |  -4.26e-06   .0000448    -0.10   0.924    -.0000942    .0000857
   _SstaXttrea45 |  -.0003187   .0000668    -4.77   0.000    -.0004528   -.0001845
   _SstaXttrea46 |   .0004261   .0000312    13.67   0.000     .0003635    .0004888
   _SstaXttrea47 |  -.0002332   .0000602    -3.87   0.000    -.0003542   -.0001122
   _SstaXttrea48 |  -.0002156    .000116    -1.86   0.069    -.0004488    .0000176
   _SstaXttrea49 |   .0002138   .0000493     4.34   0.000     .0001148    .0003129
   _SstaXttrea50 |  -5.44e-06   .0000358    -0.15   0.880    -.0000774    .0000665
   _SstaXttrea51 |  -.0004792   .0000269   -17.83   0.000    -.0005332   -.0004252
   _SstaXttrea53 |   .0001293   .0000331     3.91   0.000     .0000629    .0001958
   _SstaXttrea54 |  -.0000599   .0000327    -1.83   0.073    -.0001257    5.86e-06
   _SstaXttrea55 |   .0002433   .0000551     4.42   0.000     .0001326     .000354
   _SstaXttrea56 |   .0005003   .0000498    10.04   0.000     .0004002    .0006005
    _SstaXttreb1 |   4.20e-06   1.24e-06     3.38   0.001     1.70e-06    6.70e-06
    _SstaXttreb2 |   1.02e-06   1.18e-06     0.86   0.394    -1.36e-06    3.39e-06
    _SstaXttreb4 |   2.62e-06   1.19e-06     2.20   0.033     2.24e-07    5.02e-06
    _SstaXttreb5 |   1.03e-07   4.85e-07     0.21   0.832    -8.72e-07    1.08e-06
    _SstaXttreb6 |   .0000115   7.76e-07    14.85   0.000     9.96e-06    .0000131
    _SstaXttreb8 |  -6.10e-06   6.59e-07    -9.25   0.000    -7.42e-06   -4.77e-06
    _SstaXttreb9 |   .0000148   1.76e-06     8.41   0.000     .0000113    .0000184
   _SstaXttreb10 |   6.11e-06   1.42e-06     4.32   0.000     3.27e-06    8.96e-06
   _SstaXttreb12 |   .0000173   1.00e-06    17.25   0.000     .0000153    .0000193
   _SstaXttreb13 |   .0000134   1.12e-06    11.98   0.000     .0000112    .0000157
   _SstaXttreb15 |  -2.32e-06   1.24e-06    -1.86   0.068    -4.82e-06    1.80e-07
   _SstaXttreb16 |  -3.59e-06   1.19e-06    -3.02   0.004    -5.97e-06   -1.20e-06
   _SstaXttreb18 |  -5.06e-07   6.52e-07    -0.78   0.441    -1.82e-06    8.05e-07
   _SstaXttreb19 |   2.77e-07   1.38e-06     0.20   0.841    -2.49e-06    3.04e-06
   _SstaXttreb20 |  -4.43e-06   6.06e-07    -7.31   0.000    -5.65e-06   -3.21e-06
   _SstaXttreb21 |  -6.67e-06   4.79e-07   -13.92   0.000    -7.64e-06   -5.71e-06
   _SstaXttreb22 |   1.18e-06   1.13e-06     1.05   0.300    -1.08e-06    3.44e-06
   _SstaXttreb23 |   5.02e-06   1.33e-06     3.78   0.000     2.35e-06    7.69e-06
   _SstaXttreb24 |   6.42e-06   5.91e-07    10.87   0.000     5.23e-06    7.61e-06
   _SstaXttreb25 |   3.97e-06   6.87e-07     5.78   0.000     2.59e-06    5.36e-06
   _SstaXttreb26 |   1.55e-06   2.81e-07     5.53   0.000     9.89e-07    2.12e-06
   _SstaXttreb27 |   3.60e-06   1.11e-06     3.24   0.002     1.37e-06    5.84e-06
   _SstaXttreb28 |   .0000131   1.92e-06     6.80   0.000     9.21e-06    .0000169
   _SstaXttreb29 |  -.0000104   5.56e-07   -18.67   0.000    -.0000115   -9.26e-06
   _SstaXttreb30 |   4.31e-06   1.10e-06     3.93   0.000     2.10e-06    6.51e-06
   _SstaXttreb31 |  -5.48e-06   8.95e-07    -6.13   0.000    -7.28e-06   -3.69e-06
   _SstaXttreb32 |   8.60e-06   8.47e-07    10.16   0.000     6.90e-06    .0000103
   _SstaXttreb33 |   2.62e-06   1.27e-06     2.06   0.045     6.51e-08    5.18e-06
   _SstaXttreb34 |   7.32e-06   9.67e-07     7.57   0.000     5.38e-06    9.26e-06
   _SstaXttreb35 |  -8.94e-06   8.60e-07   -10.39   0.000    -.0000107   -7.21e-06
   _SstaXttreb36 |   2.50e-06   5.52e-07     4.54   0.000     1.39e-06    3.61e-06
   _SstaXttreb37 |   8.71e-06   5.09e-07    17.12   0.000     7.69e-06    9.74e-06
   _SstaXttreb38 |  -3.48e-06   8.76e-07    -3.98   0.000    -5.25e-06   -1.72e-06
   _SstaXttreb39 |  -1.34e-06   7.33e-07    -1.83   0.074    -2.81e-06    1.34e-07
   _SstaXttreb40 |   6.02e-06   1.14e-06     5.25   0.000     3.72e-06    8.32e-06
   _SstaXttreb41 |  -4.00e-06   7.87e-07    -5.09   0.000    -5.58e-06   -2.42e-06
   _SstaXttreb42 |  -2.47e-06   6.69e-07    -3.70   0.001    -3.82e-06   -1.13e-06
   _SstaXttreb44 |   1.21e-06   9.84e-07     1.23   0.226    -7.71e-07    3.18e-06
   _SstaXttreb45 |   9.03e-06   1.20e-06     7.50   0.000     6.61e-06    .0000114
   _SstaXttreb46 |    -.00001   6.08e-07   -16.51   0.000    -.0000113   -8.82e-06
   _SstaXttreb47 |   5.62e-06   1.10e-06     5.12   0.000     3.41e-06    7.82e-06
   _SstaXttreb48 |   4.67e-06   2.67e-06     1.75   0.086    -6.86e-07      .00001
   _SstaXttreb49 |  -8.58e-06   9.21e-07    -9.32   0.000    -.0000104   -6.73e-06
   _SstaXttreb50 |   8.97e-07   7.52e-07     1.19   0.239    -6.14e-07    2.41e-06
   _SstaXttreb51 |   .0000103   5.44e-07    18.96   0.000     9.22e-06    .0000114
   _SstaXttreb53 |  -1.50e-06   6.77e-07    -2.21   0.032    -2.86e-06   -1.37e-07
   _SstaXttreb54 |   2.23e-06   6.41e-07     3.49   0.001     9.47e-07    3.52e-06
   _SstaXttreb55 |  -5.52e-06   9.88e-07    -5.59   0.000    -7.51e-06   -3.54e-06
   _SstaXttreb56 |  -9.43e-06   9.74e-07    -9.68   0.000    -.0000114   -7.47e-06
           _cons |   .2595386   .0174472    14.88   0.000     .2244771    .2946001
----------------------------------------------------------------------------------

. estimates store empd ;

. test blackpro=blackanti ;

 ( 1)  blackpro - blackanti = 0

       F(  1,    49) =    0.02
            Prob > F =    0.8889

. test femalepro=femaleanti ;

 ( 1)  femalepro - femaleanti = 0

       F(  1,    49) =    0.06
            Prob > F =    0.8077

. quietly reg empdhi $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdhi ;

. test blackpro=blackanti ;

 ( 1)  blackpro - blackanti = 0

       F(  1,    49) =    6.47
            Prob > F =    0.0142

. test femalepro=femaleanti ;

 ( 1)  femalepro - femaleanti = 0

       F(  1,    49) =    3.86
            Prob > F =    0.0552

. quietly reg empdlg $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdlg ;

. test blackpro=blackanti ;

 ( 1)  blackpro - blackanti = 0

       F(  1,    49) =    7.36
            Prob > F =    0.0092

. test femalepro=femaleanti ;

 ( 1)  femalepro - femaleanti = 0

       F(  1,    49) =    9.89
            Prob > F =    0.0028

. * note group health coverage and pension are conditional on being asked the question ;
. quietly reg ph $controls [pw=wtsupp], cluster(statefip) ;

. estimates store ph ;

. test blackpro=blackanti ;

 ( 1)  blackpro - blackanti = 0

       F(  1,    49) =    5.16
            Prob > F =    0.0275

. test femalepro=femaleanti ;

 ( 1)  femalepro - femaleanti = 0

       F(  1,    49) =    4.08
            Prob > F =    0.0488

. quietly reg lrhw $controls [pw=wtsupp] if hwagesamp==1, cluster(statefip) ;

. estimates store lrhw ;

. test blackpro=blackanti ;

 ( 1)  blackpro - blackanti = 0

       F(  1,    49) =    4.44
            Prob > F =    0.0403

. test femalepro=femaleanti ;

 ( 1)  femalepro - femaleanti = 0

       F(  1,    49) =    4.53
            Prob > F =    0.0384

. ******* ESTIMATES WITH PRO AND ANTI TESTING DUMMIES ******* ;
. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) se(%7.3f) stats(N) ;

----------------------------------------------------------------
    Variable |  empd     empdhi    empdlg      ph       lrhw    
-------------+--------------------------------------------------
    blackpro |   0.001     0.014     0.020     0.029     0.013  
             |   0.006     0.011     0.010     0.008     0.008  
     hisppro |  -0.007    -0.009    -0.004    -0.002    -0.021  
             |   0.008     0.010     0.023     0.027     0.012  
   femalepro |   0.001    -0.015    -0.014    -0.012    -0.009  
             |   0.008     0.008     0.005     0.007     0.009  
    youngpro |   0.003    -0.011    -0.002     0.008    -0.004  
             |   0.005     0.007     0.006     0.006     0.007  
 lowskillpro |  -0.000     0.009     0.010     0.014     0.013  
             |   0.005     0.006     0.006     0.005     0.006  
   blackanti |   0.003    -0.048    -0.015    -0.023    -0.039  
             |   0.018     0.023     0.010     0.022     0.024  
    hispanti |   0.002    -0.037    -0.020    -0.056    -0.043  
             |   0.015     0.031     0.015     0.029     0.048  
  femaleanti |   0.004     0.008     0.012     0.008     0.011  
             |   0.011     0.009     0.007     0.008     0.005  
   younganti |   0.011    -0.011     0.004    -0.014    -0.003  
             |   0.011     0.006     0.017     0.005     0.011  
lowskillanti |  -0.014     0.015     0.005     0.019    -0.001  
             |   0.008     0.012     0.007     0.006     0.011  
         pro |   0.009    -0.005     0.005     0.000     0.026  
             |   0.007     0.009     0.008     0.010     0.009  
        anti |   0.015    -0.000     0.002    -0.017    -0.014  
             |   0.005     0.006     0.013     0.011     0.026  
       black |  -0.156     0.045     0.117     0.005    -0.109  
             |   0.005     0.009     0.052     0.007     0.008  
        hisp |  -0.066     0.120    -0.160     0.013    -0.082  
             |   0.006     0.005     0.041     0.010     0.014  
      female |  -0.225    -0.183    -0.017    -0.143    -0.393  
             |   0.006     0.005     0.018     0.004     0.005  
    lowskill |  -0.087     0.138    -0.113    -0.056    -0.183  
             |   0.003     0.004     0.027     0.003     0.005  
         age |   0.040     0.021    -0.004     0.039     0.069  
             |   0.001     0.001     0.001     0.001     0.001  
        age2 |  -0.001    -0.000     0.000    -0.000    -0.001  
             |   0.000     0.000     0.000     0.000     0.000  
-------------+--------------------------------------------------
           N | 2723128   2046460   1703280   2256956   1994803  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |    empd        empdhi       empdlg         ph          lrhw     
-------------+-----------------------------------------------------------------
    blackpro |   0.001        0.014        0.020*       0.029***     0.013     
     hisppro |  -0.007       -0.009       -0.004       -0.002       -0.021     
   femalepro |   0.001       -0.015       -0.014**     -0.012       -0.009     
    youngpro |   0.003       -0.011       -0.002        0.008       -0.004     
 lowskillpro |  -0.000        0.009        0.010        0.014*       0.013*    
   blackanti |   0.003       -0.048*      -0.015       -0.023       -0.039     
    hispanti |   0.002       -0.037       -0.020       -0.056       -0.043     
  femaleanti |   0.004        0.008        0.012        0.008        0.011*    
   younganti |   0.011       -0.011        0.004       -0.014*      -0.003     
lowskillanti |  -0.014        0.015        0.005        0.019**     -0.001     
         pro |   0.009       -0.005        0.005        0.000        0.026**   
        anti |   0.015**     -0.000        0.002       -0.017       -0.014     
       black |  -0.156***     0.045***     0.117*       0.005       -0.109***  
        hisp |  -0.066***     0.120***    -0.160***     0.013       -0.082***  
      female |  -0.225***    -0.183***    -0.017       -0.143***    -0.393***  
    lowskill |  -0.087***     0.138***    -0.113***    -0.056***    -0.183***  
         age |   0.040***     0.021***    -0.004***     0.039***     0.069***  
        age2 |  -0.001***    -0.000***     0.000***    -0.000***    -0.001***  
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. log close ;
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_4_5\basic.log
  log type:  text
 closed on:   6 Mar 2020, 20:54:00
--------------------------------------------------------------------------------------------------------
