-------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_7\msa_exclusive_3yr.log
  log type:  text
 opened on:   9 Mar 2020, 10:01:04

. /*****
> 
> Uses pro- and anti-drug testing state legislation by year from IDFW documentation
> to generate D-in-D style estimates of drug testing impacts by demographic group.
> 
> Demographic groups defined in mutually exclusive way. Excludes Hispanics from sample.
> 
> Estimates baseline specs with cubics in time plus their interactions with demographics
> instead of year dummies.
> 
> Uses 8 exclusive groups and interacts with MSA level DT variable. Otherwise spec same as
> msa_interactions_state2.do.
> 
> Drops obs after 2000 AND more than 3 yrs after law.
> 
> *****/
> 
> set mem 4g ;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set matsize 800 ;

. set more off ;

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_March_CPS/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_March_CPS

. use Output/marcps.dta ;

. cd ../Tables/Table_7/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_7

. *use "/afs/crc.nd.edu/user/a/awaggone/Private/Private/Drugs_2011/_june2012/marcps.dta" ;
. *use marcps_test.dta ;
. compress ;
  (0 bytes saved)

. *rename metarea msa ;
. drop if msa==. ;
(0 observations deleted)

. drop if msa > 9990 ;
(952,857 observations deleted)

. drop if year > 2000 ;
(804,580 observations deleted)

. * Not using pcarrests now. Not sure why the match is so bad. ;
. summ year msa dti9799 pcarrests ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |  1,003,276    1990.956    5.631144       1980       2000
         msa |  1,003,276    4446.038    2443.463         80       9360
     dti9799 |  1,001,404    1.068788    .0196918   1.018736    1.10597
   pcarrests |    402,354    .0039735     .002319          0   .0159183

. *summ year msa dti9799 ;
. tab1 year if dti9799==. ;

-> tabulation of year if dti9799==. 

Survey year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |        180        9.62        9.62
       1987 |        175        9.35       18.96
       1988 |        182        9.72       28.69
       1989 |        169        9.03       37.71
       1990 |        244       13.03       50.75
       1991 |        236       12.61       63.35
       1992 |        221       11.81       75.16
       1993 |        167        8.92       84.08
       1994 |        162        8.65       92.74
       1995 |        136        7.26      100.00
------------+-----------------------------------
      Total |      1,872      100.00

. drop if dti9799==. ;
(1,872 observations deleted)

. /** Construct variables for estimation **/
> 
> * Pro and anti dummies, by state-year ;
. gen pro=0 ;

. replace pro=1 if (year>=yrpro & yrpro~=0) ;
(28,235 real changes made)

. gen anti=0 ;

. replace anti=1 if (year>=yranti & yranti~=0) ;
(9,188 real changes made)

. /*
> bysort pro: tab1 yrpro yranti ;
> bysort pro: summ year ;
> bysort anti: tab1 yrpro yranti ;
> bysort anti: summ year ;
> bysort year: summ pro anti ;
> */
> 
> * Reduce education groups to 2 ;
. gen lowskill=1 if edgrp4==1 | edgrp4==2 ;
(485,725 missing values generated)

. replace lowskill=0 if edgrp4==3 | edgrp4==4 ;
(485,725 real changes made)

. gen edgrp2=. ;
(1,001,404 missing values generated)

. replace edgrp2=1 if lowskill==1 ;
(515,679 real changes made)

. replace edgrp2=2 if lowskill==0 ;
(485,725 real changes made)

. gen young=(age<=25) ;

. summ young lowskill ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       young |  1,001,404    .2203976     .414515          0          1
    lowskill |  1,001,404     .514956    .4997765          0          1

. gen raceeth=. ;
(1,001,404 missing values generated)

. replace raceeth=1 if black==0 & hisp==0 ;
(736,311 real changes made)

.  *non-Hispanic Whites ;
. replace raceeth=2 if black==1 ;
(109,445 real changes made)

.  * Blacks ;
. drop if raceeth==. ;
(155,648 observations deleted)

. gen age2=age*age ;

. * Normalize drug testing index to be mean 0 SD 1 ;
. egen normed=std(dti9799) ;

. summ dti9799 normed ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     dti9799 |    845,756    1.069784    .0201826   1.018736    1.10597
      normed |    845,756    3.89e-09           1  -2.529302   1.792951

. replace dti9799=normed ;
(845,756 real changes made)

. drop normed ;

. /* Now create 8 mutually exclusive groups on skill-race-gender */
> 
> gen group8=. ;
(845,756 missing values generated)

. replace group8=1 if edgrp2==1 & raceeth==2 & female==0 ;
(29,081 real changes made)

. replace group8=2 if edgrp2==2 & raceeth==2 & female==0 ;
(17,525 real changes made)

. replace group8=3 if edgrp2==1 & raceeth==2 & female==1 ;
(38,334 real changes made)

. replace group8=4 if edgrp2==2 & raceeth==2 & female==1 ;
(24,505 real changes made)

. replace group8=5 if edgrp2==1 & raceeth==1 & female==0 ;
(156,954 real changes made)

. replace group8=6 if edgrp2==2 & raceeth==1 & female==0 ;
(203,566 real changes made)

. replace group8=7 if edgrp2==1 & raceeth==1 & female==1 ;
(178,118 real changes made)

. replace group8=8 if edgrp2==2 & raceeth==1 & female==1 ;
(197,673 real changes made)

. tab1 group8 ;

-> tabulation of group8  

     group8 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     29,081        3.44        3.44
          2 |     17,525        2.07        5.51
          3 |     38,334        4.53       10.04
          4 |     24,505        2.90       12.94
          5 |    156,954       18.56       31.50
          6 |    203,566       24.07       55.57
          7 |    178,118       21.06       76.63
          8 |    197,673       23.37      100.00
------------+-----------------------------------
      Total |    845,756      100.00

. char group8[omit] 6 ;

.  * Omit high skilled white men. ;
. gen prodt=pro*dti9799 ;

. gen antidt=anti*dti9799 ;

. xi, prefix(_P) i.group8*pro i.group8*prodt ;
i.group8          _Pgroup8_1-8        (naturally coded; _Pgroup8_6 omitted)
i.group8*pro      _PgroXpro_#         (coded as above)
i.group8*prodt    _PgroXprodt_#       (coded as above)

. xi, prefix(_A) i.group8*anti i.group8*antidt ;
i.group8          _Agroup8_1-8        (naturally coded; _Agroup8_6 omitted)
i.group8*anti     _AgroXanti_#        (coded as above)
i.group8*antidt   _AgroXantid_#       (coded as above)

. xi, prefix(_D) i.group8*dti9799 ;
i.group8          _Dgroup8_1-8        (naturally coded; _Dgroup8_6 omitted)
i.group8*d~9799   _DgroXdti97_#       (coded as above)

. drop _Agroup8* _Dgroup8* ;

. * Time cubics and their double interactions ;
. gen ttrend=year - 1980 ;

. sum ttrend ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ttrend |    845,756    10.81566    5.612723          0         20

. gen ttrend2=ttrend^2 ;

. gen ttrend3=ttrend^3 ;

. * State dummies and their interactions with demographics plus linear state trends ;
. char statefip[omit] 17 ;

.  * omit IL - set this so not omitting a pro or anti state ;
. xi, prefix(_S) i.statefip*i.group8 i.statefip*ttrend i.statefip*ttrend2 i.statefip*ttrend3 ;
i.statefip        _Sstatefip_1-55     (naturally coded; _Sstatefip_17 omitted)
i.group8          _Sgroup8_1-8        (naturally coded; _Sgroup8_6 omitted)
i.sta~p*i.gro~8   _SstaXgro_#_#       (coded as above)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)
i.stat~p*ttre~2   _SstaXttrea#        (coded as above)
i.stat~p*ttre~3   _SstaXttreb#        (coded as above)

. drop _Sgroup8* ;

. xi, prefix(_T) i.group8*ttrend i.group8*ttrend2 i.group8*ttrend3 ;
i.group8          _Tgroup8_1-8        (naturally coded; _Tgroup8_6 omitted)
i.group8*ttrend   _TgroXttren_#       (coded as above)
i.group8*ttre~2   _TgroXttrena#       (coded as above)
i.group8*ttre~3   _TgroXttrenb#       (coded as above)

. drop _Tgroup8* ;

. /** Outcome variables **/
> 
> gen empdhi=1 if empd==1 & inlist(ind1,1,4,5,3,11)==1 ;
(655,313 missing values generated)

. replace empdhi=0 if empd==1 & inlist(ind1,1,4,5,3,11)~=1 ;
(460,065 real changes made)

. summ empdhi ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      empdhi |    650,508    .2927604    .4550298          0          1

. gen empdmid=1 if firmsizer==2 | firmsizer==3 ;
(712,199 missing values generated)

. replace empdmid=0 if firmsizer==1 | firmsizer==4 ;
(370,226 real changes made)

. gen empdlg=1 if firmsizer==4 ;
(609,286 missing values generated)

. replace empdlg=0 if firmsizer==1 | firmsizer==2 | firmsizer==3 ;
(267,313 real changes made)

. gen ph=. ;
(845,756 missing values generated)

. replace ph=1 if pensionr==1 | inclughr==1 ;
(505,526 real changes made)

. replace ph=0 if pensionr==0 & inclughr==0 ;
(209,328 real changes made)

. replace ph=. if pensionr==. | inclughr==. ;
(0 real changes made)

. summ empdmid empdlg ph ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     empdmid |    503,783    .2651082    .4413912          0          1
      empdlg |    503,783    .4693886    .4990626          0          1
          ph |    714,854    .7071738    .4550597          0          1

. gen lrhw=log(rhwage) ;
(168,646 missing values generated)

. ** Drop observations more than 3 years after DT law ;
. gen yrsdt = . ;
(845,756 missing values generated)

. replace yrsdt = year - yrpro if yrpro~=0 ;
(184,473 real changes made)

. replace yrsdt = year - yranti if yranti~=0 ;
(39,828 real changes made)

. drop if yrsdt > 3 & yrsdt~=. ;
(12,595 observations deleted)

. summ year yrsdt ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |    833,161    1990.736    5.598587       1980       2000
       yrsdt |    211,706     -7.7609     5.54542        -23          3

. /** Estimations **/
> 
> /** Main specification with DTI interactions **/
> 
> gen stateyear = (year*100) + statefip ;

. global controls _P* pro prodt dti9799 age age2
>   eg* minwage unemploymentrate incarcr
>   tt* _D* _S* _T* ;

. unab pvars: _P* ;

.     global outvars `pvars' pro prodt dti9799 ;

.   summ $outvars year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  _Pgroup8_1 |    833,161    .0342359    .1818346          0          1
  _Pgroup8_2 |    833,161    .0206647    .1422592          0          1
  _Pgroup8_3 |    833,161    .0451749    .2076878          0          1
  _Pgroup8_4 |    833,161    .0289308    .1676121          0          1
  _Pgroup8_5 |    833,161     .185844     .388981          0          1
-------------+---------------------------------------------------------
  _Pgroup8_7 |    833,161    .2110204    .4080331          0          1
  _Pgroup8_8 |    833,161    .2335011    .4230586          0          1
 _PgroXpro_1 |    833,161    .0007898    .0280916          0          1
 _PgroXpro_2 |    833,161    .0005581    .0236179          0          1
 _PgroXpro_3 |    833,161    .0009578    .0309335          0          1
-------------+---------------------------------------------------------
 _PgroXpro_4 |    833,161    .0008918    .0298495          0          1
 _PgroXpro_5 |    833,161     .003009     .054772          0          1
 _PgroXpro_7 |    833,161    .0031447     .055989          0          1
 _PgroXpro_8 |    833,161    .0043257    .0656276          0          1
_PgroXprod~1 |    833,161    .0006498     .038701  -1.404464   1.792951
-------------+---------------------------------------------------------
_PgroXprod~2 |    833,161    .0004754    .0318631  -1.775612   1.792951
_PgroXprod~3 |    833,161    .0008392    .0417155  -1.393903   1.792951
_PgroXprod~4 |    833,161    .0008015    .0406808  -1.393903   1.792951
_PgroXprod~5 |    833,161      .00138    .0684119  -1.775612   1.792951
_PgroXprod~7 |    833,161    .0016013    .0698205  -1.775612   1.792951
-------------+---------------------------------------------------------
_PgroXprod~8 |    833,161    .0015828    .0795341  -1.775612   1.792951
         pro |    833,161    .0178489    .1324021          0          1
       prodt |    833,161    .0088512    .1670752  -1.775612   1.792951
     dti9799 |    833,161    -.014382    .9984238  -2.529302   1.792951
        year |    833,161    1990.736    5.598587       1980       2000

. summ empd empdhi inclughr pensionr lrhw if pro==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |    818,290    .7678561    .4222006          0          1
      empdhi |    628,329    .2930503    .4551617          0          1
    inclughr |    691,118    .5855715    .4926235          0          1
    pensionr |    691,118    .5610344    .4962612          0          1
        lrhw |    654,533    2.509715    .7508348  -8.075817   10.49622

. reg empd $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 1,654,202,759)
note: _Sstatefip_45 omitted because of collinearity
note: _SstaXgro_38_1 omitted because of collinearity
note: _SstaXgro_38_4 omitted because of collinearity

Linear regression                               Number of obs     =    831,483
                                                F(46, 46)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0914
                                                Root MSE          =     .40418

                                  (Std. Err. adjusted for 47 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
            empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
      _Pgroup8_1 |  -.2872434   .0346639    -8.29   0.000    -.3570182   -.2174686
      _Pgroup8_2 |  -.1534728   .0186788    -8.22   0.000    -.1910712   -.1158743
      _Pgroup8_3 |  -.4364022   .0428287   -10.19   0.000    -.5226119   -.3501924
      _Pgroup8_4 |   -.213041   .0279802    -7.61   0.000    -.2693622   -.1567199
      _Pgroup8_5 |  -.0348716   .0063663    -5.48   0.000    -.0476863   -.0220569
      _Pgroup8_7 |  -.2855982   .0129376   -22.08   0.000    -.3116402   -.2595562
      _Pgroup8_8 |  -.1776262   .0104327   -17.03   0.000    -.1986261   -.1566263
     _PgroXpro_1 |   .0240567   .0252058     0.95   0.345    -.0266799    .0747933
     _PgroXpro_2 |    .019028   .0115693     1.64   0.107    -.0042597    .0423158
     _PgroXpro_3 |   .0048918   .0134622     0.36   0.718    -.0222062    .0319897
     _PgroXpro_4 |  -.0303897   .0190583    -1.59   0.118    -.0687522    .0079727
     _PgroXpro_5 |   .0110618   .0047768     2.32   0.025     .0014466     .020677
     _PgroXpro_7 |    -.01695   .0110016    -1.54   0.130    -.0390951    .0051951
     _PgroXpro_8 |  -.0190538    .008325    -2.29   0.027    -.0358111   -.0022966
   _PgroXprodt_1 |   .0126153   .0161495     0.78   0.439     -.019892    .0451225
   _PgroXprodt_2 |   .0147711   .0044082     3.35   0.002     .0058978    .0236444
   _PgroXprodt_3 |   .0005803   .0066573     0.09   0.931    -.0128201    .0139807
   _PgroXprodt_4 |   .0009785   .0098065     0.10   0.921    -.0187609    .0207179
   _PgroXprodt_5 |   .0028484     .00397     0.72   0.477    -.0051427    .0108396
   _PgroXprodt_7 |   .0246813   .0103161     2.39   0.021      .003916    .0454466
   _PgroXprodt_8 |   .0124387   .0067102     1.85   0.070    -.0010682    .0259455
             pro |   .0073601   .0036336     2.03   0.049      .000046    .0146743
           prodt |  -.0170907   .0031427    -5.44   0.000    -.0234167   -.0107648
         dti9799 |   .0039094   .0028324     1.38   0.174    -.0017919    .0096106
             age |   .0373858   .0012193    30.66   0.000     .0349314    .0398402
            age2 |  -.0004692   .0000142   -33.10   0.000    -.0004977   -.0004407
           eg200 |  -.0019949   .0075788    -0.26   0.794    -.0172502    .0132604
           eg300 |   -.031042   .0199062    -1.56   0.126    -.0711111    .0090272
           eg400 |  -.1401676   .0312092    -4.49   0.000    -.2029884   -.0773467
           eg500 |  -.0231782   .0244339    -0.95   0.348    -.0723611    .0260047
           eg900 |    .025736   .0545449     0.47   0.639     -.084057    .1355291
         minwage |    .001213   .0037288     0.33   0.746    -.0062926    .0087186
unemploymentrate |  -.0120218   .0008727   -13.78   0.000    -.0137784   -.0102652
         incarcr |  -.6577399   1.817697    -0.36   0.719    -4.316575    3.001095
          ttrend |   .0030817   .0017442     1.77   0.084    -.0004291    .0065925
         ttrend2 |  -.0004847   .0001819    -2.67   0.011    -.0008508   -.0001186
         ttrend3 |   .0000154   5.10e-06     3.02   0.004     5.13e-06    .0000256
   _DgroXdti97_1 |  -.0262848   .0402317    -0.65   0.517    -.1072671    .0546974
   _DgroXdti97_2 |  -.0234445    .010712    -2.19   0.034    -.0450066   -.0018824
   _DgroXdti97_3 |  -.0618083    .044354    -1.39   0.170    -.1510884    .0274718
   _DgroXdti97_4 |  -.0031957   .0205511    -0.16   0.877     -.044563    .0381716
   _DgroXdti97_5 |  -.0010178    .003952    -0.26   0.798    -.0089728    .0069371
   _DgroXdti97_7 |  -.0012529   .0072417    -0.17   0.863    -.0158298    .0133239
   _DgroXdti97_8 |  -.0055082   .0104667    -0.53   0.601    -.0265766    .0155603
    _Sstatefip_1 |   .0131948   .0051049     2.58   0.013     .0029192    .0234705
    _Sstatefip_2 |   .1539657   .0338606     4.55   0.000     .0858079    .2221235
    _Sstatefip_4 |   .3872363   .0329081    11.77   0.000     .3209958    .4534768
    _Sstatefip_5 |  -.0549381   .0170643    -3.22   0.002    -.0892868   -.0205894
    _Sstatefip_6 |   .0357917   .0044897     7.97   0.000     .0267544    .0448291
    _Sstatefip_8 |   .0414824   .0059251     7.00   0.000     .0295557    .0534091
    _Sstatefip_9 |  -.0574941   .0335766    -1.71   0.094    -.1250802     .010092
   _Sstatefip_10 |    -.02817   .0407979    -0.69   0.493    -.1102919     .053952
   _Sstatefip_12 |  -.0150181   .0093183    -1.61   0.114    -.0337748    .0037386
   _Sstatefip_13 |   .0098718   .0074501     1.33   0.192    -.0051245    .0248682
   _Sstatefip_15 |   .3430381   .0253429    13.54   0.000     .2920254    .3940507
   _Sstatefip_16 |  -.0986666   .0228726    -4.31   0.000    -.1447067   -.0526265
   _Sstatefip_18 |    .030906   .0028753    10.75   0.000     .0251184    .0366936
   _Sstatefip_19 |  -.3155716   .0171398   -18.41   0.000    -.3500723    -.281071
   _Sstatefip_20 |  -.0164529   .0034725    -4.74   0.000    -.0234426   -.0094631
   _Sstatefip_21 |  -.0456734   .0020751   -22.01   0.000    -.0498505   -.0414964
   _Sstatefip_22 |   .0411007   .0065117     6.31   0.000     .0279932    .0542081
   _Sstatefip_23 |  -.1062233   .0341325    -3.11   0.003    -.1749284   -.0375183
   _Sstatefip_24 |    .008688   .0075887     1.14   0.258    -.0065873    .0239633
   _Sstatefip_25 |  -.0326611   .0036709    -8.90   0.000    -.0400502    -.025272
   _Sstatefip_26 |   .0316732   .0038544     8.22   0.000     .0239148    .0394317
   _Sstatefip_27 |   .0158608   .0036699     4.32   0.000     .0084738    .0232479
   _Sstatefip_28 |  -.3144738   .0254598   -12.35   0.000    -.3657218   -.2632257
   _Sstatefip_29 |   .0041412   .0014459     2.86   0.006     .0012308    .0070516
   _Sstatefip_31 |  -.1555897   .0102543   -15.17   0.000    -.1762306   -.1349487
   _Sstatefip_32 |   .1928562   .0348958     5.53   0.000     .1226146    .2630977
   _Sstatefip_33 |  -.1405702   .0369373    -3.81   0.000    -.2149211   -.0662194
   _Sstatefip_34 |  -.0001287   .0047778    -0.03   0.979    -.0097459    .0094885
   _Sstatefip_35 |   .5434436   .0240698    22.58   0.000     .4949935    .5918936
   _Sstatefip_36 |   5.45e-07   .0049798     0.00   1.000    -.0100233    .0100244
   _Sstatefip_37 |   .0008959   .0088792     0.10   0.920    -.0169771    .0187689
   _Sstatefip_38 |  -15.13734   3.406039    -4.44   0.000    -21.99334   -8.281335
   _Sstatefip_39 |   .0176493   .0019678     8.97   0.000     .0136883    .0216103
   _Sstatefip_40 |   .1080932    .013384     8.08   0.000     .0811527    .1350337
   _Sstatefip_41 |   .0253178   .0062778     4.03   0.000     .0126812    .0379543
   _Sstatefip_42 |  -.0211524   .0027421    -7.71   0.000     -.026672   -.0156328
   _Sstatefip_44 |   .0048764   .0332924     0.15   0.884    -.0621377    .0718904
   _Sstatefip_45 |          0  (omitted)
   _Sstatefip_46 |  -.0777201    .014406    -5.39   0.000    -.1067178   -.0487224
   _Sstatefip_47 |   .1287545    .039701     3.24   0.002     .0488405    .2086685
   _Sstatefip_48 |   .0368589   .0080461     4.58   0.000     .0206629    .0530548
   _Sstatefip_49 |    -.00512   .0142597    -0.36   0.721    -.0338233    .0235834
   _Sstatefip_51 |  -.0273899   .0088229    -3.10   0.003    -.0451494   -.0096304
   _Sstatefip_53 |   .0105715   .0062022     1.70   0.095    -.0019129    .0230558
   _Sstatefip_54 |  -.2300924   .0131779   -17.46   0.000     -.256618   -.2035667
   _Sstatefip_55 |  -.0184744   .0018658    -9.90   0.000      -.02223   -.0147188
   _SstaXgro_1_1 |   .0863238   .0174656     4.94   0.000     .0511674    .1214802
   _SstaXgro_1_2 |   .0647892   .0060675    10.68   0.000     .0525759    .0770025
   _SstaXgro_1_3 |   .1097197   .0182176     6.02   0.000     .0730495    .1463899
   _SstaXgro_1_4 |   .0492668   .0112273     4.39   0.000     .0266675    .0718661
   _SstaXgro_1_5 |  -.0098045   .0027201    -3.60   0.001    -.0152798   -.0043291
   _SstaXgro_1_7 |  -.0829722   .0062735   -13.23   0.000    -.0956001   -.0703443
   _SstaXgro_1_8 |  -.0133075   .0064495    -2.06   0.045    -.0262897   -.0003253
   _SstaXgro_2_1 |   .2195068   .0993807     2.21   0.032     .0194639    .4195497
   _SstaXgro_2_2 |   .0674668   .0255325     2.64   0.011     .0160726     .118861
   _SstaXgro_2_3 |   .0242849   .1087418     0.22   0.824     -.194601    .2431708
   _SstaXgro_2_4 |   .0055926   .0510053     0.11   0.913    -.0970757    .1082609
   _SstaXgro_2_5 |  -.0321996   .0098874    -3.26   0.002    -.0521019   -.0122973
   _SstaXgro_2_7 |  -.0229961   .0180196    -1.28   0.208    -.0592678    .0132755
   _SstaXgro_2_8 |  -.0108684   .0260624    -0.42   0.679    -.0633293    .0415924
   _SstaXgro_4_1 |     .01704   .0406365     0.42   0.677    -.0647571    .0988372
   _SstaXgro_4_2 |   .0687313   .0129863     5.29   0.000     .0425911    .0948714
   _SstaXgro_4_3 |   .0992896   .0426517     2.33   0.024     .0134362    .1851429
   _SstaXgro_4_4 |   .1009545   .0215094     4.69   0.000     .0576584    .1442506
   _SstaXgro_4_5 |  -.0083915    .004725    -1.78   0.082    -.0179024    .0011195
   _SstaXgro_4_7 |   .0141593   .0077513     1.83   0.074    -.0014433     .029762
   _SstaXgro_4_8 |  -.0198563    .011168    -1.78   0.082    -.0423363    .0026236
   _SstaXgro_5_1 |   .1802472   .0311687     5.78   0.000     .1175079    .2429864
   _SstaXgro_5_2 |   .1343548   .0096868    13.87   0.000     .1148564    .1538533
   _SstaXgro_5_3 |   .2399447   .0347993     6.90   0.000     .1698973    .3099922
   _SstaXgro_5_4 |   .0743148   .0158544     4.69   0.000     .0424015    .1062281
   _SstaXgro_5_5 |    .004322   .0032245     1.34   0.187    -.0021685    .0108125
   _SstaXgro_5_7 |   -.002832   .0060354    -0.47   0.641    -.0149806    .0093166
   _SstaXgro_5_8 |   .0126793   .0079107     1.60   0.116    -.0032441    .0286026
   _SstaXgro_6_1 |   .0409025   .0431581     0.95   0.348    -.0459703    .1277753
   _SstaXgro_6_2 |   .0668854   .0116791     5.73   0.000     .0433765    .0903942
   _SstaXgro_6_3 |    .003066   .0477044     0.06   0.949     -.092958    .0990901
   _SstaXgro_6_4 |   .0308647   .0220331     1.40   0.168    -.0134857    .0752151
   _SstaXgro_6_5 |  -.0355821   .0042332    -8.41   0.000    -.0441032   -.0270611
   _SstaXgro_6_7 |  -.0408634   .0077275    -5.29   0.000    -.0564181   -.0253087
   _SstaXgro_6_8 |  -.0098293   .0112012    -0.88   0.385     -.032376    .0127175
   _SstaXgro_8_1 |   .0241765   .0773779     0.31   0.756    -.1315771    .1799301
   _SstaXgro_8_2 |   .0596266   .0209256     2.85   0.007     .0175057    .1017476
   _SstaXgro_8_3 |   .0628467   .0850645     0.74   0.464    -.1083793    .2340727
   _SstaXgro_8_4 |   .0457928    .039402     1.16   0.251    -.0335194     .125105
   _SstaXgro_8_5 |   .0012636   .0075501     0.17   0.868     -.013934    .0164612
   _SstaXgro_8_7 |   .0284081   .0138633     2.05   0.046     .0005027    .0563136
   _SstaXgro_8_8 |  -.0125988   .0201044    -0.63   0.534    -.0530669    .0278692
   _SstaXgro_9_1 |   .1463945    .005455    26.84   0.000     .1354142    .1573747
   _SstaXgro_9_2 |   .0524809   .0021889    23.98   0.000     .0480749     .056887
   _SstaXgro_9_3 |   .1851858   .0051772    35.77   0.000     .1747647     .195607
   _SstaXgro_9_4 |   .0558252   .0033074    16.88   0.000     .0491677    .0624827
   _SstaXgro_9_5 |   .0143328   .0015058     9.52   0.000     .0113018    .0173639
   _SstaXgro_9_7 |   .0488457   .0028578    17.09   0.000     .0430932    .0545981
   _SstaXgro_9_8 |   .0134846   .0028547     4.72   0.000     .0077384    .0192308
  _SstaXgro_10_1 |   .1682822   .0266543     6.31   0.000     .1146299    .2219345
  _SstaXgro_10_2 |   .0968401   .0065992    14.67   0.000     .0835567    .1101235
  _SstaXgro_10_3 |   .1658702   .0281667     5.89   0.000     .1091736    .2225667
  _SstaXgro_10_4 |   .0713797   .0136933     5.21   0.000     .0438165    .0989428
  _SstaXgro_10_5 |    .013259   .0030088     4.41   0.000     .0072026    .0193154
  _SstaXgro_10_7 |   .0273058   .0052851     5.17   0.000     .0166674    .0379442
  _SstaXgro_10_8 |   .0034864   .0071853     0.49   0.630    -.0109769    .0179498
  _SstaXgro_12_1 |    .136376   .0889212     1.53   0.132    -.0426131    .3153651
  _SstaXgro_12_2 |    .039819   .0233532     1.71   0.095    -.0071886    .0868266
  _SstaXgro_12_3 |   .0114619    .097345     0.12   0.907    -.1844835    .2074073
  _SstaXgro_12_4 |   .0710188   .0453911     1.56   0.125    -.0203487    .1623863
  _SstaXgro_12_5 |   .0157762   .0087697     1.80   0.079    -.0018763    .0334288
  _SstaXgro_12_7 |   .0244548   .0160507     1.52   0.134    -.0078536    .0567632
  _SstaXgro_12_8 |  -.0055001   .0232705    -0.24   0.814    -.0523413     .041341
  _SstaXgro_13_1 |   .1491217   .0256407     5.82   0.000     .0975097    .2007337
  _SstaXgro_13_2 |    .098361   .0074005    13.29   0.000     .0834646    .1132573
  _SstaXgro_13_3 |   .1544464   .0277075     5.57   0.000     .0986741    .2102188
  _SstaXgro_13_4 |   .0760079   .0136308     5.58   0.000     .0485706    .1034453
  _SstaXgro_13_5 |   .0122299   .0029321     4.17   0.000      .006328    .0181318
  _SstaXgro_13_7 |  -.0401925   .0064419    -6.24   0.000    -.0531594   -.0272256
  _SstaXgro_13_8 |  -.0399551   .0072389    -5.52   0.000    -.0545263   -.0253839
  _SstaXgro_15_1 |   .3264904    .126063     2.59   0.013     .0727387    .5802422
  _SstaXgro_15_2 |   .1570932   .0325598     4.82   0.000     .0915538    .2226326
  _SstaXgro_15_3 |  -.0868916   .1380714    -0.63   0.532     -.364815    .1910317
  _SstaXgro_15_4 |  -.1930415   .0647116    -2.98   0.005    -.3232992   -.0627837
  _SstaXgro_15_5 |   -.018723   .0124015    -1.51   0.138    -.0436859    .0062399
  _SstaXgro_15_7 |  -.0219153   .0227779    -0.96   0.341    -.0677648    .0239343
  _SstaXgro_15_8 |     .00207   .0329658     0.06   0.950    -.0642867    .0684268
  _SstaXgro_16_1 |   -.411521   .1044924    -3.94   0.000    -.6218533   -.2011887
  _SstaXgro_16_2 |   .1870134    .029252     6.39   0.000     .1281323    .2458946
  _SstaXgro_16_3 |   -.358782   .1140041    -3.15   0.003    -.5882604   -.1293035
  _SstaXgro_16_4 |  -.2107596   .0539995    -3.90   0.000    -.3194551   -.1020642
  _SstaXgro_16_5 |   .0025961    .010441     0.25   0.805    -.0184205    .0236126
  _SstaXgro_16_7 |   .1032534   .0188683     5.47   0.000     .0652735    .1412334
  _SstaXgro_16_8 |  -.0135698   .0274263    -0.49   0.623    -.0687762    .0416366
  _SstaXgro_18_1 |  -.0010491    .026944    -0.04   0.969    -.0552845    .0531863
  _SstaXgro_18_2 |  -.0274258   .0076928    -3.57   0.001    -.0429106    -.011941
  _SstaXgro_18_3 |   .1543317   .0325991     4.73   0.000     .0887132    .2199502
  _SstaXgro_18_4 |   .0004281   .0146423     0.03   0.977    -.0290452    .0299015
  _SstaXgro_18_5 |    -.01921   .0031857    -6.03   0.000    -.0256224   -.0127976
  _SstaXgro_18_7 |  -.0232424   .0056947    -4.08   0.000    -.0347052   -.0117796
  _SstaXgro_18_8 |   .0032475   .0083414     0.39   0.699    -.0135429    .0200378
  _SstaXgro_19_1 |   .1190853    .017447     6.83   0.000     .0839663    .1542043
  _SstaXgro_19_2 |   .0450549   .0066979     6.73   0.000     .0315727     .058537
  _SstaXgro_19_3 |   .0522849   .0172639     3.03   0.004     .0175346    .0870353
  _SstaXgro_19_4 |  -.0508237   .0094142    -5.40   0.000    -.0697734    -.031874
  _SstaXgro_19_5 |  -.0074585   .0026044    -2.86   0.006    -.0127008   -.0022161
  _SstaXgro_19_7 |   .0416469   .0048949     8.51   0.000     .0317939    .0514999
  _SstaXgro_19_8 |   .0189791   .0056835     3.34   0.002     .0075388    .0304194
  _SstaXgro_20_1 |   .0689145   .0138993     4.96   0.000     .0409367    .0968923
  _SstaXgro_20_2 |   .0476991    .004267    11.18   0.000     .0391102    .0562881
  _SstaXgro_20_3 |    .122112   .0150329     8.12   0.000     .0918524    .1523716
  _SstaXgro_20_4 |   -.070835    .007722    -9.17   0.000    -.0863784   -.0552915
  _SstaXgro_20_5 |   .0027644   .0015424     1.79   0.080    -.0003403    .0058691
  _SstaXgro_20_7 |   .0036506   .0029972     1.22   0.229    -.0023825    .0096837
  _SstaXgro_20_8 |  -.0386908   .0039557    -9.78   0.000    -.0466533   -.0307284
  _SstaXgro_21_1 |   .0144846   .0185542     0.78   0.439    -.0228632    .0518323
  _SstaXgro_21_2 |  -.0215663   .0067192    -3.21   0.002    -.0350913   -.0080413
  _SstaXgro_21_3 |   .0916591   .0210186     4.36   0.000     .0493508    .1339674
  _SstaXgro_21_4 |  -.0365028   .0097378    -3.75   0.000    -.0561039   -.0169017
  _SstaXgro_21_5 |   .0002448   .0018949     0.13   0.898    -.0035694    .0040591
  _SstaXgro_21_7 |  -.0298161   .0035728    -8.35   0.000    -.0370078   -.0226243
  _SstaXgro_21_8 |   .0097577   .0046364     2.10   0.041     .0004252    .0190902
  _SstaXgro_22_1 |    .075554   .0528833     1.43   0.160    -.0308946    .1820026
  _SstaXgro_22_2 |  -.0111442   .0136165    -0.82   0.417    -.0385528    .0162644
  _SstaXgro_22_3 |  -.0478937   .0578418    -0.83   0.412    -.1643232    .0685358
  _SstaXgro_22_4 |   .0331712    .027265     1.22   0.230    -.0217103    .0880528
  _SstaXgro_22_5 |   .0028641   .0052087     0.55   0.585    -.0076205    .0133487
  _SstaXgro_22_7 |  -.0613487   .0095437    -6.43   0.000    -.0805593   -.0421382
  _SstaXgro_22_8 |  -.0329765   .0138535    -2.38   0.021    -.0608621   -.0050909
  _SstaXgro_23_1 |   .3533902   .1025414     3.45   0.001     .1469851    .5597952
  _SstaXgro_23_2 |   .1243254   .0259729     4.79   0.000     .0720448    .1766061
  _SstaXgro_23_3 |   .0860514   .1105035     0.78   0.440    -.1363806    .3084834
  _SstaXgro_23_4 |   .3357362   .0524439     6.40   0.000     .2301722    .4413003
  _SstaXgro_23_5 |   -.061382   .0100754    -6.09   0.000    -.0816627   -.0411013
  _SstaXgro_23_7 |  -.0197224    .018528    -1.06   0.293    -.0570175    .0175726
  _SstaXgro_23_8 |  -.0001299   .0267646    -0.00   0.996    -.0540043    .0537445
  _SstaXgro_24_1 |   .0675213   .1039392     0.65   0.519    -.1416974      .27674
  _SstaXgro_24_2 |   .0068512   .0289342     0.24   0.814    -.0513904    .0650927
  _SstaXgro_24_3 |   .0206006   .1147706     0.18   0.858    -.2104206    .2516218
  _SstaXgro_24_4 |   .1034714   .0550068     1.88   0.066    -.0072515    .2141944
  _SstaXgro_24_5 |  -.0011857   .0102304    -0.12   0.908    -.0217785     .019407
  _SstaXgro_24_7 |   .0154192   .0183122     0.84   0.404    -.0214414    .0522797
  _SstaXgro_24_8 |  -.0123501   .0275827    -0.45   0.656    -.0678713    .0431711
  _SstaXgro_25_1 |    .144812    .035383     4.09   0.000     .0735897    .2160343
  _SstaXgro_25_2 |  -.0117273   .0093278    -1.26   0.215    -.0305032    .0070486
  _SstaXgro_25_3 |   .0311599   .0389718     0.80   0.428    -.0472863     .109606
  _SstaXgro_25_4 |   .0602905   .0181141     3.33   0.002     .0238287    .0967523
  _SstaXgro_25_5 |  -.0160718   .0034917    -4.60   0.000    -.0231003   -.0090433
  _SstaXgro_25_7 |   .0248159   .0065496     3.79   0.000     .0116324    .0379995
  _SstaXgro_25_8 |   .0285012   .0093617     3.04   0.004     .0096572    .0473453
  _SstaXgro_26_1 |   -.018959   .0005713   -33.19   0.000    -.0201089   -.0178091
  _SstaXgro_26_2 |   .0236066   .0007811    30.22   0.000     .0220343    .0251789
  _SstaXgro_26_3 |   .0096929   .0007551    12.84   0.000     .0081729    .0112129
  _SstaXgro_26_4 |  -.0391531   .0008303   -47.16   0.000    -.0408243   -.0374819
  _SstaXgro_26_5 |  -.0275558    .000485   -56.82   0.000     -.028532   -.0265795
  _SstaXgro_26_7 |  -.0459225   .0008764   -52.40   0.000    -.0476866   -.0441585
  _SstaXgro_26_8 |  -.0035564   .0003196   -11.13   0.000    -.0041998    -.002913
  _SstaXgro_27_1 |   .0966654   .0133797     7.22   0.000     .0697335    .1235973
  _SstaXgro_27_2 |   .1026928    .004478    22.93   0.000     .0936791    .1117065
  _SstaXgro_27_3 |  -.1045094   .0139838    -7.47   0.000    -.1326573   -.0763614
  _SstaXgro_27_4 |  -.0481527   .0066363    -7.26   0.000    -.0615108   -.0347946
  _SstaXgro_27_5 |  -.0093019   .0014591    -6.37   0.000     -.012239   -.0063648
  _SstaXgro_27_7 |   .0870348   .0023092    37.69   0.000     .0823865     .091683
  _SstaXgro_27_8 |     .04885     .00348    14.04   0.000     .0418451    .0558549
  _SstaXgro_28_1 |   .1999709   .0237806     8.41   0.000     .1521031    .2478388
  _SstaXgro_28_2 |    .130417   .0071861    18.15   0.000     .1159522    .1448819
  _SstaXgro_28_3 |   .1490514    .027385     5.44   0.000     .0939282    .2041747
  _SstaXgro_28_4 |   .0706882    .012693     5.57   0.000     .0451385    .0962378
  _SstaXgro_28_5 |  -.0009607   .0025704    -0.37   0.710    -.0061347    .0042132
  _SstaXgro_28_7 |  -.0139779   .0055854    -2.50   0.016    -.0252207   -.0027352
  _SstaXgro_28_8 |   .0206052    .006326     3.26   0.002     .0078717    .0333387
  _SstaXgro_29_1 |   .0797617   .0097117     8.21   0.000     .0602131    .0993103
  _SstaXgro_29_2 |   .0487344   .0022662    21.50   0.000     .0441727    .0532961
  _SstaXgro_29_3 |   .1118161   .0107042    10.45   0.000     .0902698    .1333625
  _SstaXgro_29_4 |   .0181387    .004975     3.65   0.001     .0081246    .0281528
  _SstaXgro_29_5 |   .0092247   .0009278     9.94   0.000     .0073571    .0110923
  _SstaXgro_29_7 |   .0221608   .0016658    13.30   0.000     .0188078    .0255138
  _SstaXgro_29_8 |   .0271976   .0025178    10.80   0.000     .0221296    .0322656
  _SstaXgro_31_1 |   .0831281    .041128     2.02   0.049     .0003418    .1659144
  _SstaXgro_31_2 |   .0640244   .0098269     6.52   0.000     .0442438     .083805
  _SstaXgro_31_3 |   .0296839   .0444646     0.67   0.508    -.0598186    .1191864
  _SstaXgro_31_4 |   .0315083   .0213607     1.48   0.147    -.0114885     .074505
  _SstaXgro_31_5 |   .0211701   .0041709     5.08   0.000     .0127746    .0295656
  _SstaXgro_31_7 |   .0689301    .007738     8.91   0.000     .0533545    .0845058
  _SstaXgro_31_8 |   .0247165   .0108983     2.27   0.028     .0027792    .0466537
  _SstaXgro_32_1 |    .148259   .0613711     2.42   0.020     .0247254    .2717926
  _SstaXgro_32_2 |   .0133402   .0154598     0.86   0.393    -.0177788    .0444592
  _SstaXgro_32_3 |   .0667086   .0668641     1.00   0.324    -.0678818    .2012989
  _SstaXgro_32_4 |    .007732   .0315748     0.24   0.808    -.0558246    .0712887
  _SstaXgro_32_5 |  -.0264172   .0061099    -4.32   0.000    -.0387157   -.0141187
  _SstaXgro_32_7 |   .0062459   .0113505     0.55   0.585    -.0166015    .0290934
  _SstaXgro_32_8 |   -.028141   .0161143    -1.75   0.087    -.0605774    .0042955
  _SstaXgro_33_1 |   .2175327   .0581794     3.74   0.001     .1004236    .3346417
  _SstaXgro_33_2 |   .1083768   .0133019     8.15   0.000     .0816014    .1351522
  _SstaXgro_33_3 |   .1064962   .0629181     1.69   0.097    -.0201514    .2331438
  _SstaXgro_33_4 |   .1142948   .0304931     3.75   0.000     .0529153    .1756743
  _SstaXgro_33_5 |   .0007021   .0056959     0.12   0.902    -.0107632    .0121674
  _SstaXgro_33_7 |   .0156302   .0107269     1.46   0.152    -.0059618    .0372222
  _SstaXgro_33_8 |   .0064732   .0151315     0.43   0.671     -.023985    .0369314
  _SstaXgro_34_1 |    .105761   .0605194     1.75   0.087    -.0160583    .2275803
  _SstaXgro_34_2 |   .0129927   .0157397     0.83   0.413    -.0186897    .0446751
  _SstaXgro_34_3 |   .0534499   .0660187     0.81   0.422    -.0794388    .1863386
  _SstaXgro_34_4 |   .0115692   .0302983     0.38   0.704    -.0494181    .0725566
  _SstaXgro_34_5 |   .0138154   .0053942     2.56   0.014     .0029574    .0246733
  _SstaXgro_34_7 |  -.0125476   .0092229    -1.36   0.180    -.0311123    .0060171
  _SstaXgro_34_8 |  -.0251683   .0146139    -1.72   0.092    -.0545846     .004248
  _SstaXgro_35_1 |   .1993628   .1137026     1.75   0.086    -.0295087    .4282343
  _SstaXgro_35_2 |   .0465223   .0297793     1.56   0.125    -.0134204     .106465
  _SstaXgro_35_3 |   .0089883   .1240909     0.07   0.943    -.2407937    .2587704
  _SstaXgro_35_4 |  -.0578874   .0583492    -0.99   0.326    -.1753381    .0595634
  _SstaXgro_35_5 |  -.0269372   .0111295    -2.42   0.020    -.0493398   -.0045346
  _SstaXgro_35_7 |  -.0106121    .020651    -0.51   0.610    -.0521803    .0309562
  _SstaXgro_35_8 |  -.0270399   .0297537    -0.91   0.368    -.0869311    .0328513
  _SstaXgro_36_1 |    .030817   .0710732     0.43   0.667    -.1122459    .1738799
  _SstaXgro_36_2 |  -.0042804   .0190051    -0.23   0.823    -.0425356    .0339748
  _SstaXgro_36_3 |  -.0371552   .0783447    -0.47   0.638    -.1948548    .1205444
  _SstaXgro_36_4 |  -.0190509   .0363119    -0.52   0.602    -.0921431    .0540412
  _SstaXgro_36_5 |  -.0181452   .0069525    -2.61   0.012    -.0321398   -.0041506
  _SstaXgro_36_7 |   -.055336   .0127244    -4.35   0.000    -.0809488   -.0297232
  _SstaXgro_36_8 |  -.0174359   .0184429    -0.95   0.349    -.0545595    .0196877
  _SstaXgro_37_1 |    .252876   .0363363     6.96   0.000     .1797349    .3260172
  _SstaXgro_37_2 |   .1006098   .0108495     9.27   0.000     .0787708    .1224488
  _SstaXgro_37_3 |   .2205023   .0406336     5.43   0.000     .1387112    .3022934
  _SstaXgro_37_4 |   .0892041   .0184453     4.84   0.000     .0520757    .1263325
  _SstaXgro_37_5 |   .0201837   .0036738     5.49   0.000     .0127887    .0275786
  _SstaXgro_37_7 |   .0319853   .0068226     4.69   0.000     .0182521    .0457185
  _SstaXgro_37_8 |  -.0119943    .009359    -1.28   0.206    -.0308329    .0068443
  _SstaXgro_38_1 |          0  (omitted)
  _SstaXgro_38_2 |   .2338545   .0329911     7.09   0.000     .1674468    .3002621
  _SstaXgro_38_3 |   .1692316   .1498528     1.13   0.265    -.1324065    .4708697
  _SstaXgro_38_4 |          0  (omitted)
  _SstaXgro_38_5 |   .0090103   .0129876     0.69   0.491    -.0171324    .0351531
  _SstaXgro_38_7 |   .1152755   .0245687     4.69   0.000     .0658214    .1647296
  _SstaXgro_38_8 |   .0403734   .0349198     1.16   0.254    -.0299166    .1106633
  _SstaXgro_39_1 |   .0579743   .0156302     3.71   0.001     .0265123    .0894363
  _SstaXgro_39_2 |   .0172828   .0042381     4.08   0.000     .0087518    .0258137
  _SstaXgro_39_3 |   .0673806   .0174012     3.87   0.000     .0323538    .1024073
  _SstaXgro_39_4 |  -.0070692   .0079721    -0.89   0.380    -.0231161    .0089777
  _SstaXgro_39_5 |  -.0282187   .0015902   -17.75   0.000    -.0314196   -.0250177
  _SstaXgro_39_7 |  -.0415518   .0029469   -14.10   0.000    -.0474835     -.03562
  _SstaXgro_39_8 |  -.0009793   .0040501    -0.24   0.810    -.0091318    .0071732
  _SstaXgro_40_1 |   .0129333   .0504995     0.26   0.799    -.0887169    .1145836
  _SstaXgro_40_2 |   .0387659   .0122013     3.18   0.003      .014206    .0633259
  _SstaXgro_40_3 |  -.0218868   .0546942    -0.40   0.691    -.1319805     .088207
  _SstaXgro_40_4 |  -.0105205   .0261618    -0.40   0.689    -.0631815    .0421405
  _SstaXgro_40_5 |  -.0016542   .0050827    -0.33   0.746    -.0118852    .0085768
  _SstaXgro_40_7 |   .0081132   .0093572     0.87   0.390    -.0107219    .0269482
  _SstaXgro_40_8 |  -.0295024   .0133622    -2.21   0.032    -.0563991   -.0026057
  _SstaXgro_41_1 |   .0015274   .0712101     0.02   0.983     -.141811    .1448659
  _SstaXgro_41_2 |   .0733082    .018281     4.01   0.000     .0365103     .110106
  _SstaXgro_41_3 |  -.0455896   .0788812    -0.58   0.566    -.2043693    .1131901
  _SstaXgro_41_4 |   -.054748    .036586    -1.50   0.141    -.1283918    .0188957
  _SstaXgro_41_5 |  -.0121104   .0069837    -1.73   0.090    -.0261679    .0019471
  _SstaXgro_41_7 |   .0088001   .0127807     0.69   0.495    -.0169261    .0345263
  _SstaXgro_41_8 |  -.0009074    .018514    -0.05   0.961    -.0381741    .0363592
  _SstaXgro_42_1 |   .0092242   .0173572     0.53   0.598     -.025714    .0441624
  _SstaXgro_42_2 |   .0221042   .0043642     5.06   0.000     .0133196    .0308889
  _SstaXgro_42_3 |   .0507921   .0191788     2.65   0.011     .0121873     .089397
  _SstaXgro_42_4 |   .0219014    .008926     2.45   0.018     .0039343    .0398684
  _SstaXgro_42_5 |  -.0057307    .001741    -3.29   0.002    -.0092352   -.0022261
  _SstaXgro_42_7 |  -.0138542   .0031345    -4.42   0.000    -.0201636   -.0075447
  _SstaXgro_42_8 |  -.0087879   .0045186    -1.94   0.058    -.0178834    .0003077
  _SstaXgro_44_1 |   .1108686   .0746271     1.49   0.144    -.0393479     .261085
  _SstaXgro_44_2 |  -.0268952    .018932    -1.42   0.162    -.0650033    .0112129
  _SstaXgro_44_3 |   .0438961   .0815472     0.54   0.593    -.1202499    .2080422
  _SstaXgro_44_4 |     .01918   .0386365     0.50   0.622    -.0585913    .0969512
  _SstaXgro_44_5 |  -.0210313   .0073781    -2.85   0.007    -.0358826   -.0061799
  _SstaXgro_44_7 |   .0277329   .0136396     2.03   0.048     .0002778    .0551879
  _SstaXgro_44_8 |   .0375861   .0196341     1.91   0.062    -.0019354    .0771076
  _SstaXgro_45_1 |   .1176062   .0507178     2.32   0.025     .0155165    .2196959
  _SstaXgro_45_2 |   .0467628   .0154344     3.03   0.004     .0156949    .0778306
  _SstaXgro_45_3 |   .1373025    .029432     4.67   0.000      .078059     .196546
  _SstaXgro_45_4 |   .0110276   .0268342     0.41   0.683    -.0429869     .065042
  _SstaXgro_45_5 |  -.0186128   .0085279    -2.18   0.034    -.0357786   -.0014471
  _SstaXgro_45_7 |  -.0625942   .0232058    -2.70   0.010     -.109305   -.0158834
  _SstaXgro_45_8 |  -.0377462   .0166074    -2.27   0.028    -.0711752   -.0043172
  _SstaXgro_46_1 |   .3185714   .1023664     3.11   0.003     .1125186    .5246242
  _SstaXgro_46_2 |   .0884487   .0245148     3.61   0.001     .0391029    .1377945
  _SstaXgro_46_3 |    .094509   .1122763     0.84   0.404    -.1314915    .3205094
  _SstaXgro_46_4 |   .1253973    .053034     2.36   0.022     .0186454    .2321492
  _SstaXgro_46_5 |   .0182706   .0102045     1.79   0.080    -.0022699    .0388111
  _SstaXgro_46_7 |   .1091728    .018554     5.88   0.000     .0718256      .14652
  _SstaXgro_46_8 |   .0367596   .0268832     1.37   0.178    -.0173535    .0908727
  _SstaXgro_47_1 |   .1051411    .039694     2.65   0.011     .0252412     .185041
  _SstaXgro_47_2 |   .0927025   .0114933     8.07   0.000     .0695676    .1158374
  _SstaXgro_47_3 |   .1670206   .0444691     3.76   0.000     .0775089    .2565323
  _SstaXgro_47_4 |   .0725779    .020604     3.52   0.001     .0311041    .1140516
  _SstaXgro_47_5 |  -.0320726   .0041828    -7.67   0.000    -.0404922    -.023653
  _SstaXgro_47_7 |  -.0443769   .0084236    -5.27   0.000    -.0613327    -.027421
  _SstaXgro_47_8 |   -.028595    .010595    -2.70   0.010    -.0499216   -.0072684
  _SstaXgro_48_1 |   .1367894   .0081584    16.77   0.000     .1203673    .1532114
  _SstaXgro_48_2 |   .0650509   .0018222    35.70   0.000      .061383    .0687188
  _SstaXgro_48_3 |   .1399909    .008739    16.02   0.000     .1224002    .1575816
  _SstaXgro_48_4 |    .042062   .0044759     9.40   0.000     .0330525    .0510715
  _SstaXgro_48_5 |    .017843   .0009526    18.73   0.000     .0159255    .0197604
  _SstaXgro_48_7 |  -.0062531   .0015973    -3.91   0.000    -.0094684   -.0030378
  _SstaXgro_48_8 |  -.0302328   .0021776   -13.88   0.000    -.0346161   -.0258494
  _SstaXgro_49_1 |   .0950606   .0067207    14.14   0.000     .0815325    .1085887
  _SstaXgro_49_2 |   .1135428    .001864    60.91   0.000     .1097908    .1172949
  _SstaXgro_49_3 |   .2927077   .0054476    53.73   0.000     .2817422    .3036732
  _SstaXgro_49_4 |   .1188544   .0050998    23.31   0.000      .108589    .1291198
  _SstaXgro_49_5 |   .0292531   .0017011    17.20   0.000      .025829    .0326772
  _SstaXgro_49_7 |   .0258799    .002606     9.93   0.000     .0206343    .0311254
  _SstaXgro_49_8 |  -.0638449   .0017743   -35.98   0.000    -.0674165   -.0602734
  _SstaXgro_51_1 |   .1797837   .0420212     4.28   0.000     .0951995     .264368
  _SstaXgro_51_2 |   .1074808   .0134391     8.00   0.000     .0804294    .1345322
  _SstaXgro_51_3 |   .0970137   .0454206     2.14   0.038     .0055868    .1884405
  _SstaXgro_51_4 |   .0496796   .0230675     2.15   0.037      .003247    .0961122
  _SstaXgro_51_5 |   .0284502   .0072598     3.92   0.000      .013837    .0430634
  _SstaXgro_51_7 |   .0090775   .0108565     0.84   0.407    -.0127754    .0309305
  _SstaXgro_51_8 |  -.0300871   .0206131    -1.46   0.151    -.0715791    .0114049
  _SstaXgro_53_1 |   .0587299   .0603007     0.97   0.335    -.0626491    .1801089
  _SstaXgro_53_2 |   .0529417   .0159029     3.33   0.002     .0209309    .0849525
  _SstaXgro_53_3 |   .1120938   .0663798     1.69   0.098    -.0215219    .2457094
  _SstaXgro_53_4 |   .0556701   .0312513     1.78   0.081    -.0072355    .1185758
  _SstaXgro_53_5 |    -.00041    .005987    -0.07   0.946    -.0124611    .0116412
  _SstaXgro_53_7 |  -.0041366   .0109537    -0.38   0.707    -.0261853    .0179121
  _SstaXgro_53_8 |  -.0092422   .0157954    -0.59   0.561    -.0410367    .0225524
  _SstaXgro_54_1 |  -.0015268   .0477164    -0.03   0.975     -.097575    .0945214
  _SstaXgro_54_2 |   .0114721    .012977     0.88   0.381    -.0146492    .0375934
  _SstaXgro_54_3 |   .0170117   .0515696     0.33   0.743    -.0867925    .1208159
  _SstaXgro_54_4 |  -.0358321    .024802    -1.44   0.155     -.085756    .0140918
  _SstaXgro_54_5 |  -.0880987   .0047595   -18.51   0.000    -.0976792   -.0785183
  _SstaXgro_54_7 |  -.1242253   .0088457   -14.04   0.000    -.1420307   -.1064198
  _SstaXgro_54_8 |   .0259004   .0125011     2.07   0.044     .0007369    .0510639
  _SstaXgro_55_1 |   .0127344   .0132379     0.96   0.341    -.0139122    .0393809
  _SstaXgro_55_2 |    .033232   .0037938     8.76   0.000     .0255954    .0408686
  _SstaXgro_55_3 |   .1044547   .0144854     7.21   0.000      .075297    .1336123
  _SstaXgro_55_4 |  -.0469729   .0066758    -7.04   0.000    -.0604105   -.0335352
  _SstaXgro_55_5 |   .0157934   .0013708    11.52   0.000     .0130342    .0185526
  _SstaXgro_55_7 |   .0633953   .0024568    25.80   0.000       .05845    .0683406
  _SstaXgro_55_8 |   .0178392   .0033968     5.25   0.000     .0110018    .0246766
    _SstaXttre_1 |     .00028   .0007271     0.39   0.702    -.0011836    .0017435
    _SstaXttre_2 |  -.0299232   .0056944    -5.25   0.000    -.0413853    -.018461
    _SstaXttre_4 |  -.1095831   .0098007   -11.18   0.000    -.1293108   -.0898553
    _SstaXttre_5 |   .0183051   .0043849     4.17   0.000     .0094787    .0271315
    _SstaXttre_6 |  -.0097811   .0013025    -7.51   0.000    -.0124029   -.0071593
    _SstaXttre_8 |  -.0146339   .0013139   -11.14   0.000    -.0172785   -.0119892
    _SstaXttre_9 |   .0007156   .0097356     0.07   0.942    -.0188812    .0203123
   _SstaXttre_10 |   -.003043    .009495    -0.32   0.750    -.0221555    .0160695
   _SstaXttre_12 |   .0019944    .001901     1.05   0.300     -.001832    .0058209
   _SstaXttre_13 |   .0107168    .001663     6.44   0.000     .0073693    .0140642
   _SstaXttre_15 |  -.0920946   .0068043   -13.53   0.000     -.105791   -.0783982
   _SstaXttre_16 |   .0218869    .005339     4.10   0.000       .01114    .0326338
   _SstaXttre_18 |  -.0147192   .0009098   -16.18   0.000    -.0165506   -.0128878
   _SstaXttre_19 |   .0922911   .0046892    19.68   0.000     .0828522      .10173
   _SstaXttre_20 |  -.0039068   .0013621    -2.87   0.006    -.0066486    -.001165
   _SstaXttre_21 |   .0036797   .0005027     7.32   0.000     .0026678    .0046917
   _SstaXttre_22 |  -.0056713   .0013058    -4.34   0.000    -.0082998   -.0030429
   _SstaXttre_23 |   .0153458   .0087417     1.76   0.086    -.0022504     .032942
   _SstaXttre_24 |   .0029858    .001249     2.39   0.021     .0004716    .0054999
   _SstaXttre_25 |   .0016216   .0016345     0.99   0.326    -.0016686    .0049117
   _SstaXttre_26 |  -.0056368   .0005862    -9.62   0.000    -.0068169   -.0044568
   _SstaXttre_27 |   -.007373   .0007166   -10.29   0.000    -.0088154   -.0059307
   _SstaXttre_28 |   .0809812   .0071999    11.25   0.000     .0664886    .0954738
   _SstaXttre_29 |  -.0088976    .000751   -11.85   0.000    -.0104092   -.0073859
   _SstaXttre_31 |    .029977   .0026527    11.30   0.000     .0246374    .0353165
   _SstaXttre_32 |  -.0382508   .0074518    -5.13   0.000    -.0532504   -.0232512
   _SstaXttre_33 |   .0437776   .0091207     4.80   0.000     .0254187    .0621366
   _SstaXttre_34 |  -.0076003   .0014942    -5.09   0.000     -.010608   -.0045926
   _SstaXttre_35 |  -.1327362    .004643   -28.59   0.000     -.142082   -.1233904
   _SstaXttre_36 |  -.0069186   .0011202    -6.18   0.000    -.0091736   -.0046637
   _SstaXttre_37 |  -.0052168   .0016469    -3.17   0.003    -.0085318   -.0019019
   _SstaXttre_38 |   2.687599   .5727473     4.69   0.000     1.534719     3.84048
   _SstaXttre_39 |  -.0056994   .0004225   -13.49   0.000    -.0065498    -.004849
   _SstaXttre_40 |  -.0177898   .0025667    -6.93   0.000    -.0229563   -.0126233
   _SstaXttre_41 |  -.0152875   .0010095   -15.14   0.000    -.0173194   -.0132556
   _SstaXttre_42 |  -.0080054   .0007445   -10.75   0.000     -.009504   -.0065068
   _SstaXttre_44 |   -.007006   .0081828    -0.86   0.396    -.0234771    .0094651
   _SstaXttre_45 |   .1185399   .0167037     7.10   0.000     .0849171    .1521628
   _SstaXttre_46 |    .017362   .0035616     4.87   0.000      .010193     .024531
   _SstaXttre_47 |  -.0341383   .0114565    -2.98   0.005     -.057199   -.0110775
   _SstaXttre_48 |  -.0109961   .0027475    -4.00   0.000    -.0165266   -.0054656
   _SstaXttre_49 |  -.0198466   .0030355    -6.54   0.000    -.0259568   -.0137365
   _SstaXttre_51 |   .0118745   .0011075    10.72   0.000     .0096452    .0141038
   _SstaXttre_53 |   -.002062   .0008287    -2.49   0.017    -.0037302   -.0003939
   _SstaXttre_54 |   .0541919   .0028369    19.10   0.000     .0484815    .0599023
   _SstaXttre_55 |     -.0102   .0005959   -17.12   0.000    -.0113994   -.0090006
    _SstaXttrea1 |  -.0003989   .0001026    -3.89   0.000    -.0006054   -.0001923
    _SstaXttrea2 |   .0021832   .0004542     4.81   0.000      .001269    .0030974
    _SstaXttrea4 |   .0098302   .0008688    11.31   0.000     .0080814     .011579
    _SstaXttrea5 |  -.0018756   .0003353    -5.59   0.000    -.0025506   -.0012007
    _SstaXttrea6 |   .0007917   .0001463     5.41   0.000     .0004973    .0010862
    _SstaXttrea8 |   .0013869   .0001653     8.39   0.000     .0010542    .0017197
    _SstaXttrea9 |   .0006453   .0008472     0.76   0.450      -.00106    .0023506
   _SstaXttrea10 |   .0007464    .000803     0.93   0.357    -.0008699    .0023628
   _SstaXttrea12 |   .0002264    .000208     1.09   0.282    -.0001923    .0006451
   _SstaXttrea13 |  -.0015436   .0002344    -6.58   0.000    -.0020155   -.0010718
   _SstaXttrea15 |    .007219   .0005805    12.44   0.000     .0060505    .0083874
   _SstaXttrea16 |   -.001234   .0004795    -2.57   0.013    -.0021991   -.0002689
   _SstaXttrea18 |   .0019884   .0001033    19.25   0.000     .0017805    .0021963
   _SstaXttrea19 |  -.0082778   .0003445   -24.03   0.000    -.0089711   -.0075844
   _SstaXttrea20 |   .0008072   .0001741     4.64   0.000     .0004568    .0011577
   _SstaXttrea21 |   .0007591   .0000702    10.82   0.000     .0006178    .0009003
   _SstaXttrea22 |   .0003575   .0001524     2.35   0.023     .0000508    .0006643
   _SstaXttrea23 |  -.0003479   .0007056    -0.49   0.624    -.0017681    .0010724
   _SstaXttrea24 |  -.0004019   .0001504    -2.67   0.010    -.0007047   -.0000991
   _SstaXttrea25 |  -.0001303   .0002066    -0.63   0.531    -.0005461    .0002855
   _SstaXttrea26 |   .0003574   .0000679     5.26   0.000     .0002208    .0004941
   _SstaXttrea27 |   .0008441   .0001275     6.62   0.000     .0005875    .0011008
   _SstaXttrea28 |  -.0063694   .0006808    -9.36   0.000    -.0077398    -.004999
   _SstaXttrea29 |   .0010272   .0000946    10.86   0.000     .0008368    .0012177
   _SstaXttrea31 |  -.0021119   .0002214    -9.54   0.000    -.0025577   -.0016662
   _SstaXttrea32 |   .0028726    .000573     5.01   0.000     .0017191    .0040261
   _SstaXttrea33 |  -.0040332   .0006922    -5.83   0.000    -.0054265   -.0026399
   _SstaXttrea34 |   .0009153   .0001641     5.58   0.000      .000585    .0012455
   _SstaXttrea35 |   .0100846   .0003693    27.31   0.000     .0093412     .010828
   _SstaXttrea36 |   .0005449   .0001249     4.36   0.000     .0002935    .0007962
   _SstaXttrea37 |   .0007068   .0001437     4.92   0.000     .0004176    .0009959
   _SstaXttrea38 |  -.1574903   .0320019    -4.92   0.000    -.2219068   -.0930739
   _SstaXttrea39 |   .0006902   .0000679    10.16   0.000     .0005535    .0008268
   _SstaXttrea40 |    .000372   .0002289     1.62   0.111    -.0000888    .0008329
   _SstaXttrea41 |   .0015002   .0001385    10.83   0.000     .0012213     .001779
   _SstaXttrea42 |   .0011893   .0000754    15.77   0.000     .0010375     .001341
   _SstaXttrea44 |   .0006337   .0006279     1.01   0.318    -.0006303    .0018977
   _SstaXttrea45 |  -.0323096   .0047126    -6.86   0.000    -.0417956   -.0228237
   _SstaXttrea46 |  -.0011929   .0002812    -4.24   0.000    -.0017589   -.0006269
   _SstaXttrea47 |   .0026879   .0010698     2.51   0.016     .0005345    .0048413
   _SstaXttrea48 |   .0013047   .0002964     4.40   0.000     .0007081    .0019014
   _SstaXttrea49 |   .0029103   .0002409    12.08   0.000     .0024254    .0033952
   _SstaXttrea51 |  -.0009642   .0001012    -9.52   0.000     -.001168   -.0007604
   _SstaXttrea53 |  -.0001932   .0001155    -1.67   0.101    -.0004257    .0000394
   _SstaXttrea54 |   -.004266   .0001891   -22.56   0.000    -.0046465   -.0038854
   _SstaXttrea55 |   .0017096    .000103    16.60   0.000     .0015023    .0019169
    _SstaXttreb1 |   .0000212   5.99e-06     3.55   0.001     9.19e-06    .0000333
    _SstaXttreb2 |   -.000055    .000012    -4.59   0.000    -.0000791   -.0000308
    _SstaXttreb4 |  -.0002776   .0000237   -11.72   0.000    -.0003253   -.0002299
    _SstaXttreb5 |   .0000558   8.39e-06     6.65   0.000     .0000389    .0000727
    _SstaXttreb6 |  -.0000253   4.57e-06    -5.54   0.000    -.0000345   -.0000161
    _SstaXttreb8 |   -.000041   5.24e-06    -7.82   0.000    -.0000515   -.0000304
    _SstaXttreb9 |   -.000038   .0000227    -1.67   0.101    -.0000837    7.70e-06
   _SstaXttreb10 |  -.0000308   .0000214    -1.44   0.156    -.0000738    .0000122
   _SstaXttreb12 |  -.0000209   6.39e-06    -3.28   0.002    -.0000338   -8.08e-06
   _SstaXttreb13 |   .0000508   9.50e-06     5.34   0.000     .0000316    .0000699
   _SstaXttreb15 |  -.0001778   .0000149   -11.91   0.000    -.0002078   -.0001477
   _SstaXttreb16 |   .0000194   .0000138     1.41   0.166    -8.36e-06    .0000471
   _SstaXttreb18 |  -.0000733   3.35e-06   -21.90   0.000      -.00008   -.0000666
   _SstaXttreb19 |   .0002312   7.68e-06    30.12   0.000     .0002157    .0002466
   _SstaXttreb20 |   -.000028   5.45e-06    -5.13   0.000    -.0000389    -.000017
   _SstaXttreb21 |  -.0000431   2.51e-06   -17.22   0.000    -.0000482   -.0000381
   _SstaXttreb22 |  -9.74e-06   4.53e-06    -2.15   0.037    -.0000189   -6.16e-07
   _SstaXttreb23 |  -3.93e-06   .0000177    -0.22   0.826    -.0000396    .0000318
   _SstaXttreb24 |    .000012   4.45e-06     2.70   0.010     3.06e-06     .000021
   _SstaXttreb25 |  -7.95e-07   6.55e-06    -0.12   0.904     -.000014    .0000124
   _SstaXttreb26 |  -7.30e-06   2.90e-06    -2.51   0.015    -.0000131   -1.46e-06
   _SstaXttreb27 |  -.0000307   6.28e-06    -4.90   0.000    -.0000434   -.0000181
   _SstaXttreb28 |   .0001514   .0000207     7.33   0.000     .0001098    .0001929
   _SstaXttreb29 |  -.0000349   3.40e-06   -10.26   0.000    -.0000417   -.0000281
   _SstaXttreb31 |   .0000473   5.71e-06     8.28   0.000     .0000358    .0000588
   _SstaXttreb32 |  -.0000737   .0000143    -5.15   0.000    -.0001025   -.0000449
   _SstaXttreb33 |   .0001069   .0000169     6.33   0.000     .0000729    .0001409
   _SstaXttreb34 |  -.0000313   4.92e-06    -6.35   0.000    -.0000412   -.0000214
   _SstaXttreb35 |  -.0002436   9.37e-06   -25.98   0.000    -.0002625   -.0002247
   _SstaXttreb36 |  -.0000149   3.73e-06    -3.99   0.000    -.0000224   -7.37e-06
   _SstaXttreb37 |  -.0000256   3.90e-06    -6.56   0.000    -.0000334   -.0000177
   _SstaXttreb38 |   .0030516   .0005947     5.13   0.000     .0018546    .0042486
   _SstaXttreb39 |  -.0000231   2.80e-06    -8.26   0.000    -.0000288   -.0000175
   _SstaXttreb40 |   .0000149   5.98e-06     2.49   0.017     2.84e-06    .0000269
   _SstaXttreb41 |  -.0000413   4.95e-06    -8.33   0.000    -.0000512   -.0000313
   _SstaXttreb42 |  -.0000412   2.21e-06   -18.62   0.000    -.0000457   -.0000368
   _SstaXttreb44 |  -.0000189   .0000152    -1.24   0.220    -.0000494    .0000117
   _SstaXttreb45 |   .0022345   .0003338     6.69   0.000     .0015626    .0029065
   _SstaXttreb46 |   .0000295   6.83e-06     4.33   0.000     .0000158    .0000433
   _SstaXttreb47 |  -.0000644   .0000314    -2.05   0.046    -.0001275   -1.22e-06
   _SstaXttreb48 |  -.0000448   7.07e-06    -6.34   0.000     -.000059   -.0000306
   _SstaXttreb49 |  -.0000961   6.60e-06   -14.56   0.000    -.0001094   -.0000829
   _SstaXttreb51 |   .0000162   2.96e-06     5.48   0.000     .0000103    .0000222
   _SstaXttreb53 |   .0000122   4.24e-06     2.88   0.006     3.69e-06    .0000208
   _SstaXttreb54 |     .00011   4.52e-06    24.32   0.000     .0001009    .0001191
   _SstaXttreb55 |   -.000061   4.29e-06   -14.21   0.000    -.0000697   -.0000524
   _TgroXttren_1 |   .0028941   .0062319     0.46   0.645      -.00965    .0154383
   _TgroXttren_2 |   .0091784   .0052527     1.75   0.087    -.0013948    .0197517
   _TgroXttren_3 |    .009483   .0048965     1.94   0.059    -.0003732    .0193392
   _TgroXttren_4 |    .018035   .0073285     2.46   0.018     .0032836    .0327865
   _TgroXttren_5 |   .0035845   .0023826     1.50   0.139    -.0012114    .0083804
   _TgroXttren_7 |   .0137258   .0033727     4.07   0.000     .0069369    .0205148
   _TgroXttren_8 |   .0097185   .0035924     2.71   0.010     .0024875    .0169495
   _TgroXttrena1 |  -.0009941   .0007663    -1.30   0.201    -.0025365    .0005484
   _TgroXttrena2 |  -.0009338   .0005763    -1.62   0.112    -.0020939    .0002262
   _TgroXttrena3 |  -.0010838   .0003971    -2.73   0.009     -.001883   -.0002845
   _TgroXttrena4 |  -.0016924   .0006743    -2.51   0.016    -.0030496   -.0003352
   _TgroXttrena5 |  -.0007427   .0002801    -2.65   0.011    -.0013064    -.000179
   _TgroXttrena7 |  -.0009953   .0002887    -3.45   0.001    -.0015765   -.0004141
   _TgroXttrena8 |  -.0003033   .0003587    -0.85   0.402    -.0010253    .0004187
   _TgroXttrenb1 |   .0000376   .0000247     1.52   0.135    -.0000122    .0000873
   _TgroXttrenb2 |   .0000286   .0000184     1.55   0.128    -8.51e-06    .0000657
   _TgroXttrenb3 |   .0000463   .0000114     4.06   0.000     .0000234    .0000692
   _TgroXttrenb4 |   .0000523   .0000195     2.68   0.010      .000013    .0000916
   _TgroXttrenb5 |   .0000263   9.14e-06     2.88   0.006     7.89e-06    .0000447
   _TgroXttrenb7 |   .0000284   8.48e-06     3.35   0.002     .0000113    .0000454
   _TgroXttrenb8 |   7.47e-07   .0000103     0.07   0.942    -.0000199    .0000214
           _cons |   .2836585   .0290162     9.78   0.000     .2252518    .3420652
----------------------------------------------------------------------------------

. estimates store empd ;

. quietly reg empdhi $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdhi ;

. quietly reg empdlg $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdlg ;

. * note group health coverage and pension are conditional on being asked the question ;
. quietly reg inclughr $controls [pw=wtsupp], cluster(statefip) ;

. estimates store inclughr ;

. quietly reg pensionr $controls [pw=wtsupp], cluster(statefip) ;

. estimates store pensionr ;

. quietly reg ph $controls [pw=wtsupp], cluster(statefip) ;

. estimates store ph ;

. quietly reg lrhw $controls [pw=wtsupp] if hwagesamp==1, cluster(statefip) ;

. estimates store lrhw ;

. ****** ESTIMATES WITH PRO TESTING DUMMY ONLY ******* ;
. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) se(%7.3f) ;

----------------------------------------------------------------
    Variable |  empd     empdhi    empdlg      ph       lrhw    
-------------+--------------------------------------------------
  _Pgroup8_1 |  -0.287     0.145    -0.288    -0.053    -0.346  
             |   0.035     0.021     0.290     0.024     0.029  
  _Pgroup8_2 |  -0.153     0.074     0.703    -0.004    -0.154  
             |   0.019     0.022     0.310     0.017     0.026  
  _Pgroup8_3 |  -0.436     0.005    -0.075    -0.138    -0.616  
             |   0.043     0.021     0.420     0.016     0.030  
  _Pgroup8_4 |  -0.213    -0.077     0.660    -0.016    -0.302  
             |   0.028     0.018     0.332     0.018     0.025  
  _Pgroup8_5 |  -0.035     0.130     0.103    -0.010    -0.092  
             |   0.006     0.017     0.160     0.013     0.019  
  _Pgroup8_7 |  -0.286    -0.046    -0.109    -0.191    -0.542  
             |   0.013     0.013     0.155     0.010     0.009  
  _Pgroup8_8 |  -0.178    -0.177     0.073    -0.118    -0.339  
             |   0.010     0.011     0.122     0.009     0.011  
 _PgroXpro_1 |   0.024    -0.010     0.011     0.063     0.073  
             |   0.025     0.026     0.018     0.025     0.033  
 _PgroXpro_2 |   0.019    -0.023     0.084    -0.015     0.037  
             |   0.012     0.025     0.016     0.019     0.027  
 _PgroXpro_3 |   0.005     0.046    -0.078    -0.042     0.044  
             |   0.013     0.015     0.025     0.027     0.021  
 _PgroXpro_4 |  -0.030     0.008    -0.033     0.034     0.063  
             |   0.019     0.019     0.018     0.016     0.045  
 _PgroXpro_5 |   0.011     0.025    -0.016    -0.002     0.014  
             |   0.005     0.018     0.012     0.010     0.015  
 _PgroXpro_7 |  -0.017     0.009    -0.009    -0.011    -0.023  
             |   0.011     0.011     0.012     0.022     0.027  
 _PgroXpro_8 |  -0.019    -0.005    -0.009    -0.013    -0.011  
             |   0.008     0.018     0.010     0.004     0.019  
_PgroXprod~1 |   0.013     0.054     0.010     0.005    -0.016  
             |   0.016     0.016     0.009     0.012     0.021  
_PgroXprod~2 |   0.015     0.043    -0.014     0.042    -0.026  
             |   0.004     0.018     0.004     0.014     0.023  
_PgroXprod~3 |   0.001     0.047     0.058     0.046    -0.032  
             |   0.007     0.009     0.013     0.025     0.011  
_PgroXprod~4 |   0.001     0.045     0.037    -0.002    -0.049  
             |   0.010     0.010     0.008     0.007     0.028  
_PgroXprod~5 |   0.003     0.011     0.030     0.003    -0.009  
             |   0.004     0.012     0.005     0.007     0.012  
_PgroXprod~7 |   0.025     0.029     0.014    -0.012    -0.027  
             |   0.010     0.009     0.006     0.015     0.021  
_PgroXprod~8 |   0.012     0.017     0.013    -0.015    -0.001  
             |   0.007     0.015     0.009     0.002     0.016  
         pro |   0.007    -0.001     0.005     0.017    -0.012  
             |   0.004     0.011     0.014     0.008     0.022  
       prodt |  -0.017    -0.020     0.011     0.005     0.021  
             |   0.003     0.012     0.015     0.007     0.017  
     dti9799 |   0.004    -0.014     0.011    -0.008    -0.066  
             |   0.003     0.005     0.010     0.010     0.020  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |    empd        empdhi       empdlg         ph          lrhw     
-------------+-----------------------------------------------------------------
  _Pgroup8_1 |  -0.287***     0.145***    -0.288       -0.053*      -0.346***  
  _Pgroup8_2 |  -0.153***     0.074**      0.703*      -0.004       -0.154***  
  _Pgroup8_3 |  -0.436***     0.005       -0.075       -0.138***    -0.616***  
  _Pgroup8_4 |  -0.213***    -0.077***     0.660       -0.016       -0.302***  
  _Pgroup8_5 |  -0.035***     0.130***     0.103       -0.010       -0.092***  
  _Pgroup8_7 |  -0.286***    -0.046***    -0.109       -0.191***    -0.542***  
  _Pgroup8_8 |  -0.178***    -0.177***     0.073       -0.118***    -0.339***  
 _PgroXpro_1 |   0.024       -0.010        0.011        0.063*       0.073*    
 _PgroXpro_2 |   0.019       -0.023        0.084***    -0.015        0.037     
 _PgroXpro_3 |   0.005        0.046**     -0.078**     -0.042        0.044*    
 _PgroXpro_4 |  -0.030        0.008       -0.033        0.034*       0.063     
 _PgroXpro_5 |   0.011*       0.025       -0.016       -0.002        0.014     
 _PgroXpro_7 |  -0.017        0.009       -0.009       -0.011       -0.023     
 _PgroXpro_8 |  -0.019*      -0.005       -0.009       -0.013**     -0.011     
_PgroXprod~1 |   0.013        0.054**      0.010        0.005       -0.016     
_PgroXprod~2 |   0.015**      0.043*      -0.014***     0.042**     -0.026     
_PgroXprod~3 |   0.001        0.047***     0.058***     0.046       -0.032**   
_PgroXprod~4 |   0.001        0.045***     0.037***    -0.002       -0.049     
_PgroXprod~5 |   0.003        0.011        0.030***     0.003       -0.009     
_PgroXprod~7 |   0.025*       0.029**      0.014*      -0.012       -0.027     
_PgroXprod~8 |   0.012        0.017        0.013       -0.015***    -0.001     
         pro |   0.007*      -0.001        0.005        0.017*      -0.012     
       prodt |  -0.017***    -0.020        0.011        0.005        0.021     
     dti9799 |   0.004       -0.014**      0.011       -0.008       -0.066**   
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. macro drop all ;

. estimates clear ;

. global controls _P* _A* pro anti prodt antidt dti9799 age age2
>   eg* minwage unemploymentrate incarcr
>   tt* _D* _S* _T* ;

. unab avars: _A* ;

.     global outvars `pvars' `avars' pro anti ;

.   summ $outvars year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  _Pgroup8_1 |    833,161    .0342359    .1818346          0          1
  _Pgroup8_2 |    833,161    .0206647    .1422592          0          1
  _Pgroup8_3 |    833,161    .0451749    .2076878          0          1
  _Pgroup8_4 |    833,161    .0289308    .1676121          0          1
  _Pgroup8_5 |    833,161     .185844     .388981          0          1
-------------+---------------------------------------------------------
  _Pgroup8_7 |    833,161    .2110204    .4080331          0          1
  _Pgroup8_8 |    833,161    .2335011    .4230586          0          1
 _PgroXpro_1 |    833,161    .0007898    .0280916          0          1
 _PgroXpro_2 |    833,161    .0005581    .0236179          0          1
 _PgroXpro_3 |    833,161    .0009578    .0309335          0          1
-------------+---------------------------------------------------------
 _PgroXpro_4 |    833,161    .0008918    .0298495          0          1
 _PgroXpro_5 |    833,161     .003009     .054772          0          1
 _PgroXpro_7 |    833,161    .0031447     .055989          0          1
 _PgroXpro_8 |    833,161    .0043257    .0656276          0          1
_PgroXprod~1 |    833,161    .0006498     .038701  -1.404464   1.792951
-------------+---------------------------------------------------------
_PgroXprod~2 |    833,161    .0004754    .0318631  -1.775612   1.792951
_PgroXprod~3 |    833,161    .0008392    .0417155  -1.393903   1.792951
_PgroXprod~4 |    833,161    .0008015    .0406808  -1.393903   1.792951
_PgroXprod~5 |    833,161      .00138    .0684119  -1.775612   1.792951
_PgroXprod~7 |    833,161    .0016013    .0698205  -1.775612   1.792951
-------------+---------------------------------------------------------
_PgroXprod~8 |    833,161    .0015828    .0795341  -1.775612   1.792951
_AgroXanti_1 |    833,161    .0001404    .0118495          0          1
_AgroXanti_2 |    833,161    .0001164    .0107894          0          1
_AgroXanti_3 |    833,161    .0001764    .0132818          0          1
_AgroXanti_4 |    833,161    .0001608     .012681          0          1
-------------+---------------------------------------------------------
_AgroXanti_5 |    833,161     .001115    .0333735          0          1
_AgroXanti_7 |    833,161    .0011354    .0336771          0          1
_AgroXanti_8 |    833,161     .001948    .0440932          0          1
_AgroXan~d_1 |    833,161    .0000583    .0084249  -.4388413   1.404993
_AgroXan~d_2 |    833,161    .0000428    .0074891  -.4388413   1.404993
-------------+---------------------------------------------------------
_AgroXan~d_3 |    833,161    .0000765    .0102034  -.4388413   1.404993
_AgroXan~d_4 |    833,161    .0000977    .0110102  -.4388413   1.404993
_AgroXan~d_5 |    833,161    .0004368      .02222  -.4388413   1.404993
_AgroXan~d_7 |    833,161    .0003452    .0195411  -.4388413   1.404993
_AgroXan~d_8 |    833,161    .0008282    .0295603  -.4388413   1.404993
-------------+---------------------------------------------------------
         pro |    833,161    .0178489    .1324021          0          1
        anti |    833,161    .0066398    .0812139          0          1
        year |    833,161    1990.736    5.598587       1980       2000

. summ empd empdhi inclughr pensionr lrhw if pro==0 & anti==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |    812,758    .7674425    .4224627          0          1
      empdhi |    623,745    .2931182    .4551925          0          1
    inclughr |    686,160    .5858051    .4925828          0          1
    pensionr |    686,160    .5606914    .4963032          0          1
        lrhw |    649,809    2.509132    .7508289  -8.075817   10.49622

.   reg empd $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 1,654,202,759)
note: _Sstatefip_45 omitted because of collinearity
note: _SstaXgro_38_1 omitted because of collinearity
note: _SstaXgro_38_4 omitted because of collinearity

Linear regression                               Number of obs     =    831,483
                                                F(45, 46)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0914
                                                Root MSE          =     .40417

                                  (Std. Err. adjusted for 47 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
            empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
      _Pgroup8_1 |   -.287335   .0346882    -8.28   0.000    -.3571588   -.2175112
      _Pgroup8_2 |  -.1536446   .0186517    -8.24   0.000    -.1911885   -.1161006
      _Pgroup8_3 |  -.4365785   .0432253   -10.10   0.000    -.5235865   -.3495706
      _Pgroup8_4 |  -.2146553   .0284341    -7.55   0.000    -.2718902   -.1574204
      _Pgroup8_5 |  -.0344767   .0065005    -5.30   0.000    -.0475615   -.0213919
      _Pgroup8_7 |  -.2859664   .0129513   -22.08   0.000     -.312036   -.2598967
      _Pgroup8_8 |  -.1771213   .0103061   -17.19   0.000    -.1978663   -.1563763
     _PgroXpro_1 |   .0223462   .0252756     0.88   0.381    -.0285309    .0732233
     _PgroXpro_2 |   .0185876   .0116805     1.59   0.118     -.004924    .0420992
     _PgroXpro_3 |   .0059133   .0135246     0.44   0.664    -.0213103    .0331369
     _PgroXpro_4 |   -.030102   .0190598    -1.58   0.121    -.0684674    .0082634
     _PgroXpro_5 |   .0109563   .0047857     2.29   0.027     .0013232    .0205894
     _PgroXpro_7 |  -.0167235   .0110123    -1.52   0.136    -.0388901    .0054431
     _PgroXpro_8 |  -.0187855    .008318    -2.26   0.029    -.0355287   -.0020423
   _PgroXprodt_1 |   .0126807   .0161474     0.79   0.436    -.0198224    .0451837
   _PgroXprodt_2 |   .0147835   .0044151     3.35   0.002     .0058964    .0236706
   _PgroXprodt_3 |   .0005429   .0066718     0.08   0.935    -.0128867    .0139726
   _PgroXprodt_4 |   .0009565   .0098064     0.10   0.923    -.0187828    .0206959
   _PgroXprodt_5 |   .0028639   .0039701     0.72   0.474    -.0051275    .0108554
   _PgroXprodt_7 |   .0246706   .0103032     2.39   0.021     .0039313    .0454099
   _PgroXprodt_8 |   .0124563   .0067234     1.85   0.070    -.0010772    .0259897
    _AgroXanti_1 |   -.096815    .104272    -0.93   0.358    -.3067036    .1130736
    _AgroXanti_2 |  -.0348501    .032881    -1.06   0.295    -.1010361    .0313358
    _AgroXanti_3 |   .0699108   .0314124     2.23   0.031      .006681    .1331406
    _AgroXanti_4 |   .0682863   .0672505     1.02   0.315     -.067082    .2036546
    _AgroXanti_5 |  -.0157952   .0241628    -0.65   0.517    -.0644325     .032842
    _AgroXanti_7 |   .0155987   .0098388     1.59   0.120    -.0042058    .0354032
    _AgroXanti_8 |   .0109739    .025334     0.43   0.667    -.0400208    .0619686
   _AgroXantid_1 |  -.0631532   .1016476    -0.62   0.537    -.2677591    .1414528
   _AgroXantid_2 |    .012737    .041911     0.30   0.763    -.0716254    .0970995
   _AgroXantid_3 |  -.0090073   .0326394    -0.28   0.784    -.0747071    .0566925
   _AgroXantid_4 |  -.0985116   .0387256    -2.54   0.014    -.1764622    -.020561
   _AgroXantid_5 |    .035541   .0235478     1.51   0.138    -.0118582    .0829403
   _AgroXantid_7 |  -.0225305    .015698    -1.44   0.158     -.054129    .0090679
   _AgroXantid_8 |   .0196027     .01103     1.78   0.082    -.0025995    .0418048
             pro |   .0073098    .003636     2.01   0.050    -9.05e-06    .0146287
            anti |   .0178922   .0231774     0.77   0.444    -.0287615     .064546
           prodt |  -.0170988   .0031466    -5.43   0.000    -.0234326   -.0107651
          antidt |   .0293548   .0169931     1.73   0.091    -.0048506    .0635602
         dti9799 |   .0032924   .0026385     1.25   0.218    -.0020185    .0086034
             age |   .0373863   .0012188    30.67   0.000     .0349329    .0398397
            age2 |  -.0004692   .0000142   -33.12   0.000    -.0004977   -.0004407
           eg200 |  -.0011392   .0076456    -0.15   0.882    -.0165291    .0142507
           eg300 |  -.0294506   .0198203    -1.49   0.144    -.0693468    .0104456
           eg400 |   -.143913    .030944    -4.65   0.000    -.2062001    -.081626
           eg500 |  -.0255413   .0245717    -1.04   0.304    -.0750015     .023919
           eg900 |   .0282283   .0537894     0.52   0.602    -.0800442    .1365008
         minwage |   .0013043   .0037516     0.35   0.730    -.0062474     .008856
unemploymentrate |  -.0120406   .0008743   -13.77   0.000    -.0138005   -.0102807
         incarcr |  -.7451095   1.854787    -0.40   0.690    -4.478602    2.988383
          ttrend |   .0030766   .0017393     1.77   0.084    -.0004245    .0065776
         ttrend2 |  -.0004777   .0001826    -2.62   0.012    -.0008452   -.0001102
         ttrend3 |   .0000151   5.12e-06     2.94   0.005     4.78e-06    .0000254
   _DgroXdti97_1 |  -.0257762     .04041    -0.64   0.527    -.1071172    .0555648
   _DgroXdti97_2 |  -.0232437    .010571    -2.20   0.033     -.044522   -.0019653
   _DgroXdti97_3 |  -.0617769   .0449237    -1.38   0.176    -.1522037    .0286498
   _DgroXdti97_4 |  -.0009797   .0215111    -0.05   0.964    -.0442793      .04232
   _DgroXdti97_5 |  -.0015775   .0043104    -0.37   0.716    -.0102539    .0070988
   _DgroXdti97_7 |  -.0007326   .0074208    -0.10   0.922    -.0156698    .0142047
   _DgroXdti97_8 |  -.0062226   .0101201    -0.61   0.542    -.0265934    .0141482
    _Sstatefip_1 |   .0138101   .0051835     2.66   0.011     .0033762    .0242439
    _Sstatefip_2 |    .155425   .0341087     4.56   0.000     .0867679    .2240822
    _Sstatefip_4 |   .3872693   .0328389    11.79   0.000     .3211679    .4533706
    _Sstatefip_5 |  -.0529871   .0172973    -3.06   0.004    -.0878047   -.0181695
    _Sstatefip_6 |   .0353433   .0042907     8.24   0.000     .0267065    .0439801
    _Sstatefip_8 |   .0402765   .0056663     7.11   0.000     .0288709    .0516821
    _Sstatefip_9 |  -.1180071    .037735    -3.13   0.003    -.1939638   -.0420505
   _Sstatefip_10 |  -.0323257   .0404864    -0.80   0.429    -.1138206    .0491692
   _Sstatefip_12 |  -.0159148   .0092792    -1.72   0.093    -.0345929    .0027634
   _Sstatefip_13 |    .010592   .0074953     1.41   0.164    -.0044952    .0256792
   _Sstatefip_15 |   .3436441   .0252114    13.63   0.000     .2928962     .394392
   _Sstatefip_16 |  -.0998656   .0225176    -4.43   0.000    -.1451912   -.0545399
   _Sstatefip_18 |   .0313877   .0028401    11.05   0.000     .0256709    .0371045
   _Sstatefip_19 |  -.3139041   .0171444   -18.31   0.000     -.348414   -.2793943
   _Sstatefip_20 |  -.0167312   .0035209    -4.75   0.000    -.0238184    -.009644
   _Sstatefip_21 |  -.0453824   .0020807   -21.81   0.000    -.0495707   -.0411941
   _Sstatefip_22 |   .0404218   .0064299     6.29   0.000      .027479    .0533646
   _Sstatefip_23 |  -.1087912   .0342905    -3.17   0.003    -.1778143    -.039768
   _Sstatefip_24 |   .0072821   .0072248     1.01   0.319    -.0072606    .0218248
   _Sstatefip_25 |  -.0332112    .003678    -9.03   0.000    -.0406146   -.0258077
   _Sstatefip_26 |   .0318641   .0038818     8.21   0.000     .0240505    .0396778
   _Sstatefip_27 |   .0151972    .003796     4.00   0.000     .0075563    .0228381
   _Sstatefip_28 |  -.3131675   .0254755   -12.29   0.000    -.3644469    -.261888
   _Sstatefip_29 |   .0041037   .0014356     2.86   0.006     .0012141    .0069934
   _Sstatefip_31 |  -.1550088   .0102048   -15.19   0.000    -.1755499   -.1344677
   _Sstatefip_32 |   .1918061   .0352406     5.44   0.000     .1208704    .2627418
   _Sstatefip_33 |  -.1445888   .0371922    -3.89   0.000    -.2194528   -.0697247
   _Sstatefip_34 |  -.0010766   .0044956    -0.24   0.812    -.0101258    .0079727
   _Sstatefip_35 |   .5440584   .0236981    22.96   0.000     .4963567    .5917601
   _Sstatefip_36 |  -.0010639   .0047712    -0.22   0.825    -.0106678      .00854
   _Sstatefip_37 |   .0019196   .0089536     0.21   0.831     -.016103    .0199422
   _Sstatefip_38 |  -15.37606   3.370748    -4.56   0.000    -22.16102   -8.591093
   _Sstatefip_39 |   .0179271   .0019823     9.04   0.000     .0139369    .0219173
   _Sstatefip_40 |   .1305352   .0719455     1.81   0.076    -.0142837    .2753541
   _Sstatefip_41 |   .0244702   .0059313     4.13   0.000      .012531    .0364093
   _Sstatefip_42 |  -.0213785   .0026997    -7.92   0.000    -.0268127   -.0159444
   _Sstatefip_44 |   .0032095   .0335503     0.10   0.924    -.0643238    .0707428
   _Sstatefip_45 |          0  (omitted)
   _Sstatefip_46 |  -.0777493   .0144803    -5.37   0.000    -.1068967   -.0486018
   _Sstatefip_47 |   .1282958   .0396273     3.24   0.002     .0485302    .2080614
   _Sstatefip_48 |   .0370349   .0081861     4.52   0.000     .0205571    .0535127
   _Sstatefip_49 |  -.0034771   .0142816    -0.24   0.809    -.0322244    .0252702
   _Sstatefip_51 |  -.0285162   .0084553    -3.37   0.002    -.0455358   -.0114965
   _Sstatefip_53 |   .0099662   .0059101     1.69   0.099    -.0019303    .0218627
   _Sstatefip_54 |  -.2300022   .0131382   -17.51   0.000     -.256448   -.2035564
   _Sstatefip_55 |  -.0182269   .0018868    -9.66   0.000    -.0220248   -.0144291
   _SstaXgro_1_1 |   .0865331   .0174686     4.95   0.000     .0513706    .1216957
   _SstaXgro_1_2 |   .0648649   .0060719    10.68   0.000     .0526428    .0770871
   _SstaXgro_1_3 |   .1094062   .0185083     5.91   0.000      .072151    .1466614
   _SstaXgro_1_4 |   .0483255   .0115042     4.20   0.000     .0251686    .0714823
   _SstaXgro_1_5 |  -.0095616   .0028108    -3.40   0.001    -.0152195   -.0039036
   _SstaXgro_1_7 |  -.0832346   .0063018   -13.21   0.000    -.0959194   -.0705498
   _SstaXgro_1_8 |  -.0130886   .0064143    -2.04   0.047        -.026   -.0001773
   _SstaXgro_2_1 |   .2205087   .0997817     2.21   0.032     .0196586    .4213588
   _SstaXgro_2_2 |   .0679717   .0251549     2.70   0.010     .0173376    .1186057
   _SstaXgro_2_3 |   .0243615   .1101516     0.22   0.826    -.1973621    .2460852
   _SstaXgro_2_4 |   .0110987   .0533531     0.21   0.836    -.0962954    .1184929
   _SstaXgro_2_5 |  -.0335744    .010758    -3.12   0.003    -.0552292   -.0119197
   _SstaXgro_2_7 |  -.0216912    .018458    -1.18   0.246    -.0588453    .0154629
   _SstaXgro_2_8 |  -.0125602   .0252204    -0.50   0.621    -.0633262    .0382058
   _SstaXgro_4_1 |   .0181665   .0409105     0.44   0.659    -.0641822    .1005151
   _SstaXgro_4_2 |   .0691561   .0128839     5.37   0.000     .0432221    .0950901
   _SstaXgro_4_3 |   .0988555   .0430622     2.30   0.026     .0121757    .1855352
   _SstaXgro_4_4 |   .1029612    .022351     4.61   0.000     .0579709    .1479515
   _SstaXgro_4_5 |  -.0088802   .0049971    -1.78   0.082    -.0189388    .0011785
   _SstaXgro_4_7 |   .0145801   .0079079     1.84   0.072    -.0013377     .030498
   _SstaXgro_4_8 |  -.0206266   .0107561    -1.92   0.061    -.0422775    .0010243
   _SstaXgro_5_1 |   .1795765   .0313563     5.73   0.000     .1164596    .2426935
   _SstaXgro_5_2 |   .1341439   .0096024    13.97   0.000     .1148153    .1534725
   _SstaXgro_5_3 |    .240016   .0352084     6.82   0.000     .1691452    .3108868
   _SstaXgro_5_4 |    .072646   .0165985     4.38   0.000     .0392349    .1060571
   _SstaXgro_5_5 |   .0047557   .0034949     1.36   0.180    -.0022791    .0117905
   _SstaXgro_5_7 |  -.0032099   .0061643    -0.52   0.605     -.015618    .0091982
   _SstaXgro_5_8 |   .0133048   .0076284     1.74   0.088    -.0020504      .02866
   _SstaXgro_6_1 |   .0414035   .0433421     0.96   0.344    -.0458396    .1286467
   _SstaXgro_6_2 |   .0671079   .0115306     5.82   0.000     .0438979    .0903178
   _SstaXgro_6_3 |   .0030795   .0483137     0.06   0.949     -.094171      .10033
   _SstaXgro_6_4 |   .0332413   .0230665     1.44   0.156    -.0131891    .0796717
   _SstaXgro_6_5 |  -.0361714   .0046114    -7.84   0.000    -.0454537   -.0268891
   _SstaXgro_6_7 |  -.0403038   .0079171    -5.09   0.000      -.05624   -.0243675
   _SstaXgro_6_8 |   -.010592   .0108318    -0.98   0.333    -.0323954    .0112113
   _SstaXgro_8_1 |   .0251831    .077729     0.32   0.747    -.1312773    .1816435
   _SstaXgro_8_2 |   .0600379   .0206546     2.91   0.006     .0184624    .1016135
   _SstaXgro_8_3 |   .0628512   .0861521     0.73   0.469     -.110564    .2362664
   _SstaXgro_8_4 |    .050028   .0412399     1.21   0.231    -.0329836    .1330396
   _SstaXgro_8_5 |   .0001969   .0082365     0.02   0.981    -.0163824    .0167763
   _SstaXgro_8_7 |   .0294208   .0142057     2.07   0.044     .0008262    .0580153
   _SstaXgro_8_8 |  -.0139485    .019446    -0.72   0.477    -.0530912    .0251942
   _SstaXgro_9_1 |   .1984565   .0200302     9.91   0.000     .1581378    .2387751
   _SstaXgro_9_2 |   .0599397   .0084809     7.07   0.000     .0428684    .0770109
   _SstaXgro_9_3 |   .1608769    .009942    16.18   0.000     .1408647     .180889
   _SstaXgro_9_4 |    .063405   .0208012     3.05   0.004     .0215343    .1052758
   _SstaXgro_9_5 |   .0120499   .0029467     4.09   0.000     .0061186    .0179812
   _SstaXgro_9_7 |    .049048   .0027839    17.62   0.000     .0434442    .0546518
   _SstaXgro_9_8 |    .005987   .0095719     0.63   0.535    -.0132802    .0252543
  _SstaXgro_10_1 |   .1685293   .0267556     6.30   0.000      .114673    .2223856
  _SstaXgro_10_2 |   .0969468   .0064984    14.92   0.000     .0838663    .1100273
  _SstaXgro_10_3 |   .1658622   .0285096     5.82   0.000     .1084754    .2232491
  _SstaXgro_10_4 |    .072822   .0143033     5.09   0.000     .0440311     .101613
  _SstaXgro_10_5 |   .0129032   .0032014     4.03   0.000     .0064592    .0193473
  _SstaXgro_10_7 |   .0276279   .0053919     5.12   0.000     .0167745    .0384813
  _SstaXgro_10_8 |    .003048   .0069408     0.44   0.663    -.0109231     .017019
  _SstaXgro_12_1 |   .1374792   .0893113     1.54   0.131     -.042295    .3172535
  _SstaXgro_12_2 |   .0402857   .0230333     1.75   0.087    -.0060781    .0866494
  _SstaXgro_12_3 |   .0115206   .0985899     0.12   0.907    -.1869306    .2099717
  _SstaXgro_12_4 |   .0759083   .0474998     1.60   0.117    -.0197037    .1715204
  _SstaXgro_12_5 |   .0145497   .0095447     1.52   0.134    -.0046629    .0337622
  _SstaXgro_12_7 |   .0256013   .0164446     1.56   0.126    -.0074999    .0587025
  _SstaXgro_12_8 |  -.0070445    .022502    -0.31   0.756    -.0523387    .0382497
  _SstaXgro_13_1 |   .1489298   .0257161     5.79   0.000     .0971659    .2006937
  _SstaXgro_13_2 |   .0983023   .0073427    13.39   0.000     .0835223    .1130824
  _SstaXgro_13_3 |   .1542734     .02809     5.49   0.000     .0977311    .2108157
  _SstaXgro_13_4 |   .0746185   .0141785     5.26   0.000     .0460786    .1031584
  _SstaXgro_13_5 |   .0126047   .0031354     4.02   0.000     .0062934     .018916
  _SstaXgro_13_7 |  -.0405403   .0065185    -6.22   0.000    -.0536614   -.0274192
  _SstaXgro_13_8 |  -.0395435   .0070847    -5.58   0.000    -.0538041   -.0252828
  _SstaXgro_15_1 |    .327981   .1266024     2.59   0.013     .0731436    .5828185
  _SstaXgro_15_2 |   .1577309   .0320912     4.92   0.000     .0931348    .2223271
  _SstaXgro_15_3 |  -.0868372   .1398386    -0.62   0.538    -.3683178    .1946434
  _SstaXgro_15_4 |  -.1860822   .0676937    -2.75   0.009    -.3223425   -.0498218
  _SstaXgro_15_5 |  -.0204665   .0135138    -1.51   0.137    -.0476684    .0067354
  _SstaXgro_15_7 |  -.0202635   .0233378    -0.87   0.390    -.0672402    .0267131
  _SstaXgro_15_8 |  -.0001062   .0318911    -0.00   0.997    -.0642997    .0640873
  _SstaXgro_16_1 |   -.410342   .1049158    -3.91   0.000    -.6215264   -.1991575
  _SstaXgro_16_2 |   .1876906   .0288784     6.50   0.000     .1295614    .2458198
  _SstaXgro_16_3 |  -.3585736   .1154576    -3.11   0.003    -.5909777   -.1261696
  _SstaXgro_16_4 |  -.2048931   .0564729    -3.63   0.001    -.3185672    -.091219
  _SstaXgro_16_5 |   .0011612   .0113373     0.10   0.919    -.0216596    .0239819
  _SstaXgro_16_7 |     .10458   .0193271     5.41   0.000     .0656766    .1434833
  _SstaXgro_16_8 |   -.015409   .0265042    -0.58   0.564    -.0687593    .0379413
  _SstaXgro_18_1 |  -.0013557   .0270312    -0.05   0.960    -.0557666    .0530552
  _SstaXgro_18_2 |  -.0276559   .0075617    -3.66   0.001    -.0428768    -.012435
  _SstaXgro_18_3 |   .1542143   .0330317     4.67   0.000     .0877248    .2207038
  _SstaXgro_18_4 |  -.0012056   .0153452    -0.08   0.938    -.0320938    .0296826
  _SstaXgro_18_5 |  -.0187992   .0034482    -5.45   0.000      -.02574   -.0118584
  _SstaXgro_18_7 |  -.0236551   .0058321    -4.06   0.000    -.0353946   -.0119156
  _SstaXgro_18_8 |   .0038445   .0080579     0.48   0.636    -.0123752    .0200642
  _SstaXgro_19_1 |   .1196939   .0175834     6.81   0.000     .0843004    .1550873
  _SstaXgro_19_2 |   .0452696   .0066844     6.77   0.000     .0318145    .0587247
  _SstaXgro_19_3 |   .0519927   .0173863     2.99   0.004      .016996    .0869895
  _SstaXgro_19_4 |  -.0500415   .0097078    -5.15   0.000    -.0695823   -.0305007
  _SstaXgro_19_5 |  -.0076327   .0026805    -2.85   0.007    -.0130283    -.002237
  _SstaXgro_19_7 |   .0417992   .0049375     8.47   0.000     .0318605    .0517379
  _SstaXgro_19_8 |   .0186608   .0055235     3.38   0.001     .0075425    .0297791
  _SstaXgro_20_1 |   .0690345   .0139482     4.95   0.000     .0409583    .0971107
  _SstaXgro_20_2 |   .0478131   .0042121    11.35   0.000     .0393346    .0562916
  _SstaXgro_20_3 |    .122146    .015231     8.02   0.000     .0914877    .1528044
  _SstaXgro_20_4 |  -.0700475   .0080385    -8.71   0.000    -.0862282   -.0538669
  _SstaXgro_20_5 |   .0025378   .0016772     1.51   0.137    -.0008382    .0059139
  _SstaXgro_20_7 |   .0038376   .0030596     1.25   0.216     -.002321    .0099962
  _SstaXgro_20_8 |  -.0389416   .0038271   -10.18   0.000    -.0466452    -.031238
  _SstaXgro_21_1 |   .0141667    .018651     0.76   0.451    -.0233757    .0517091
  _SstaXgro_21_2 |  -.0217624   .0066712    -3.26   0.002    -.0351909   -.0083339
  _SstaXgro_21_3 |   .0917938   .0212476     4.32   0.000     .0490246    .1345629
  _SstaXgro_21_4 |  -.0374639   .0101654    -3.69   0.001    -.0579258   -.0170021
  _SstaXgro_21_5 |   .0004883   .0020487     0.24   0.813    -.0036356    .0046121
  _SstaXgro_21_7 |  -.0300393   .0036432    -8.25   0.000    -.0373726    -.022706
  _SstaXgro_21_8 |   .0101294   .0044756     2.26   0.028     .0011206    .0191382
  _SstaXgro_22_1 |   .0759807   .0530818     1.43   0.159    -.0308675    .1828289
  _SstaXgro_22_2 |  -.0109026   .0134231    -0.81   0.421     -.037922    .0161168
  _SstaXgro_22_3 |  -.0477635   .0586068    -0.81   0.419    -.1657329    .0702058
  _SstaXgro_22_4 |   .0361031   .0285198     1.27   0.212    -.0213043    .0935106
  _SstaXgro_22_5 |   .0021341   .0056715     0.38   0.708    -.0092821    .0135502
  _SstaXgro_22_7 |  -.0606705   .0097781    -6.20   0.000    -.0803528   -.0409883
  _SstaXgro_22_8 |  -.0338958   .0134007    -2.53   0.015    -.0608701   -.0069216
  _SstaXgro_23_1 |   .3550873   .1030875     3.44   0.001     .1475829    .5625918
  _SstaXgro_23_2 |   .1248279   .0255818     4.88   0.000     .0733343    .1763214
  _SstaXgro_23_3 |    .085901   .1118831     0.77   0.447    -.1393081      .31111
  _SstaXgro_23_4 |   .3414718   .0547724     6.23   0.000     .2312207     .451723
  _SstaXgro_23_5 |  -.0628142   .0109675    -5.73   0.000    -.0848906   -.0407378
  _SstaXgro_23_7 |  -.0183997   .0189815    -0.97   0.337    -.0566074     .019808
  _SstaXgro_23_8 |  -.0018945   .0258917    -0.07   0.942    -.0540118    .0502228
  _SstaXgro_24_1 |   .0686949   .1043646     0.66   0.514    -.1413801    .2787699
  _SstaXgro_24_2 |   .0073577   .0285683     0.26   0.798    -.0501474    .0648627
  _SstaXgro_24_3 |   .0207254   .1162448     0.18   0.859    -.2132631     .254714
  _SstaXgro_24_4 |   .1093826   .0575691     1.90   0.064    -.0064979    .2252631
  _SstaXgro_24_5 |  -.0025583   .0111168    -0.23   0.819    -.0249352    .0198186
  _SstaXgro_24_7 |    .016793   .0187734     0.89   0.376     -.020996     .054582
  _SstaXgro_24_8 |  -.0142276   .0266751    -0.53   0.596    -.0679218    .0394666
  _SstaXgro_25_1 |   .1449957   .0354921     4.09   0.000     .0735537    .2164376
  _SstaXgro_25_2 |  -.0115511   .0092003    -1.26   0.216    -.0300703    .0069681
  _SstaXgro_25_3 |   .0312707   .0394897     0.79   0.433     -.048218    .1107594
  _SstaXgro_25_4 |   .0622531   .0189602     3.28   0.002     .0240882     .100418
  _SstaXgro_25_5 |  -.0165656   .0038077    -4.35   0.000      -.02423   -.0089012
  _SstaXgro_25_7 |   .0252864   .0067088     3.77   0.000     .0117824    .0387904
  _SstaXgro_25_8 |    .027884   .0090575     3.08   0.004     .0096523    .0461157
  _SstaXgro_26_1 |  -.0189681   .0005715   -33.19   0.000    -.0201185   -.0178176
  _SstaXgro_26_2 |    .023604   .0007814    30.21   0.000      .022031    .0251769
  _SstaXgro_26_3 |   .0096937   .0007589    12.77   0.000     .0081661    .0112213
  _SstaXgro_26_4 |  -.0391585   .0008324   -47.04   0.000    -.0408341   -.0374829
  _SstaXgro_26_5 |  -.0275497   .0004884   -56.40   0.000    -.0285329   -.0265666
  _SstaXgro_26_7 |  -.0459223   .0008799   -52.19   0.000    -.0476935   -.0441511
  _SstaXgro_26_8 |  -.0035221   .0003166   -11.13   0.000    -.0041593   -.0028849
  _SstaXgro_27_1 |   .1454363   .0271208     5.36   0.000     .0908449    .2000277
  _SstaXgro_27_2 |    .119176   .0153181     7.78   0.000     .0883423    .1500097
  _SstaXgro_27_3 |  -.1197385   .0153272    -7.81   0.000    -.1505905   -.0888865
  _SstaXgro_27_4 |  -.0579456   .0283482    -2.04   0.047    -.1150075   -.0008836
  _SstaXgro_27_5 |  -.0097978   .0032209    -3.04   0.004    -.0162812   -.0033145
  _SstaXgro_27_7 |   .0860618   .0029286    29.39   0.000     .0801669    .0919568
  _SstaXgro_27_8 |   .0422123   .0092912     4.54   0.000     .0235102    .0609145
  _SstaXgro_28_1 |   .1999434   .0238361     8.39   0.000     .1519638     .247923
  _SstaXgro_28_2 |    .130355   .0071276    18.29   0.000     .1160078    .1447023
  _SstaXgro_28_3 |   .1489081   .0277563     5.36   0.000     .0930376    .2047785
  _SstaXgro_28_4 |    .069351    .013248     5.23   0.000     .0426841    .0960178
  _SstaXgro_28_5 |  -.0006158   .0027768    -0.22   0.825    -.0062053    .0049737
  _SstaXgro_28_7 |  -.0143089   .0056656    -2.53   0.015    -.0257132   -.0029046
  _SstaXgro_28_8 |   .0210229   .0061617     3.41   0.001       .00862    .0334258
  _SstaXgro_29_1 |   .0799547   .0097677     8.19   0.000     .0602933     .099616
  _SstaXgro_29_2 |   .0487477   .0022303    21.86   0.000     .0442584     .053237
  _SstaXgro_29_3 |   .1117842   .0108314    10.32   0.000     .0899817    .1335868
  _SstaXgro_29_4 |   .0186641   .0051942     3.59   0.001     .0082087    .0291195
  _SstaXgro_29_5 |   .0091078   .0010038     9.07   0.000     .0070873    .0111283
  _SstaXgro_29_7 |   .0222833   .0017079    13.05   0.000     .0188455    .0257212
  _SstaXgro_29_8 |   .0270301   .0024342    11.10   0.000     .0221302    .0319299
  _SstaXgro_31_1 |   .0834062   .0412721     2.02   0.049     .0003297    .1664826
  _SstaXgro_31_2 |   .0641792   .0096694     6.64   0.000     .0447157    .0836428
  _SstaXgro_31_3 |   .0297141   .0450392     0.66   0.513    -.0609451    .1203733
  _SstaXgro_31_4 |   .0338041   .0223252     1.51   0.137    -.0111342    .0787423
  _SstaXgro_31_5 |   .0206158   .0045175     4.56   0.000     .0115225    .0297091
  _SstaXgro_31_7 |   .0694864   .0079166     8.78   0.000      .053551    .0854217
  _SstaXgro_31_8 |   .0240658   .0105628     2.28   0.027     .0028041    .0453276
  _SstaXgro_32_1 |   .1488028   .0616039     2.42   0.020     .0248005     .272805
  _SstaXgro_32_2 |   .0136097   .0152275     0.89   0.376    -.0170417     .044261
  _SstaXgro_32_3 |   .0668078   .0677385     0.99   0.329    -.0695427    .2031582
  _SstaXgro_32_4 |   .0111316   .0330189     0.34   0.738     -.055332    .0775952
  _SstaXgro_32_5 |  -.0272752   .0066405    -4.11   0.000    -.0406418   -.0139085
  _SstaXgro_32_7 |   .0070644   .0116203     0.61   0.546     -.016326    .0304549
  _SstaXgro_32_8 |  -.0291319   .0156146    -1.87   0.068    -.0605624    .0022986
  _SstaXgro_33_1 |   .2174996   .0583077     3.73   0.001     .1001323    .3348668
  _SstaXgro_33_2 |    .108399   .0131168     8.26   0.000     .0819962    .1348018
  _SstaXgro_33_3 |   .1068566   .0637728     1.68   0.101    -.0215114    .2352247
  _SstaXgro_33_4 |   .1175685   .0318292     3.69   0.001     .0534996    .1816374
  _SstaXgro_33_5 |  -.0001077   .0061998    -0.02   0.986    -.0125873    .0123719
  _SstaXgro_33_7 |   .0164171   .0109806     1.50   0.142    -.0056857    .0385199
  _SstaXgro_33_8 |    .005557   .0146718     0.38   0.707    -.0239757    .0350897
  _SstaXgro_34_1 |   .1063962   .0607859     1.75   0.087    -.0159595    .2287519
  _SstaXgro_34_2 |   .0131697   .0155618     0.85   0.402    -.0181545    .0444939
  _SstaXgro_34_3 |   .0534668   .0668725     0.80   0.428    -.0811406    .1880743
  _SstaXgro_34_4 |   .0147863   .0316967     0.47   0.643    -.0490158    .0785883
  _SstaXgro_34_5 |   .0131599   .0058207     2.26   0.029     .0014435    .0248763
  _SstaXgro_34_7 |  -.0117939    .009462    -1.25   0.219    -.0308399    .0072521
  _SstaXgro_34_8 |  -.0261425   .0141384    -1.85   0.071    -.0546018    .0023167
  _SstaXgro_35_1 |   .2005387   .1141571     1.76   0.086    -.0292476     .430325
  _SstaXgro_35_2 |   .0470898   .0293613     1.60   0.116    -.0120115     .106191
  _SstaXgro_35_3 |   .0091002    .125683     0.07   0.943    -.2438866     .262087
  _SstaXgro_35_4 |  -.0515987   .0610423    -0.85   0.402    -.1744705    .0712731
  _SstaXgro_35_5 |  -.0285108   .0121411    -2.35   0.023    -.0529496   -.0040721
  _SstaXgro_35_7 |  -.0091014   .0211547    -0.43   0.669    -.0516836    .0334808
  _SstaXgro_35_8 |   -.028975   .0287942    -1.01   0.320    -.0869347    .0289848
  _SstaXgro_36_1 |   .0316278   .0713738     0.44   0.660    -.1120402    .1752957
  _SstaXgro_36_2 |  -.0039369    .018762    -0.21   0.835    -.0417028    .0338291
  _SstaXgro_36_3 |  -.0370859   .0793515    -0.47   0.642    -.1968122    .1226404
  _SstaXgro_36_4 |  -.0151475    .038006    -0.40   0.692    -.0916496    .0613547
  _SstaXgro_36_5 |   -.019122   .0075767    -2.52   0.015    -.0343731    -.003871
  _SstaXgro_36_7 |  -.0544192   .0130397    -4.17   0.000    -.0806667   -.0281717
  _SstaXgro_36_8 |   -.018701   .0178315    -1.05   0.300     -.054594    .0171919
  _SstaXgro_37_1 |   .2522166   .0365301     6.90   0.000     .1786852    .3257479
  _SstaXgro_37_2 |   .1003712   .0107379     9.35   0.000     .0787569    .1219854
  _SstaXgro_37_3 |   .2205876   .0411276     5.36   0.000     .1378019    .3033732
  _SstaXgro_37_4 |   .0872459   .0193163     4.52   0.000     .0483641    .1261276
  _SstaXgro_37_5 |   .0206888   .0039953     5.18   0.000     .0126467    .0287309
  _SstaXgro_37_7 |   .0315288   .0069802     4.52   0.000     .0174783    .0455793
  _SstaXgro_37_8 |  -.0112849     .00903    -1.25   0.218    -.0294613    .0068916
  _SstaXgro_38_1 |          0  (omitted)
  _SstaXgro_38_2 |   .2341512   .0325683     7.19   0.000     .1685947    .2997078
  _SstaXgro_38_3 |   .1704394   .1520771     1.12   0.268    -.1356758    .4765547
  _SstaXgro_38_4 |          0  (omitted)
  _SstaXgro_38_5 |   .0070837   .0142039     0.50   0.620    -.0215073    .0356747
  _SstaXgro_38_7 |   .1171577    .025164     4.66   0.000     .0665052    .1678101
  _SstaXgro_38_8 |   .0382465   .0338816     1.13   0.265    -.0299536    .1064466
  _SstaXgro_39_1 |   .0576785   .0157154     3.67   0.001      .026045    .0893119
  _SstaXgro_39_2 |   .0172107   .0041872     4.11   0.000     .0087822    .0256391
  _SstaXgro_39_3 |   .0673787   .0176197     3.82   0.000      .031912    .1028454
  _SstaXgro_39_4 |  -.0079218    .008345    -0.95   0.347    -.0247196    .0088759
  _SstaXgro_39_5 |  -.0279922   .0017338   -16.14   0.000    -.0314822   -.0245022
  _SstaXgro_39_7 |  -.0417494   .0030154   -13.85   0.000    -.0478191   -.0356798
  _SstaXgro_39_8 |  -.0006769   .0039099    -0.17   0.863    -.0085471    .0071933
  _SstaXgro_40_1 |   .0212015   .0517856     0.41   0.684    -.0830376    .1254405
  _SstaXgro_40_2 |   .0481683   .0177804     2.71   0.009     .0123783    .0839583
  _SstaXgro_40_3 |  -.0325751   .0517877    -0.63   0.532    -.1368184    .0716682
  _SstaXgro_40_4 |  -.0201495   .0280904    -0.72   0.477    -.0766925    .0363935
  _SstaXgro_40_5 |   .0008939    .005632     0.16   0.875    -.0104427    .0122305
  _SstaXgro_40_7 |   .0060273   .0092287     0.65   0.517    -.0125491    .0246038
  _SstaXgro_40_8 |  -.0306858   .0123145    -2.49   0.016    -.0554736   -.0058979
  _SstaXgro_41_1 |   .0024661   .0715261     0.03   0.973    -.1415084    .1464406
  _SstaXgro_41_2 |   .0736365   .0180286     4.08   0.000     .0373469    .1099261
  _SstaXgro_41_3 |  -.0455674   .0798924    -0.57   0.571    -.2063825    .1152478
  _SstaXgro_41_4 |  -.0508138   .0383039    -1.33   0.191    -.1279156     .026288
  _SstaXgro_41_5 |  -.0130883   .0076108    -1.72   0.092     -.028408    .0022314
  _SstaXgro_41_7 |   .0097277    .013095     0.74   0.461    -.0166312    .0360865
  _SstaXgro_41_8 |  -.0021439   .0179069    -0.12   0.905    -.0381888    .0339009
  _SstaXgro_42_1 |    .009397   .0174269     0.54   0.592    -.0256816    .0444756
  _SstaXgro_42_2 |   .0221652   .0043062     5.15   0.000     .0134974    .0308331
  _SstaXgro_42_3 |   .0508183   .0194269     2.62   0.012     .0117139    .0899227
  _SstaXgro_42_4 |   .0228622   .0093419     2.45   0.018      .004058    .0416664
  _SstaXgro_42_5 |  -.0059589   .0018846    -3.16   0.003    -.0097524   -.0021654
  _SstaXgro_42_7 |  -.0136301   .0032099    -4.25   0.000    -.0200913   -.0071689
  _SstaXgro_42_8 |  -.0090762   .0043739    -2.08   0.044    -.0178804   -.0002719
  _SstaXgro_44_1 |   .1115126   .0749098     1.49   0.143    -.0392729    .2622981
  _SstaXgro_44_2 |   -.026505   .0186385    -1.42   0.162    -.0640224    .0110123
  _SstaXgro_44_3 |   .0440705   .0826311     0.53   0.596    -.1222572    .2103982
  _SstaXgro_44_4 |    .023314   .0403848     0.58   0.567    -.0579764    .1046045
  _SstaXgro_44_5 |  -.0220495   .0080288    -2.75   0.009    -.0382106   -.0058885
  _SstaXgro_44_7 |   .0287273   .0139708     2.06   0.045     .0006055    .0568491
  _SstaXgro_44_8 |   .0363297   .0190082     1.91   0.062     -.001932    .0745913
  _SstaXgro_45_1 |   .1196514   .0506019     2.36   0.022     .0177952    .2215077
  _SstaXgro_45_2 |   .0472603   .0155509     3.04   0.004      .015958    .0785626
  _SstaXgro_45_3 |   .1358799   .0299019     4.54   0.000     .0756905    .1960693
  _SstaXgro_45_4 |   .0096201    .027027     0.36   0.724    -.0447825    .0640226
  _SstaXgro_45_5 |  -.0182329   .0085955    -2.12   0.039    -.0355347    -.000931
  _SstaXgro_45_7 |  -.0631252   .0232128    -2.72   0.009    -.1098503   -.0164002
  _SstaXgro_45_8 |  -.0379846   .0166717    -2.28   0.027    -.0715431   -.0044262
  _SstaXgro_46_1 |   .3192338   .1027016     3.11   0.003     .1125062    .5259613
  _SstaXgro_46_2 |   .0885385   .0241917     3.66   0.001     .0398431    .1372339
  _SstaXgro_46_3 |   .0950064   .1138013     0.83   0.408    -.1340637    .3240765
  _SstaXgro_46_4 |   .1310831    .055429     2.36   0.022     .0195103    .2426558
  _SstaXgro_46_5 |   .0168463   .0111056     1.52   0.136    -.0055081    .0392007
  _SstaXgro_46_7 |   .1104988   .0190107     5.81   0.000     .0722321    .1487654
  _SstaXgro_46_8 |   .0349783   .0260044     1.35   0.185    -.0173658    .0873225
  _SstaXgro_47_1 |   .1046914   .0398553     2.63   0.012     .0244669    .1849159
  _SstaXgro_47_2 |   .0925319   .0113844     8.13   0.000     .0696163    .1154475
  _SstaXgro_47_3 |   .1669312   .0450509     3.71   0.001     .0762486    .2576139
  _SstaXgro_47_4 |   .0703982   .0215306     3.27   0.002     .0270593    .1137371
  _SstaXgro_47_5 |  -.0315077   .0045198    -6.97   0.000    -.0406055   -.0224098
  _SstaXgro_47_7 |  -.0448942   .0085695    -5.24   0.000    -.0621437   -.0276448
  _SstaXgro_47_8 |  -.0278668   .0102932    -2.71   0.009    -.0485861   -.0071476
  _SstaXgro_48_1 |   .1368151   .0081826    16.72   0.000     .1203444    .1532858
  _SstaXgro_48_2 |   .0650578   .0017931    36.28   0.000     .0614485    .0686672
  _SstaXgro_48_3 |   .1400242   .0088554    15.81   0.000     .1221992    .1578492
  _SstaXgro_48_4 |    .042519   .0046531     9.14   0.000     .0331529    .0518851
  _SstaXgro_48_5 |   .0177365   .0010067    17.62   0.000     .0157102    .0197629
  _SstaXgro_48_7 |  -.0061451   .0016285    -3.77   0.000    -.0094231   -.0028672
  _SstaXgro_48_8 |  -.0303598   .0021119   -14.38   0.000    -.0346109   -.0261087
  _SstaXgro_49_1 |   .0952829   .0067525    14.11   0.000     .0816909    .1088749
  _SstaXgro_49_2 |   .1135482   .0018605    61.03   0.000     .1098033    .1172931
  _SstaXgro_49_3 |   .2928284   .0055291    52.96   0.000     .2816989    .3039579
  _SstaXgro_49_4 |   .1192119   .0051894    22.97   0.000     .1087661    .1296577
  _SstaXgro_49_5 |   .0291728   .0017165    17.00   0.000     .0257176     .032628
  _SstaXgro_49_7 |   .0259794   .0026228     9.91   0.000        .0207    .0312589
  _SstaXgro_49_8 |  -.0638599   .0017508   -36.48   0.000    -.0673841   -.0603358
  _SstaXgro_51_1 |   .1807752   .0420839     4.30   0.000     .0960647    .2654857
  _SstaXgro_51_2 |   .1080936    .013021     8.30   0.000     .0818838    .1343035
  _SstaXgro_51_3 |   .0976735   .0459859     2.12   0.039     .0051086    .1902383
  _SstaXgro_51_4 |   .0527478   .0241703     2.18   0.034     .0040956       .1014
  _SstaXgro_51_5 |   .0278243   .0076928     3.62   0.001     .0123396    .0433091
  _SstaXgro_51_7 |   .0101833   .0111581     0.91   0.366    -.0122767    .0326433
  _SstaXgro_51_8 |  -.0314563   .0199477    -1.58   0.122    -.0716088    .0086962
  _SstaXgro_53_1 |   .0594304   .0605568     0.98   0.332     -.062464    .1813248
  _SstaXgro_53_2 |   .0532386   .0156802     3.40   0.001      .021676    .0848011
  _SstaXgro_53_3 |   .1121171   .0672368     1.67   0.102    -.0232236    .2474577
  _SstaXgro_53_4 |   .0590115   .0326872     1.81   0.078    -.0067843    .1248074
  _SstaXgro_53_5 |  -.0012571   .0065262    -0.19   0.848    -.0143938    .0118795
  _SstaXgro_53_7 |  -.0033407   .0112207    -0.30   0.767    -.0259269    .0192455
  _SstaXgro_53_8 |  -.0102764   .0152846    -0.67   0.505    -.0410426    .0204898
  _SstaXgro_54_1 |   -.000684   .0479699    -0.01   0.989    -.0972425    .0958744
  _SstaXgro_54_2 |   .0117747   .0127761     0.92   0.362    -.0139422    .0374915
  _SstaXgro_54_3 |   .0170614   .0522397     0.33   0.745    -.0880915    .1222144
  _SstaXgro_54_4 |  -.0331596   .0259033    -1.28   0.207    -.0853003    .0189811
  _SstaXgro_54_5 |  -.0887411   .0051656   -17.18   0.000     -.099139   -.0783433
  _SstaXgro_54_7 |   -.123583   .0090531   -13.65   0.000    -.1418058   -.1053601
  _SstaXgro_54_8 |   .0251514   .0121156     2.08   0.044     .0007639    .0495389
  _SstaXgro_55_1 |   .0123495   .0133343     0.93   0.359     -.014491      .03919
  _SstaXgro_55_2 |    .033163   .0037569     8.83   0.000     .0256008    .0407252
  _SstaXgro_55_3 |    .104481   .0146639     7.13   0.000     .0749641    .1339979
  _SstaXgro_55_4 |   -.047671   .0069904    -6.82   0.000    -.0617419      -.0336
  _SstaXgro_55_5 |   .0159845   .0014888    10.74   0.000     .0129878    .0189812
  _SstaXgro_55_7 |   .0632386   .0025153    25.14   0.000     .0581756    .0683015
  _SstaXgro_55_8 |    .018108   .0032728     5.53   0.000     .0115202    .0246959
    _SstaXttre_1 |   .0003219   .0007173     0.45   0.656     -.001122    .0017658
    _SstaXttre_2 |   -.030251   .0056624    -5.34   0.000    -.0416489   -.0188532
    _SstaXttre_4 |  -.1095522   .0098211   -11.15   0.000     -.129321   -.0897834
    _SstaXttre_5 |   .0180791   .0044486     4.06   0.000     .0091245    .0270337
    _SstaXttre_6 |  -.0098679   .0013063    -7.55   0.000    -.0124973   -.0072385
    _SstaXttre_8 |  -.0145886   .0013137   -11.10   0.000    -.0172331   -.0119442
    _SstaXttre_9 |   .0155028   .0106332     1.46   0.152    -.0059009    .0369064
   _SstaXttre_10 |  -.0019655   .0093464    -0.21   0.834    -.0207788    .0168477
   _SstaXttre_12 |   .0019158   .0019177     1.00   0.323    -.0019442    .0057759
   _SstaXttre_13 |   .0107048   .0016658     6.43   0.000     .0073517     .014058
   _SstaXttre_15 |  -.0928214   .0068259   -13.60   0.000    -.1065613   -.0790814
   _SstaXttre_16 |   .0218281   .0053593     4.07   0.000     .0110404    .0326159
   _SstaXttre_18 |  -.0146461   .0009085   -16.12   0.000    -.0164748   -.0128174
   _SstaXttre_19 |   .0918375   .0047077    19.51   0.000     .0823613    .1013137
   _SstaXttre_20 |  -.0038174   .0013842    -2.76   0.008    -.0066037   -.0010311
   _SstaXttre_21 |   .0037201   .0005004     7.43   0.000     .0027129    .0047272
   _SstaXttre_22 |  -.0055151   .0012843    -4.29   0.000    -.0081003   -.0029298
   _SstaXttre_23 |   .0155214   .0087629     1.77   0.083    -.0021174    .0331601
   _SstaXttre_24 |   .0029633   .0012523     2.37   0.022     .0004426     .005484
   _SstaXttre_25 |   .0014963   .0016461     0.91   0.368    -.0018172    .0048098
   _SstaXttre_26 |   -.005653   .0005888    -9.60   0.000    -.0068381   -.0044679
   _SstaXttre_27 |  -.0062413   .0009069    -6.88   0.000    -.0080668   -.0044157
   _SstaXttre_28 |   .0809993   .0071714    11.29   0.000      .066564    .0954346
   _SstaXttre_29 |  -.0088681   .0007575   -11.71   0.000    -.0103929   -.0073433
   _SstaXttre_31 |    .029697   .0026828    11.07   0.000     .0242967    .0350973
   _SstaXttre_32 |  -.0381864   .0074644    -5.12   0.000    -.0532113   -.0231614
   _SstaXttre_33 |   .0444117   .0091261     4.87   0.000     .0260418    .0627816
   _SstaXttre_34 |  -.0076007   .0014855    -5.12   0.000    -.0105909   -.0046105
   _SstaXttre_35 |  -.1332418   .0046625   -28.58   0.000    -.1426269   -.1238566
   _SstaXttre_36 |  -.0069696   .0011285    -6.18   0.000    -.0092411   -.0046981
   _SstaXttre_37 |  -.0052704   .0016652    -3.16   0.003    -.0086223   -.0019184
   _SstaXttre_38 |   2.727131   .5667671     4.81   0.000     1.586288    3.867974
   _SstaXttre_39 |  -.0056842    .000417   -13.63   0.000    -.0065235   -.0048448
   _SstaXttre_40 |  -.0244897   .0214327    -1.14   0.259    -.0676314    .0186521
   _SstaXttre_41 |  -.0153006   .0010234   -14.95   0.000    -.0173606   -.0132406
   _SstaXttre_42 |   -.008047    .000745   -10.80   0.000    -.0095466   -.0065475
   _SstaXttre_44 |  -.0069748   .0082178    -0.85   0.400    -.0235164    .0095667
   _SstaXttre_45 |   .1188631   .0167317     7.10   0.000     .0851839    .1525422
   _SstaXttre_46 |   .0169395   .0035548     4.77   0.000      .009784     .024095
   _SstaXttre_47 |  -.0338062   .0114411    -2.95   0.005    -.0568359   -.0107766
   _SstaXttre_48 |  -.0110679   .0027835    -3.98   0.000    -.0166708    -.005465
   _SstaXttre_49 |  -.0202289   .0030606    -6.61   0.000    -.0263895   -.0140683
   _SstaXttre_51 |   .0117932   .0011165    10.56   0.000     .0095457    .0140406
   _SstaXttre_53 |   -.002142   .0008359    -2.56   0.014    -.0038245   -.0004596
   _SstaXttre_54 |   .0539819   .0028621    18.86   0.000     .0482207    .0597431
   _SstaXttre_55 |  -.0102016   .0005991   -17.03   0.000    -.0114076   -.0089957
    _SstaXttrea1 |  -.0004066   .0001019    -3.99   0.000    -.0006117   -.0002015
    _SstaXttrea2 |   .0021908    .000448     4.89   0.000     .0012891    .0030925
    _SstaXttrea4 |   .0098182   .0008705    11.28   0.000     .0080658    .0115705
    _SstaXttrea5 |  -.0018651   .0003406    -5.48   0.000    -.0025506   -.0011795
    _SstaXttrea6 |   .0008022   .0001468     5.47   0.000     .0005067    .0010977
    _SstaXttrea8 |   .0013791   .0001651     8.35   0.000     .0010468    .0017114
    _SstaXttrea9 |   -.000267   .0008729    -0.31   0.761    -.0020241    .0014902
   _SstaXttrea10 |   .0006556   .0007892     0.83   0.410    -.0009329    .0022441
   _SstaXttrea12 |   .0002325   .0002094     1.11   0.273     -.000189     .000654
   _SstaXttrea13 |   -.001545   .0002344    -6.59   0.000    -.0020168   -.0010733
   _SstaXttrea15 |   .0072734   .0005812    12.51   0.000     .0061034    .0084434
   _SstaXttrea16 |  -.0012354   .0004817    -2.56   0.014     -.002205   -.0002657
   _SstaXttrea18 |   .0019766   .0001042    18.97   0.000     .0017669    .0021863
   _SstaXttrea19 |  -.0082492   .0003456   -23.87   0.000    -.0089449   -.0075536
   _SstaXttrea20 |   .0007931   .0001773     4.47   0.000     .0004361    .0011501
   _SstaXttrea21 |   .0007536   .0000698    10.80   0.000     .0006132     .000894
   _SstaXttrea22 |   .0003394   .0001502     2.26   0.029      .000037    .0006417
   _SstaXttrea23 |  -.0003614    .000708    -0.51   0.612    -.0017865    .0010637
   _SstaXttrea24 |  -.0004008   .0001509    -2.66   0.011    -.0007045   -.0000972
   _SstaXttrea25 |  -.0001174   .0002078    -0.57   0.575    -.0005357    .0003008
   _SstaXttrea26 |   .0003593    .000068     5.28   0.000     .0002223    .0004962
   _SstaXttrea27 |   .0008768   .0001285     6.82   0.000      .000618    .0011355
   _SstaXttrea28 |  -.0063849   .0006781    -9.42   0.000    -.0077498   -.0050201
   _SstaXttrea29 |   .0010202   .0000953    10.70   0.000     .0008283    .0012121
   _SstaXttrea31 |  -.0020955   .0002234    -9.38   0.000    -.0025451   -.0016459
   _SstaXttrea32 |   .0028678   .0005739     5.00   0.000     .0017126    .0040231
   _SstaXttrea33 |  -.0040778    .000693    -5.88   0.000    -.0054728   -.0026829
   _SstaXttrea34 |   .0009139    .000163     5.60   0.000     .0005857     .001242
   _SstaXttrea35 |   .0101171   .0003713    27.24   0.000     .0093696    .0108646
   _SstaXttrea36 |   .0005528   .0001258     4.39   0.000     .0002995     .000806
   _SstaXttrea37 |   .0007065   .0001441     4.90   0.000     .0004165    .0009966
   _SstaXttrea38 |   -.159692    .031667    -5.04   0.000    -.2234343   -.0959496
   _SstaXttrea39 |   .0006882   .0000677    10.16   0.000     .0005519    .0008245
   _SstaXttrea40 |   .0009894   .0020231     0.49   0.627    -.0030828    .0050616
   _SstaXttrea41 |   .0014946   .0001408    10.61   0.000     .0012111    .0017781
   _SstaXttrea42 |   .0011919   .0000753    15.83   0.000     .0010404    .0013434
   _SstaXttrea44 |   .0006336   .0006309     1.00   0.320    -.0006364    .0019037
   _SstaXttrea45 |  -.0323675   .0047195    -6.86   0.000    -.0418673   -.0228676
   _SstaXttrea46 |  -.0011584   .0002804    -4.13   0.000    -.0017229    -.000594
   _SstaXttrea47 |   .0026566   .0010685     2.49   0.017     .0005058    .0048073
   _SstaXttrea48 |   .0013118   .0003003     4.37   0.000     .0007073    .0019162
   _SstaXttrea49 |   .0029332   .0002435    12.04   0.000      .002443    .0034234
   _SstaXttrea51 |  -.0009533   .0001032    -9.24   0.000    -.0011609   -.0007456
   _SstaXttrea53 |    -.00019   .0001164    -1.63   0.109    -.0004243    .0000442
   _SstaXttrea54 |  -.0042552   .0001898   -22.42   0.000    -.0046372   -.0038731
   _SstaXttrea55 |   .0017042   .0001046    16.29   0.000     .0014935    .0019148
    _SstaXttreb1 |   .0000215   5.98e-06     3.60   0.001     9.51e-06    .0000336
    _SstaXttreb2 |  -.0000548   .0000118    -4.66   0.000    -.0000785   -.0000311
    _SstaXttreb4 |  -.0002771   .0000237   -11.68   0.000    -.0003248   -.0002293
    _SstaXttreb5 |   .0000556   8.52e-06     6.53   0.000     .0000385    .0000728
    _SstaXttreb6 |  -.0000256   4.59e-06    -5.58   0.000    -.0000349   -.0000164
    _SstaXttreb8 |  -.0000407   5.23e-06    -7.78   0.000    -.0000512   -.0000302
    _SstaXttreb9 |  -.0000294   .0000221    -1.33   0.190    -.0000739    .0000151
   _SstaXttreb10 |  -.0000283    .000021    -1.35   0.184    -.0000706    .0000139
   _SstaXttreb12 |  -.0000211   6.43e-06    -3.28   0.002     -.000034   -8.15e-06
   _SstaXttreb13 |   .0000509   9.49e-06     5.36   0.000     .0000318    .0000699
   _SstaXttreb15 |   -.000179   .0000149   -11.99   0.000     -.000209   -.0001489
   _SstaXttreb16 |   .0000196   .0000138     1.41   0.164    -8.31e-06    .0000474
   _SstaXttreb18 |  -.0000729   3.39e-06   -21.52   0.000    -.0000797   -.0000661
   _SstaXttreb19 |   .0002307   7.70e-06    29.97   0.000     .0002152    .0002461
   _SstaXttreb20 |  -.0000274   5.55e-06    -4.94   0.000    -.0000386   -.0000163
   _SstaXttreb21 |  -.0000429   2.49e-06   -17.21   0.000     -.000048   -.0000379
   _SstaXttreb22 |  -9.12e-06   4.48e-06    -2.03   0.048    -.0000181   -9.76e-08
   _SstaXttreb23 |  -3.62e-06   .0000178    -0.20   0.840    -.0000395    .0000322
   _SstaXttreb24 |    .000012   4.46e-06     2.69   0.010     3.03e-06     .000021
   _SstaXttreb25 |  -1.19e-06   6.59e-06    -0.18   0.857    -.0000145    .0000121
   _SstaXttreb26 |  -7.36e-06   2.91e-06    -2.52   0.015    -.0000132   -1.49e-06
   _SstaXttreb27 |  -.0000483   .0000103    -4.70   0.000     -.000069   -.0000276
   _SstaXttreb28 |   .0001521   .0000206     7.39   0.000     .0001106    .0001935
   _SstaXttreb29 |  -.0000346   3.43e-06   -10.08   0.000    -.0000415   -.0000277
   _SstaXttreb31 |    .000047   5.75e-06     8.17   0.000     .0000354    .0000585
   _SstaXttreb32 |  -.0000736   .0000143    -5.13   0.000    -.0001024   -.0000447
   _SstaXttreb33 |   .0001079   .0000169     6.38   0.000     .0000738    .0001419
   _SstaXttreb34 |  -.0000312   4.89e-06    -6.37   0.000     -.000041   -.0000213
   _SstaXttreb35 |  -.0002443   9.43e-06   -25.90   0.000    -.0002632   -.0002253
   _SstaXttreb36 |  -.0000152   3.76e-06    -4.03   0.000    -.0000227   -7.58e-06
   _SstaXttreb37 |  -.0000255   3.90e-06    -6.54   0.000    -.0000333   -.0000177
   _SstaXttreb38 |   .0030925   .0005884     5.26   0.000      .001908    .0042769
   _SstaXttreb39 |   -.000023   2.80e-06    -8.23   0.000    -.0000287   -.0000174
   _SstaXttreb40 |  -2.97e-06     .00006    -0.05   0.961    -.0001237    .0001178
   _SstaXttreb41 |   -.000041   5.02e-06    -8.17   0.000    -.0000511   -.0000309
   _SstaXttreb42 |  -.0000412   2.21e-06   -18.67   0.000    -.0000457   -.0000368
   _SstaXttreb44 |  -.0000189   .0000153    -1.24   0.221    -.0000496    .0000118
   _SstaXttreb45 |   .0022384   .0003344     6.69   0.000     .0015654    .0029115
   _SstaXttreb46 |   .0000287   6.81e-06     4.21   0.000      .000015    .0000424
   _SstaXttreb47 |  -.0000635   .0000313    -2.03   0.049    -.0001265   -3.97e-07
   _SstaXttreb48 |  -.0000449   7.14e-06    -6.29   0.000    -.0000593   -.0000305
   _SstaXttreb49 |  -.0000966   6.68e-06   -14.47   0.000      -.00011   -.0000831
   _SstaXttreb51 |   .0000159   3.02e-06     5.27   0.000     9.83e-06     .000022
   _SstaXttreb53 |   .0000122   4.27e-06     2.86   0.006     3.61e-06    .0000208
   _SstaXttreb54 |   .0001098   4.51e-06    24.34   0.000     .0001007    .0001189
   _SstaXttreb55 |  -.0000608   4.38e-06   -13.89   0.000    -.0000696    -.000052
   _TgroXttren_1 |   .0026044   .0062102     0.42   0.677    -.0098961    .0151049
   _TgroXttren_2 |   .0091476   .0052504     1.74   0.088    -.0014209    .0197161
   _TgroXttren_3 |    .009647    .004899     1.97   0.055    -.0002142    .0195082
   _TgroXttren_4 |   .0179683   .0073174     2.46   0.018     .0032391    .0326976
   _TgroXttren_5 |   .0036263   .0023898     1.52   0.136    -.0011842    .0084367
   _TgroXttren_7 |   .0137056   .0033674     4.07   0.000     .0069275    .0204838
   _TgroXttren_8 |   .0099003   .0036116     2.74   0.009     .0026305    .0171701
   _TgroXttrena1 |  -.0009723   .0007671    -1.27   0.211    -.0025163    .0005717
   _TgroXttrena2 |  -.0009339   .0005777    -1.62   0.113    -.0020967    .0002289
   _TgroXttrena3 |  -.0010958   .0003976    -2.76   0.008    -.0018961   -.0002954
   _TgroXttrena4 |  -.0016836   .0006731    -2.50   0.016    -.0030384   -.0003288
   _TgroXttrena5 |  -.0007488   .0002809    -2.67   0.011    -.0013142   -.0001834
   _TgroXttrena7 |  -.0009909   .0002887    -3.43   0.001     -.001572   -.0004099
   _TgroXttrena8 |  -.0003258   .0003622    -0.90   0.373    -.0010549    .0004033
   _TgroXttrenb1 |   .0000374   .0000248     1.51   0.139    -.0000126    .0000874
   _TgroXttrenb2 |   .0000287   .0000185     1.55   0.128    -8.55e-06     .000066
   _TgroXttrenb3 |   .0000463   .0000114     4.05   0.000     .0000233    .0000694
   _TgroXttrenb4 |   .0000519   .0000195     2.67   0.011     .0000127    .0000912
   _TgroXttrenb5 |   .0000265   9.16e-06     2.89   0.006     8.07e-06    .0000449
   _TgroXttrenb7 |   .0000281   8.49e-06     3.32   0.002     .0000111    .0000452
   _TgroXttrenb8 |   1.40e-06   .0000104     0.13   0.893    -.0000195    .0000223
           _cons |   .2840247   .0290684     9.77   0.000      .225513    .3425365
----------------------------------------------------------------------------------

. estimates store empd ;

. quietly reg empdhi $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdhi ;

. quietly reg empdlg $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdlg ;

. * note group health coverage and pension are conditional on being asked the question ;
. quietly reg inclughr $controls [pw=wtsupp], cluster(statefip) ;

. estimates store inclughr ;

. quietly reg pensionr $controls [pw=wtsupp], cluster(statefip) ;

. estimates store pensionr ;

. quietly reg ph $controls [pw=wtsupp], cluster(statefip) ;

. estimates store ph ;

. quietly reg lrhw $controls [pw=wtsupp] if hwagesamp==1, cluster(statefip) ;

. estimates store lrhw ;

. ******* ESTIMATES WITH PRO AND ANTI TESTING DUMMIES ******* ;
. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) se(%7.3f) stats(N) ;

----------------------------------------------------------------
    Variable |  empd     empdhi    empdlg      ph       lrhw    
-------------+--------------------------------------------------
  _Pgroup8_1 |  -0.287     0.145    -0.255    -0.051    -0.347  
             |   0.035     0.021     0.286     0.023     0.029  
  _Pgroup8_2 |  -0.154     0.074     0.689    -0.003    -0.154  
             |   0.019     0.023     0.311     0.018     0.026  
  _Pgroup8_3 |  -0.437     0.005    -0.065    -0.138    -0.617  
             |   0.043     0.021     0.422     0.016     0.030  
  _Pgroup8_4 |  -0.215    -0.077     0.673    -0.014    -0.301  
             |   0.028     0.019     0.333     0.017     0.024  
  _Pgroup8_5 |  -0.034     0.130     0.104    -0.010    -0.092  
             |   0.007     0.017     0.162     0.013     0.019  
  _Pgroup8_7 |  -0.286    -0.046    -0.109    -0.191    -0.543  
             |   0.013     0.013     0.157     0.010     0.009  
  _Pgroup8_8 |  -0.177    -0.177     0.077    -0.116    -0.338  
             |   0.010     0.011     0.122     0.009     0.011  
 _PgroXpro_1 |   0.022    -0.011     0.008     0.061     0.070  
             |   0.025     0.026     0.018     0.025     0.033  
 _PgroXpro_2 |   0.019    -0.022     0.083    -0.014     0.036  
             |   0.012     0.025     0.016     0.019     0.027  
 _PgroXpro_3 |   0.006     0.045    -0.076    -0.044     0.045  
             |   0.014     0.015     0.025     0.027     0.021  
 _PgroXpro_4 |  -0.030     0.007    -0.034     0.033     0.062  
             |   0.019     0.019     0.018     0.016     0.045  
 _PgroXpro_5 |   0.011     0.026    -0.016    -0.002     0.014  
             |   0.005     0.018     0.012     0.010     0.015  
 _PgroXpro_7 |  -0.017     0.010    -0.009    -0.010    -0.023  
             |   0.011     0.011     0.012     0.022     0.027  
 _PgroXpro_8 |  -0.019    -0.005    -0.008    -0.013    -0.011  
             |   0.008     0.018     0.010     0.004     0.019  
_PgroXprod~1 |   0.013     0.054     0.010     0.005    -0.016  
             |   0.016     0.016     0.008     0.012     0.021  
_PgroXprod~2 |   0.015     0.043    -0.014     0.042    -0.026  
             |   0.004     0.018     0.004     0.014     0.023  
_PgroXprod~3 |   0.001     0.047     0.058     0.046    -0.032  
             |   0.007     0.010     0.013     0.025     0.011  
_PgroXprod~4 |   0.001     0.045     0.037    -0.002    -0.049  
             |   0.010     0.010     0.008     0.007     0.028  
_PgroXprod~5 |   0.003     0.011     0.030     0.003    -0.009  
             |   0.004     0.012     0.005     0.007     0.012  
_PgroXprod~7 |   0.025     0.029     0.014    -0.012    -0.027  
             |   0.010     0.009     0.006     0.015     0.021  
_PgroXprod~8 |   0.012     0.017     0.013    -0.015    -0.001  
             |   0.007     0.015     0.009     0.002     0.016  
_AgroXanti_1 |  -0.097    -0.060    -0.217    -0.150    -0.137  
             |   0.104     0.028     0.107     0.091     0.096  
_AgroXanti_2 |  -0.035     0.024    -0.065     0.064    -0.049  
             |   0.033     0.112     0.022     0.078     0.062  
_AgroXanti_3 |   0.070    -0.076     0.078    -0.084     0.023  
             |   0.031     0.025     0.040     0.041     0.043  
_AgroXanti_4 |   0.068    -0.077    -0.082    -0.166    -0.087  
             |   0.067     0.072     0.032     0.074     0.064  
_AgroXanti_5 |  -0.016     0.026     0.014     0.017    -0.036  
             |   0.024     0.048     0.048     0.052     0.049  
_AgroXanti_7 |   0.016     0.033     0.039     0.041     0.012  
             |   0.010     0.038     0.023     0.058     0.031  
_AgroXanti_8 |   0.011     0.001     0.047    -0.015    -0.027  
             |   0.025     0.043     0.008     0.038     0.023  
_AgroXan~d_1 |  -0.063    -0.008    -0.034     0.077    -0.093  
             |   0.102     0.009     0.039     0.089     0.117  
_AgroXan~d_2 |   0.013     0.052     0.133     0.124     0.174  
             |   0.042     0.028     0.012     0.082     0.068  
_AgroXan~d_3 |  -0.009    -0.098    -0.143    -0.042    -0.103  
             |   0.033     0.022     0.031     0.039     0.026  
_AgroXan~d_4 |  -0.099     0.009    -0.023     0.090     0.087  
             |   0.039     0.020     0.025     0.047     0.045  
_AgroXan~d_5 |   0.036    -0.027    -0.020    -0.002     0.025  
             |   0.024     0.039     0.069     0.032     0.050  
_AgroXan~d_7 |  -0.023     0.052    -0.035    -0.002     0.020  
             |   0.016     0.019     0.039     0.024     0.048  
_AgroXan~d_8 |   0.020    -0.005    -0.082     0.081     0.044  
             |   0.011     0.011     0.011     0.032     0.015  
         pro |   0.007    -0.001     0.005     0.017    -0.012  
             |   0.004     0.011     0.014     0.008     0.022  
        anti |   0.018    -0.020    -0.028    -0.066    -0.037  
             |   0.023     0.047     0.011     0.025     0.037  
-------------+--------------------------------------------------
           N |  831483    638829    491329    702404    628439  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |    empd        empdhi       empdlg         ph          lrhw     
-------------+-----------------------------------------------------------------
  _Pgroup8_1 |  -0.287***     0.145***    -0.255       -0.051*      -0.347***  
  _Pgroup8_2 |  -0.154***     0.074**      0.689*      -0.003       -0.154***  
  _Pgroup8_3 |  -0.437***     0.005       -0.065       -0.138***    -0.617***  
  _Pgroup8_4 |  -0.215***    -0.077***     0.673*      -0.014       -0.301***  
  _Pgroup8_5 |  -0.034***     0.130***     0.104       -0.010       -0.092***  
  _Pgroup8_7 |  -0.286***    -0.046***    -0.109       -0.191***    -0.543***  
  _Pgroup8_8 |  -0.177***    -0.177***     0.077       -0.116***    -0.338***  
 _PgroXpro_1 |   0.022       -0.011        0.008        0.061*       0.070*    
 _PgroXpro_2 |   0.019       -0.022        0.083***    -0.014        0.036     
 _PgroXpro_3 |   0.006        0.045**     -0.076**     -0.044        0.045*    
 _PgroXpro_4 |  -0.030        0.007       -0.034        0.033        0.062     
 _PgroXpro_5 |   0.011*       0.026       -0.016       -0.002        0.014     
 _PgroXpro_7 |  -0.017        0.010       -0.009       -0.010       -0.023     
 _PgroXpro_8 |  -0.019*      -0.005       -0.008       -0.013**     -0.011     
_PgroXprod~1 |   0.013        0.054**      0.010        0.005       -0.016     
_PgroXprod~2 |   0.015**      0.043*      -0.014***     0.042**     -0.026     
_PgroXprod~3 |   0.001        0.047***     0.058***     0.046       -0.032**   
_PgroXprod~4 |   0.001        0.045***     0.037***    -0.002       -0.049     
_PgroXprod~5 |   0.003        0.011        0.030***     0.003       -0.009     
_PgroXprod~7 |   0.025*       0.029**      0.014*      -0.012       -0.027     
_PgroXprod~8 |   0.012        0.017        0.013       -0.015***    -0.001     
_AgroXanti_1 |  -0.097       -0.060*      -0.217*      -0.150       -0.137     
_AgroXanti_2 |  -0.035        0.024       -0.065**      0.064       -0.049     
_AgroXanti_3 |   0.070*      -0.076**      0.078       -0.084*       0.023     
_AgroXanti_4 |   0.068       -0.077       -0.082*      -0.166*      -0.087     
_AgroXanti_5 |  -0.016        0.026        0.014        0.017       -0.036     
_AgroXanti_7 |   0.016        0.033        0.039        0.041        0.012     
_AgroXanti_8 |   0.011        0.001        0.047***    -0.015       -0.027     
_AgroXan~d_1 |  -0.063       -0.008       -0.034        0.077       -0.093     
_AgroXan~d_2 |   0.013        0.052        0.133***     0.124        0.174*    
_AgroXan~d_3 |  -0.009       -0.098***    -0.143***    -0.042       -0.103***  
_AgroXan~d_4 |  -0.099*       0.009       -0.023        0.090        0.087     
_AgroXan~d_5 |   0.036       -0.027       -0.020       -0.002        0.025     
_AgroXan~d_7 |  -0.023        0.052**     -0.035       -0.002        0.020     
_AgroXan~d_8 |   0.020       -0.005       -0.082***     0.081*       0.044**   
         pro |   0.007       -0.001        0.005        0.017*      -0.012     
        anti |   0.018       -0.020       -0.028*      -0.066*      -0.037     
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. log close ;
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_7\msa_exclusive_3yr.log
  log type:  text
 closed on:   9 Mar 2020, 10:06:19
-------------------------------------------------------------------------------------------------------------------------------------------------------
