-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A2\appendix_table_a2.log
  log type:  text
 opened on:   6 Mar 2020, 19:47:12

. 
. cd ..
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables

. cd ..
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_NSDUH/.
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_NSDUH

. 
. *use DRUGDATA_FINAL2.dta
. use Output/DRUGDATA_FINAL2.dta
(NSDUH 2006, Dataset 0001)

. 
. cd ../Tables/Appendix_Tables/Appx_table_A2/.
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A2

. 
. *Drop people younger than 18
. drop if age<7
(205,102 observations deleted)

. 
. *Drop people 65 or older
. drop if age>16
(27,173 observations deleted)

. 
. *Create decades
. gen decade = 1980

. replace decade = 1990 if surveyyr > 1989 & surveyyr < 2000
(163,079 real changes made)

. replace decade = 2000 if surveyyr >= 2000
(246,889 real changes made)

. 
. tab surveyyr decade

   year of |              decade
    survey |      1980       1990       2000 |     Total
-----------+---------------------------------+----------
      1979 |     4,718          0          0 |     4,718 
      1982 |     3,751          0          0 |     3,751 
      1985 |     5,252          0          0 |     5,252 
      1988 |     5,182          0          0 |     5,182 
      1990 |         0      6,421          0 |     6,421 
      1991 |         0     22,654          0 |    22,654 
      1992 |         0     20,718          0 |    20,718 
      1993 |         0     18,896          0 |    18,896 
      1994 |         0      3,142          0 |     3,142 
      1995 |         0     12,656          0 |    12,656 
      1996 |         0     13,174          0 |    13,174 
      1997 |         0     15,407          0 |    15,407 
      1998 |         0     17,383          0 |    17,383 
      1999 |         0     32,628          0 |    32,628 
      2000 |         0          0     36,489 |    36,489 
      2001 |         0          0     35,693 |    35,693 
      2002 |         0          0     34,351 |    34,351 
      2003 |         0          0     35,091 |    35,091 
      2004 |         0          0     35,309 |    35,309 
      2005 |         0          0     35,215 |    35,215 
      2006 |         0          0     34,741 |    34,741 
-----------+---------------------------------+----------
     Total |    18,903    163,079    246,889 |   428,871 

. 
. gen period = "1990-2006"

. replace period = "1980s" if surveyyr < 1990
(18,903 real changes made)

. 
. **RACE**************************************************************************
. 
. gen new_white = 0

. replace new_white = 1 if white == 1 & hispanic == 0
(258,411 real changes made)

. drop white

. rename new_white white

. 
. gen new_black = 0

. replace new_black = 1 if black == 1 & hispanic == 0
(69,110 real changes made)

. drop black

. rename new_black black

. 
. gen other = 0

. replace other = 1 if (black == 0 & white == 0 & hispanic == 0)
(27,223 real changes made)

. 
. local drugs sum mrj iem

. foreach d of local drugs {
  2.         gen white_`d' = 0 if white == 1
  3.         replace white_`d' = 1 if `d'mon == 1 & white == 1
  4.         replace white_`d' = . if `d'mon == . & white == 1
  5. 
.         gen black_`d' = 0 if black == 1
  6.         replace black_`d' = 1 if `d'mon == 1 & black == 1
  7.         replace black_`d' = . if `d'mon == . & black == 1
  8. 
.         gen hispanic_`d' = 0 if hispanic == 1
  9.         replace hispanic_`d' = 1 if `d'mon == 1 & hispanic == 1
 10.         replace hispanic_`d' = . if `d'mon == . & hispanic == 1
 11.         
.         gen other_`d' = 0 if other == 1
 12.         replace other_`d' = 1 if `d'mon ==1 & other == 1
 13.         replace other_`d' = . if `d'mon == . & other == 1
 14. }
(170,460 missing values generated)
(33,103 real changes made)
(0 real changes made)
(359,761 missing values generated)
(8,763 real changes made)
(0 real changes made)
(354,744 missing values generated)
(6,504 real changes made)
(201 real changes made, 201 to missing)
(401,648 missing values generated)
(2,727 real changes made)
(3,550 real changes made, 3,550 to missing)
(170,460 missing values generated)
(27,283 real changes made)
(0 real changes made)
(359,761 missing values generated)
(7,546 real changes made)
(0 real changes made)
(354,744 missing values generated)
(4,780 real changes made)
(0 real changes made)
(401,648 missing values generated)
(2,784 real changes made)
(0 real changes made)
(170,460 missing values generated)
(13,461 real changes made)
(9,445 real changes made, 9,445 to missing)
(359,761 missing values generated)
(2,190 real changes made)
(7,422 real changes made, 7,422 to missing)
(354,744 missing values generated)
(2,893 real changes made)
(4,397 real changes made, 4,397 to missing)
(401,648 missing values generated)
(1,072 real changes made)
(4,060 real changes made, 4,060 to missing)

.         
. local race white black hispanic other

. local drugs sum mrj iem

. foreach y of local race {
  2.         foreach z of local drugs {
  3.                 bysort decade: egen `y'_decade_nm_`z' = total(`y') if `y'_`z' != .
  4.                 bysort period: egen `y'_period_nm_`z' = total(`y') if `y'_`z' != .
  5.                 
.                 *Decadal totals and percent
.                 bysort decade: egen `y'_`z'_decade = total(`y'_`z')
  6.                 gen `y'_`z'_pct_decade = `y'_`z'_decade/`y'_decade_nm_`z'
  7.                 replace `y'_`z'_pct_decade = . if `y'_`z'_pct_decade == 0
  8.                 
.                 *Period totals and percent
.                 bysort period: egen `y'_`z'_period = total(`y'_`z')
  9.                 gen `y'_`z'_pct_period = `y'_`z'_period/`y'_period_nm_`z'
 10.                 replace `y'_`z'_pct_period = . if `y'_`z'_pct_period == 0
 11.                 }
 12.         }
(170460 missing values generated)
(170460 missing values generated)
(170,460 missing values generated)
(0 real changes made)
(170,460 missing values generated)
(0 real changes made)
(170460 missing values generated)
(170460 missing values generated)
(170,460 missing values generated)
(0 real changes made)
(170,460 missing values generated)
(0 real changes made)
(179905 missing values generated)
(179905 missing values generated)
(179,905 missing values generated)
(0 real changes made)
(179,905 missing values generated)
(0 real changes made)
(359761 missing values generated)
(359761 missing values generated)
(359,761 missing values generated)
(0 real changes made)
(359,761 missing values generated)
(0 real changes made)
(359761 missing values generated)
(359761 missing values generated)
(359,761 missing values generated)
(0 real changes made)
(359,761 missing values generated)
(0 real changes made)
(367183 missing values generated)
(367183 missing values generated)
(367,183 missing values generated)
(0 real changes made)
(367,183 missing values generated)
(0 real changes made)
(354945 missing values generated)
(354945 missing values generated)
(354,945 missing values generated)
(0 real changes made)
(354,945 missing values generated)
(0 real changes made)
(354744 missing values generated)
(354744 missing values generated)
(354,744 missing values generated)
(0 real changes made)
(354,744 missing values generated)
(0 real changes made)
(359141 missing values generated)
(359141 missing values generated)
(359,141 missing values generated)
(0 real changes made)
(359,141 missing values generated)
(0 real changes made)
(405198 missing values generated)
(405198 missing values generated)
(405,198 missing values generated)
(0 real changes made)
(405,198 missing values generated)
(0 real changes made)
(401648 missing values generated)
(401648 missing values generated)
(401,648 missing values generated)
(0 real changes made)
(401,648 missing values generated)
(0 real changes made)
(405708 missing values generated)
(405708 missing values generated)
(405,708 missing values generated)
(0 real changes made)
(405,708 missing values generated)
(0 real changes made)

. 
. preserve

. 
. collapse white_mrj_pct_decade white_iem_pct_decade ///
>                  black_mrj_pct_decade black_iem_pct_decade ///
>                  hispanic_mrj_pct_decade hispanic_iem_pct_decade ///
>                  other_mrj_pct_decade other_iem_pct_decade, by(decade)

. 
. *Total percent within decade
. *White drug use by decade (mrj = Marijuana, iem = Other)
. list decade white_mrj_pct_decade white_iem_pct_decade, table

     +------------------------------+
     | decade   w~mrj_~e   w~iem_~e |
     |------------------------------|
  1. |   1980   .1242889          . |
  2. |   1990   .0865285   .0438069 |
  3. |   2000   .1147516   .0591338 |
     +------------------------------+

. *Black drug use by decade (mrj = Marijuana, iem = Other)
. list decade black_mrj_pct_decade black_iem_pct_decade, table

     +------------------------------+
     | decade   b~mrj_~e   b~iem_~e |
     |------------------------------|
  1. |   1980   .1708428          . |
  2. |   1990    .090812   .0336212 |
  3. |   2000   .1173978   .0375837 |
     +------------------------------+

. *Hispanic drug use by decade (mrj = Marijuana, iem = Other)
. list decade hispanic_mrj_pct_decade hispanic_iem_pct_decade, table

     +------------------------------+
     | decade   h~mrj_~e   h~iem_~e |
     |------------------------------|
  1. |   1980   .0946822          . |
  2. |   1990   .0525621   .0348555 |
  3. |   2000   .0747826   .0484893 |
     +------------------------------+

. *Other race drug use by decade (mrj = Marijuana, iem = Other)
. list decade other_mrj_pct_decade other_iem_pct_decade, table

     +------------------------------+
     | decade   o~mrj_~e   o~iem_~e |
     |------------------------------|
  1. |   1980   .1619318          . |
  2. |   1990   .0649494   .0346906 |
  3. |   2000   .1025671   .0504611 |
     +------------------------------+

. 
. restore

. preserve

. 
. collapse white_sum_pct_period black_sum_pct_period hispanic_sum_pct_period other_sum_pct_period, by(period)

. *Any drug use in last month
. list period white_sum_pct_period black_sum_pct_period hispanic_sum_pct_period other_sum_pct_period

     +-------------------------------------------------------+
     |    period   white_~d   black_~d   hispan~d   other_~d |
     |-------------------------------------------------------|
  1. |     1980s   .1487675   .1843475   .1217482    .189441 |
  2. | 1990-2006   .1276276   .1211804   .0866095   .1141707 |
     +-------------------------------------------------------+

. 
. restore

. 
. **GENDER/SEX********************************************************************
. 
. fre gender

gender
------------------------------------------------------------
               |      Freq.    Percent      Valid       Cum.
---------------+--------------------------------------------
Valid   0      |     234180      54.60      54.60      54.60
        1 male |     194691      45.40      45.40     100.00
        Total  |     428871     100.00     100.00           
------------------------------------------------------------

. 
. gen women = 0

. replace women = 1 if gender == 0
(234,180 real changes made)

. 
. gen men = 0

. replace men = 1 if gender == 1
(194,691 real changes made)

. 
. local drugs sum mrj iem

. foreach d of local drugs {
  2.         gen men_`d' = men*(`d'mon)
  3.         replace men_`d' = . if `d'mon == .
  4.         
.         gen women_`d' = women*(`d'mon)
  5.         replace women_`d' = . if `d'mon == .
  6. }
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)

. 
. local gender men women

. local drugs sum mrj iem

. foreach y of local gender {
  2.         foreach z of local drugs {
  3.                 bysort decade: egen `y'_decade_nm_`z' = total(`y') if `y'_`z' != .
  4.                 bysort period: egen `y'_period_nm_`z' = total(`y') if `y'_`z' != .
  5.                 
.                 *Decadal totals and percent
.                 bysort decade: egen `y'_`z'_decade = total(`y'_`z')
  6.                 gen `y'_`z'_pct_decade = `y'_`z'_decade/`y'_decade_nm_`z'
  7.                 replace `y'_`z'_pct_decade = . if `y'_`z'_pct_decade == 0
  8.                 
.                 *Period totals and percent
.                 bysort period: egen `y'_`z'_period = total(`y'_`z')
  9.                 gen `y'_`z'_pct_period = `y'_`z'_period/`y'_period_nm_`z'
 10.                 replace `y'_`z'_pct_period = . if `y'_`z'_pct_period == 0
 11.                 }
 12.         }
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)

. 
. preserve

.          
. collapse men_mrj_pct_decade men_iem_pct_decade ///
>                  women_mrj_pct_decade women_iem_pct_decade, by(decade)

. 
. *Total percent within decade
. *Men drug use by decade (mrj = Marijuana, iem = Other)
. list decade men_mrj_pct_decade men_iem_pct_decade, table

     +------------------------------+
     | decade   men_mr~e   men_ie~e |
     |------------------------------|
  1. |   1980   .1968735          . |
  2. |   1990    .109515   .0504978 |
  3. |   2000   .1409855   .0649365 |
     +------------------------------+

. *Women drug use by decade (mrj = Marijuana, iem = Other)
. list decade women_mrj_pct_decade women_iem_pct_decade, table

     +------------------------------+
     | decade   w~mrj_~e   w~iem_~e |
     |------------------------------|
  1. |   1980   .1006066          . |
  2. |   1990   .0552748   .0307033 |
  3. |   2000   .0803182   .0453399 |
     +------------------------------+

. 
. restore

. preserve

. 
. collapse men_sum_pct_period women_sum_pct_period, by(period)

. *Any drug use in last month
. list period men_sum_pct_period women_sum_pct_period

     +---------------------------------+
     |    period   men_su~d   women_~d |
     |---------------------------------|
  1. |     1980s   .2102746   .1205306 |
  2. | 1990-2006   .1523514   .0907301 |
     +---------------------------------+

. 
. restore

. 
. **AGE***************************************************************************
. 
. fre age

age
--------------------------------------------------------------
                 |      Freq.    Percent      Valid       Cum.
-----------------+--------------------------------------------
Valid   7  18    |      27575       6.43       6.43       6.43
        8  19    |      25000       5.83       5.83      12.26
        9  20    |      24028       5.60       5.60      17.86
        10 21    |      23852       5.56       5.56      23.42
        11 22-23 |      47748      11.13      11.13      34.56
        12 24-25 |      48069      11.21      11.21      45.76
        13 26-29 |      45257      10.55      10.55      56.32
        14 30-34 |      58455      13.63      13.63      69.95
        15 35-49 |      92105      21.48      21.48      91.42
        16 50-64 |      36782       8.58       8.58     100.00
        Total    |     428871     100.00     100.00           
--------------------------------------------------------------

. gen young = 0

. replace young = 1 if age <=12
(196,272 real changes made)

. 
. gen old = 0

. replace old = 1 if age > 12
(232,599 real changes made)

. 
. local drugs sum mrj iem

. foreach d of local drugs {
  2.         gen young_`d' = 0 if young == 1
  3.         replace young_`d' = 1 if `d'mon == 1 & young == 1
  4.         replace young_`d' = . if `d'mon == .
  5.         
.         gen old_`d' = 0 if old == 1
  6.         replace old_`d' = 1 if `d'mon == 1 & old == 1
  7.         replace old_`d' = . if `d'mon == .
  8. }
(232,599 missing values generated)
(34,484 real changes made)
(1,283 real changes made, 1,283 to missing)
(196,272 missing values generated)
(16,613 real changes made)
(2,468 real changes made, 2,468 to missing)
(232,599 missing values generated)
(29,629 real changes made)
(0 real changes made)
(196,272 missing values generated)
(12,764 real changes made)
(0 real changes made)
(232,599 missing values generated)
(13,083 real changes made)
(8,696 real changes made, 8,696 to missing)
(196,272 missing values generated)
(6,533 real changes made)
(16,628 real changes made, 16,628 to missing)

. 
. local ages young old 

. local drugs sum mrj iem

. foreach y of local ages {
  2.         foreach z of local drugs {
  3.                 *Decadal totals and percent
.                 bysort decade: egen `y'_decade_nm_`z' = total(`y') if `y'_`z' != .
  4.                 bysort period: egen `y'_period_nm_`z' = total(`y') if `y'_`z' != .
  5.                 
.                 *Decadal totals and percent
.                 bysort decade: egen `y'_`z'_decade = total(`y'_`z')
  6.                 gen `y'_`z'_pct_decade = `y'_`z'_decade/`y'_decade_nm_`z'
  7.                 replace `y'_`z'_pct_decade = . if `y'_`z'_pct_decade == 0
  8.                 
.                 *Period totals and percent
.                 bysort period: egen `y'_`z'_period = total(`y'_`z')
  9.                 gen `y'_`z'_pct_period = `y'_`z'_period/`y'_period_nm_`z'
 10.                 replace `y'_`z'_pct_period = . if `y'_`z'_pct_period == 0
 11.                 }
 12.         }
(233882 missing values generated)
(233882 missing values generated)
(233,882 missing values generated)
(0 real changes made)
(233,882 missing values generated)
(0 real changes made)
(232599 missing values generated)
(232599 missing values generated)
(232,599 missing values generated)
(0 real changes made)
(232,599 missing values generated)
(0 real changes made)
(241295 missing values generated)
(241295 missing values generated)
(241,295 missing values generated)
(0 real changes made)
(241,295 missing values generated)
(0 real changes made)
(198740 missing values generated)
(198740 missing values generated)
(198,740 missing values generated)
(0 real changes made)
(198,740 missing values generated)
(0 real changes made)
(196272 missing values generated)
(196272 missing values generated)
(196,272 missing values generated)
(0 real changes made)
(196,272 missing values generated)
(0 real changes made)
(212900 missing values generated)
(212900 missing values generated)
(212,900 missing values generated)
(0 real changes made)
(212,900 missing values generated)
(0 real changes made)

. 
. preserve

.                  
. collapse young_mrj_pct_decade young_iem_pct_decade ///
>                  old_mrj_pct_decade old_iem_pct_decade, by(decade)

. 
. *Total percent within decade
. *<26 drug use by decade (mrj = Marijuana, iem = Other)
. list decade young_mrj_pct_decade young_iem_pct_decade, table

     +------------------------------+
     | decade   y~mrj_~e   y~iem_~e |
     |------------------------------|
  1. |   1980   .2375075          . |
  2. |   1990   .1212011   .0553572 |
  3. |   2000   .1612577   .0766926 |
     +------------------------------+

. *>25 drug use by decade (mrj = Marijuana, iem = Other)
. list decade old_mrj_pct_decade old_iem_pct_decade, table

     +------------------------------+
     | decade   old_mr~e   old_ie~e |
     |------------------------------|
  1. |   1980   .0907089          . |
  2. |   1990   .0521062   .0290377 |
  3. |   2000   .0535262   .0312118 |
     +------------------------------+

. 
. restore

. preserve

. 
. collapse young_sum_pct_period old_sum_pct_period, by(period)

. *Any drug use in last month
. list period young_sum_pct_period old_sum_pct_period

     +---------------------------------+
     |    period   young_~d   old_su~d |
     |---------------------------------|
  1. |     1980s   .2581608   .1045858 |
  2. | 1990-2006   .1745523   .0707498 |
     +---------------------------------+

. 
. restore

. 
. **EDUCATION*********************************************************************
. 
. fre educcat2

educcat2 -- EDUCATION RECODE
-----------------------------------------------------------------------------
                                |      Freq.    Percent      Valid       Cum.
--------------------------------+--------------------------------------------
Valid   1 Less than high school |      82529      19.24      19.24      19.24
        2 High school graduate  |     146978      34.27      34.27      53.52
        3 Some college          |     116497      27.16      27.17      80.68
        4 College graduate      |      82841      19.32      19.32     100.00
        Total                   |     428845      99.99     100.00           
Missing .                       |         26       0.01                      
Total                           |     428871     100.00                      
-----------------------------------------------------------------------------

. 
. gen low = 0

. replace low = 1 if (educcat2 == 1 | educcat2 == 2)
(229,507 real changes made)

. 
. gen high = 0

. replace high = 1 if (educcat2 == 3 | educcat2 == 4)
(199,338 real changes made)

. 
. 
. local drugs sum mrj iem

. foreach d of local drugs {
  2.         gen low_`d' = 0 if low == 1
  3.         replace low_`d' = 1 if `d'mon == 1 & low == 1
  4.         replace low_`d' = . if `d'mon == .
  5.         
.         gen high_`d' = 0 if high == 1
  6.         replace high_`d' = 1 if `d'mon == 1 & high == 1
  7.         replace high_`d' = . if `d'mon == .
  8. }
(199,364 missing values generated)
(30,406 real changes made)
(2,089 real changes made, 2,089 to missing)
(229,533 missing values generated)
(20,691 real changes made)
(1,662 real changes made, 1,662 to missing)
(199,364 missing values generated)
(25,219 real changes made)
(0 real changes made)
(229,533 missing values generated)
(17,174 real changes made)
(0 real changes made)
(199,364 missing values generated)
(11,948 real changes made)
(15,440 real changes made, 15,440 to missing)
(229,533 missing values generated)
(7,668 real changes made)
(9,858 real changes made, 9,858 to missing)

. 
. local educ1 low high 

. local drugs sum mrj iem

. foreach y of local educ1 {
  2.         foreach z of local drugs {      
  3.                 *Decadal totals and percent
.                 bysort decade: egen `y'_decade_nm_`z' = total(`y') if `y'_`z' != .
  4.                 bysort period: egen `y'_period_nm_`z' = total(`y') if `y'_`z' != .
  5.                 
.                 *Decadal totals and percent
.                 bysort decade: egen `y'_`z'_decade = total(`y'_`z')
  6.                 gen `y'_`z'_pct_decade = `y'_`z'_decade/`y'_decade_nm_`z'
  7.                 replace `y'_`z'_pct_decade = . if `y'_`z'_pct_decade == 0
  8.                 
.                 *Period totals and percent
.                 bysort period: egen `y'_`z'_period = total(`y'_`z')
  9.                 gen `y'_`z'_pct_period = `y'_`z'_period/`y'_period_nm_`z'
 10.                 replace `y'_`z'_pct_period = . if `y'_`z'_pct_period == 0
 11.                 }
 12.         }
(201453 missing values generated)
(201453 missing values generated)
(201,453 missing values generated)
(0 real changes made)
(201,453 missing values generated)
(0 real changes made)
(199364 missing values generated)
(199364 missing values generated)
(199,364 missing values generated)
(0 real changes made)
(199,364 missing values generated)
(0 real changes made)
(214804 missing values generated)
(214804 missing values generated)
(214,804 missing values generated)
(0 real changes made)
(214,804 missing values generated)
(0 real changes made)
(231195 missing values generated)
(231195 missing values generated)
(231,195 missing values generated)
(0 real changes made)
(231,195 missing values generated)
(0 real changes made)
(229533 missing values generated)
(229533 missing values generated)
(229,533 missing values generated)
(0 real changes made)
(229,533 missing values generated)
(0 real changes made)
(239391 missing values generated)
(239391 missing values generated)
(239,391 missing values generated)
(0 real changes made)
(239,391 missing values generated)
(0 real changes made)

. 
. preserve

.                  
. collapse low_mrj_pct_decade low_iem_pct_decade ///
>                  high_mrj_pct_decade high_iem_pct_decade, by(decade)

. 
. *Total percent within decade
. *Low educated drug use by decade (mrj = Marijuana, iem = Other)
. list decade low_mrj_pct_decade low_iem_pct_decade, table

     +------------------------------+
     | decade   low_mr~e   low_ie~e |
     |------------------------------|
  1. |   1980   .1388794          . |
  2. |   1990   .0883847   .0455955 |
  3. |   2000   .1229541   .0630008 |
     +------------------------------+

. *Highly educated drug use by decade (mrj = Marijuana, iem = Other)
. list decade high_mrj_pct_decade high_iem_pct_decade, table

     +------------------------------+
     | decade   high_m~e   high_i~e |
     |------------------------------|
  1. |   1980   .1483692          . |
  2. |   1990   .0664505   .0311401 |
  3. |   2000   .0939872   .0457231 |
     +------------------------------+

. 
. restore

. preserve

. 
. collapse low_sum_pct_period high_sum_pct_period, by(period)

. *Any drug use in last month
. list period low_sum_pct_period high_sum_pct_period

     +---------------------------------+
     |    period   low_su~d   high_s~d |
     |---------------------------------|
  1. |     1980s   .1564228   .1639906 |
  2. | 1990-2006   .1327014   .1029599 |
     +---------------------------------+

. 
. restore

. 
. **MUTALLY EXCLUSIVE GROUPS******************************************************
. 
. local educ1 low high

. local race black white

. local genders men women

. local drugs sum mrj iem

. foreach x of local educ1 {
  2.         foreach y of local race {
  3.                 foreach z of local genders {
  4.                         gen `x'_`y'_`z' = `x'*`y'*`z'
  5.                         foreach a of local drugs {
  6.                                 replace `x'_`y'_`z' = . if `a'mon == .
  7.                                 
.                                 gen `x'_`y'_`z'_`a' = `x'*`y'*`z'*(`a'mon)
  8.                                 replace `x'_`y'_`z'_`a' = . if `a'mon == .
  9.                                 
.                                 bysort decade: egen `x'_`y'_`z'_dec_nm_`a' = total(`x'_`y'_`z') if `x'_`y'_`z'_`a' != .
 10.                                 bysort period: egen `x'_`y'_`z'_per_nm_`a' = total(`x'_`y'_`z') if `x'_`y'_`z'_`a' != .
 11.                                 
.                                 *Decadal totals and percent
.                                 bysort decade: egen `x'_`y'_`z'_`a'_dec = total(`x'_`y'_`z'_`a')
 12.                                 gen `x'_`y'_`z'_`a'_pct_dec = `x'_`y'_`z'_`a'_dec/`x'_`y'_`z'_dec_nm_`a'
 13.                                 replace `x'_`y'_`z'_`a'_pct_dec = . if `x'_`y'_`z'_`a'_pct_dec == 0
 14.                                 
.                                 *Decadal totals and percent
.                                 bysort period: egen `x'_`y'_`z'_`a'_per = total(`x'_`y'_`z'_`a')
 15.                                 gen `x'_`y'_`z'_`a'_pct_per = `x'_`y'_`z'_`a'_per/`x'_`y'_`z'_per_nm_`a'
 16.                                 replace `x'_`y'_`z'_`a'_pct_per = . if `x'_`y'_`z'_`a'_pct_per == 0
 17.                                 }
 18.                         }
 19.                 }
 20.         }
(3,751 real changes made, 3,751 to missing)
(3,751 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21,573 real changes made, 21,573 to missing)
(25,324 missing values generated)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(3,751 real changes made, 3,751 to missing)
(3,751 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21,573 real changes made, 21,573 to missing)
(25,324 missing values generated)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(3,751 real changes made, 3,751 to missing)
(3,751 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21,573 real changes made, 21,573 to missing)
(25,324 missing values generated)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(3,751 real changes made, 3,751 to missing)
(3,751 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21,573 real changes made, 21,573 to missing)
(25,324 missing values generated)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(3,751 real changes made, 3,751 to missing)
(3,751 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21,573 real changes made, 21,573 to missing)
(25,324 missing values generated)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(3,751 real changes made, 3,751 to missing)
(3,751 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21,573 real changes made, 21,573 to missing)
(25,324 missing values generated)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(3,751 real changes made, 3,751 to missing)
(3,751 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21,573 real changes made, 21,573 to missing)
(25,324 missing values generated)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)
(3,751 real changes made, 3,751 to missing)
(3,751 missing values generated)
(0 real changes made)
(3751 missing values generated)
(3751 missing values generated)
(3,751 missing values generated)
(0 real changes made)
(3,751 missing values generated)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(21,573 real changes made, 21,573 to missing)
(25,324 missing values generated)
(0 real changes made)
(25324 missing values generated)
(25324 missing values generated)
(25,324 missing values generated)
(0 real changes made)
(25,324 missing values generated)
(0 real changes made)

. 
. preserve

. 
. collapse low_black_men_mrj_pct_dec low_black_men_iem_pct_dec ///
>                  high_black_men_mrj_pct_dec high_black_men_iem_pct_dec ///
>                  low_black_women_mrj_pct_dec low_black_women_iem_pct_dec ///
>                  high_black_women_mrj_pct_dec high_black_women_iem_pct_dec ///
>                  low_white_men_mrj_pct_dec low_white_men_iem_pct_dec ///
>                  high_white_men_mrj_pct_dec high_white_men_iem_pct_dec ///
>                  low_white_women_mrj_pct_dec low_white_women_iem_pct_dec ///
>                  high_white_women_mrj_pct_dec high_white_women_iem_pct_dec, by(decade)

. 
. *Total percent within decade
. *LS Black Men
. list decade low_black_men_mrj_pct_dec low_black_men_iem_pct_dec, table

     +------------------------------+
     | decade   low_bl..   low_bl.. |
     |------------------------------|
  1. |   1980   .2376564          . |
  2. |   1990    .154906   .0527888 |
  3. |   2000   .1863951   .0508583 |
     +------------------------------+

. *HS Black Men
. list decade high_black_men_mrj_pct_dec high_black_men_iem_pct_dec, table

     +------------------------------+
     | decade   high_b..   high_b.. |
     |------------------------------|
  1. |   1980   .2417686          . |
  2. |   1990    .095118   .0295238 |
  3. |   2000   .1297896   .0336656 |
     +------------------------------+

. *LS Black Women
. list decade low_black_women_mrj_pct_dec low_black_women_iem_pct_dec, table

     +------------------------------+
     | decade   low_bl..   low_bl.. |
     |------------------------------|
  1. |   1980   .1150174          . |
  2. |   1990    .077079   .0307404 |
  3. |   2000   .0965603   .0399917 |
     +------------------------------+

. *HS Black Women
. list decade high_black_women_mrj_pct_dec high_black_women_iem_pct_dec, table

     +------------------------------+
     | decade   high_b..   high_b.. |
     |------------------------------|
  1. |   1980   .1329618          . |
  2. |   1990   .0424171   .0200787 |
  3. |   2000   .0634681   .0226182 |
     +------------------------------+

. *LS White Men
. list decade low_white_men_mrj_pct_dec low_white_men_iem_pct_dec, table

     +------------------------------+
     | decade   low_wh..   low_wh.. |
     |------------------------------|
  1. |   1980   .1713062          . |
  2. |   1990    .138386   .0688768 |
  3. |   2000   .1715755    .083606 |
     +------------------------------+

. *HS White Men
. list decade high_white_men_mrj_pct_dec high_white_men_iem_pct_dec, table

     +------------------------------+
     | decade   high_w..   high_w.. |
     |------------------------------|
  1. |   1980   .1592301          . |
  2. |   1990   .0987458   .0430352 |
  3. |   2000   .1242251    .057699 |
     +------------------------------+

. *LS White Women
. list decade low_white_women_mrj_pct_dec low_white_women_iem_pct_dec, table

     +------------------------------+
     | decade   low_wh..   low_wh.. |
     |------------------------------|
  1. |   1980   .0977131          . |
  2. |   1990   .0701842   .0432246 |
  3. |   2000   .0966241   .0575639 |
     +------------------------------+

. *HS White Women
. list decade high_white_women_mrj_pct_dec high_white_women_iem_pct_dec, table

     +------------------------------+
     | decade   high_w..   high_w.. |
     |------------------------------|
  1. |   1980   .0840273          . |
  2. |   1990   .0536163   .0270457 |
  3. |   2000   .0768202   .0424416 |
     +------------------------------+

. 
. restore

. preserve

. 
. collapse low_black_men_sum_pct_per ///
>                  high_black_men_sum_pct_per ///
>                  low_black_women_sum_pct_per ///
>                  high_black_women_sum_pct_per ///
>                  low_white_men_sum_pct_per ///
>                  high_white_men_sum_pct_per ///
>                  low_white_women_sum_pct_per ///
>                  high_white_women_sum_pct_per, by(period)

. 
. *Any drug use - average 1990-2006
. *LS Black Men
. list period low_black_men_sum_pct_per, table

     +----------------------+
     |    period   low_bl.. |
     |----------------------|
  1. |     1980s   .2508229 |
  2. | 1990-2006     .19111 |
     +----------------------+

. *HS Black Men
. list period high_black_men_sum_pct_per, table

     +----------------------+
     |    period   high_b.. |
     |----------------------|
  1. |     1980s   .2558796 |
  2. | 1990-2006   .1272809 |
     +----------------------+

. *LS Black Women
. list period low_black_women_sum_pct_per, table

     +----------------------+
     |    period   low_bl.. |
     |----------------------|
  1. |     1980s   .1302083 |
  2. | 1990-2006   .1048921 |
     +----------------------+

. *HS Black Women
. list period high_black_women_sum_pct_per, table

     +----------------------+
     |    period   high_b.. |
     |----------------------|
  1. |     1980s   .1433121 |
  2. | 1990-2006   .0670589 |
     +----------------------+

. *LS White Men
. list period low_white_men_sum_pct_per, table

     +----------------------+
     |    period   low_wh.. |
     |----------------------|
  1. |     1980s   .1927195 |
  2. | 1990-2006   .1876781 |
     +----------------------+

. *HS White Men
. list period high_white_men_sum_pct_per, table

     +----------------------+
     |    period   high_w.. |
     |----------------------|
  1. |     1980s   .1819773 |
  2. | 1990-2006   .1360098 |
     +----------------------+

. *LS White Women
. list period low_white_women_sum_pct_per, table

     +----------------------+
     |    period   low_wh.. |
     |----------------------|
  1. |     1980s   .1237006 |
  2. | 1990-2006   .1113116 |
     +----------------------+

. *HS White Women
. list period high_white_women_sum_pct_per, table

     +----------------------+
     |    period   high_w.. |
     |----------------------|
  1. |     1980s   .1112793 |
  2. | 1990-2006   .0884207 |
     +----------------------+

. 
. restore

. 
. log close
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A2\appendix_table_a2.log
  log type:  text
 closed on:   6 Mar 2020, 19:49:26
-------------------------------------------------------------------------------------------------------------------------------------------------------------
