-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A4\specifications.log
  log type:  text
 opened on:   6 Mar 2020, 19:50:37

. /*****
> 
> Build up to preferred specification from basic D-in-D style spec.
> 
> *****/
> 
> set mem 6g ;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set matsize 800 ;

. set more off ;

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_March_CPS/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_March_CPS

. use Output/marcps.dta ;

. cd ../Tables/Appendix_Tables/Appx_table_A4/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A4

. *use "/afs/crc.nd.edu/user/a/awaggone/Private/Private/Drugs_2011/marcps.dta" ;
. *use "/afs/crc.nd.edu/user/a/awaggone/Private/Private/Drugs_2011/marcps_test.dta" ;
. /** Construct variables for estimation **/
> 
> * Pro and anti dummies, by state-year ;
. gen pro=0 ;

. replace pro=1 if (year>=yrpro & yrpro~=0) ;
(287,572 real changes made)

. gen anti=0 ;

. replace anti=1 if (year>=yranti & yranti~=0) ;
(119,778 real changes made)

. * Reduce education groups to 2 ;
. gen lowskill=1 if edgrp4==1 | edgrp4==2 ;
(1,354,018 missing values generated)

. replace lowskill=0 if edgrp4==3 | edgrp4==4 ;
(1,354,018 real changes made)

. gen young=(age<=25) ;

. summ young lowskill ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       young |  2,760,713    .2112277    .4081796          0          1
    lowskill |  2,760,713    .5095405    .4999091          0          1

. gen age2=age*age ;

. * demog-pro and anti interactions ;
. gen blackpro=black*pro ;

. gen hisppro=hisp*pro ;

. gen femalepro=female*pro ;

. gen youngpro=young*pro ;

. gen lowskillpro=lowskill*pro ;

. gen blackanti=black*anti ;

. gen hispanti=hisp*anti ;

. gen femaleanti=female*anti ;

. gen younganti=young*anti ;

. gen lowskillanti=lowskill*anti ;

. * Time cubics and their double interactions ;
. gen ttrend=year - 1980 ;

. sum ttrend ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ttrend |  2,760,713    15.82609    9.249745          0         30

. gen ttrend2=ttrend^2 ;

. gen ttrend3=ttrend^3 ;

. gen ttrendbl=ttrend*black ;

.  gen ttrend2bl=ttrend2*black ;

.  gen ttrend3bl=ttrend3*black ;

. gen ttrendhi=ttrend*hisp ;

.  gen ttrend2hi=ttrend2*hisp ;

.  gen ttrend3hi=ttrend3*hisp ;

. gen ttrendfe=ttrend*female ;

.  gen ttrend2fe=ttrend2*female ;

.  gen ttrend3fe=ttrend3*female ;

. gen ttrendyo=ttrend*young ;

.  gen ttrend2yo=ttrend2*young ;

.  gen ttrend3yo=ttrend3*young ;

. gen ttrendlo=ttrend*lowskill ;

.  gen ttrend2lo=ttrend2*lowskill ;

.  gen ttrend3lo=ttrend3*lowskill ;

. * State dummies and their interactions with demographics plus linear state trends ;
. char statefip[omit] 17 ;

.  * omit IL - set this so not omitting a pro or anti state ;
. /** Outcome variables **/
> 
> gen empdhi=1 if empd==1 & inlist(ind1,1,4,5,3,11)==1 ;
(2,189,585 missing values generated)

. replace empdhi=0 if empd==1 & inlist(ind1,1,4,5,3,11)~=1 ;
(1,504,219 real changes made)

. summ empdhi ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      empdhi |  2,075,347    .2751964    .4466133          0          1

. gen empdmid=1 if firmsizer==2 | firmsizer==3 ;
(2,292,171 missing values generated)

. replace empdmid=0 if firmsizer==1 | firmsizer==4 ;
(1,266,443 real changes made)

. gen empdlg=1 if firmsizer==4 ;
(2,005,557 missing values generated)

. replace empdlg=0 if firmsizer==1 | firmsizer==2 | firmsizer==3 ;
(979,829 real changes made)

. gen ph=. ;
(2,760,713 missing values generated)

. replace ph=1 if pensionr==1 | inclughr==1 ;
(1,524,078 real changes made)

. replace ph=0 if pensionr==0 & inclughr==0 ;
(764,615 real changes made)

. replace ph=. if pensionr==. | inclughr==. ;
(0 real changes made)

. summ empdmid empdlg ph ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     empdmid |  1,734,985    .2700554    .4439883          0          1
      empdlg |  1,734,985    .4352522    .4957901          0          1
          ph |  2,288,693    .6659163    .4716692          0          1

. gen lrhw=log(rhwage) ;
(608,313 missing values generated)

. /** Estimations **/
> 
> /** Main specification with DTI interactions **/
> 
> *** Spec 1: Basic DD - state and year FE plus linear state trends ;
. xi, prefix(_S) i.statefip*ttrend ;
i.statefip        _Sstatefip_1-56     (naturally coded; _Sstatefip_17 omitted)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)

. xi, prefix(_T) i.year ;
i.year            _Tyear_1980-2010    (naturally coded; _Tyear_1980 omitted)

. global controls blackpro hisppro femalepro youngpro lowskillpro pro
>   black hisp female lowskill age age2
>   _T* _S* ;

.   global outvars blackpro hisppro femalepro youngpro lowskillpro pro
>   black hisp female lowskill age age2 ;

.   reg empdhi $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 3,252,460,320)

Linear regression                               Number of obs     =  2,075,295
                                                F(40, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0586
                                                Root MSE          =     .43478

                               (Std. Err. adjusted for 50 clusters in statefip)
-------------------------------------------------------------------------------
              |               Robust
       empdhi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     blackpro |   .0169048   .0134351     1.26   0.214     -.010094    .0439036
      hisppro |  -.0157664   .0111184    -1.42   0.163    -.0381097    .0065769
    femalepro |   .0049297   .0132838     0.37   0.712    -.0217652    .0316245
     youngpro |  -.0037567    .007646    -0.49   0.625    -.0191218    .0116085
  lowskillpro |   -.010642   .0152331    -0.70   0.488    -.0412541    .0199702
          pro |   .0002417   .0086555     0.03   0.978    -.0171521    .0176355
        black |   .0390083   .0065142     5.99   0.000     .0259175    .0520991
         hisp |   .0046139   .0094712     0.49   0.628    -.0144192    .0236469
       female |  -.1460626   .0091005   -16.05   0.000    -.1643508   -.1277745
     lowskill |   .0577674    .007997     7.22   0.000     .0416968    .0738379
          age |   .0227033   .0007726    29.39   0.000     .0211507    .0242558
         age2 |  -.0002514   9.53e-06   -26.38   0.000    -.0002706   -.0002323
  _Tyear_1981 |  -.0057334   .0032407    -1.77   0.083    -.0122458    .0007791
  _Tyear_1982 |  -.0145562   .0042969    -3.39   0.001    -.0231911   -.0059213
  _Tyear_1983 |  -.0279511    .004474    -6.25   0.000    -.0369419   -.0189603
  _Tyear_1984 |  -.0276014    .005028    -5.49   0.000    -.0377054   -.0174973
  _Tyear_1985 |  -.0297648   .0046375    -6.42   0.000    -.0390841   -.0204455
  _Tyear_1986 |  -.0366767   .0044446    -8.25   0.000    -.0456085    -.027745
  _Tyear_1987 |  -.0449251   .0045453    -9.88   0.000    -.0540593   -.0357909
  _Tyear_1988 |  -.0412535   .0047854    -8.62   0.000    -.0508702   -.0316369
  _Tyear_1989 |  -.0461498   .0052281    -8.83   0.000     -.056656   -.0356436
  _Tyear_1990 |  -.0527808   .0052348   -10.08   0.000    -.0633006    -.042261
  _Tyear_1991 |  -.0579119   .0049427   -11.72   0.000    -.0678447   -.0479792
  _Tyear_1992 |  -.0615565   .0049643   -12.40   0.000    -.0715326   -.0515803
  _Tyear_1993 |  -.0652841   .0050694   -12.88   0.000    -.0754714   -.0550968
  _Tyear_1994 |  -.0673751   .0057055   -11.81   0.000    -.0788407   -.0559095
  _Tyear_1995 |  -.0678656   .0051162   -13.26   0.000    -.0781471   -.0575841
  _Tyear_1996 |  -.0739455   .0043647   -16.94   0.000    -.0827167   -.0651742
  _Tyear_1997 |  -.0756726   .0044517   -17.00   0.000    -.0846186   -.0667267
  _Tyear_1998 |  -.0781143   .0051076   -15.29   0.000    -.0883784   -.0678501
  _Tyear_1999 |  -.0839367   .0044269   -18.96   0.000    -.0928328   -.0750406
  _Tyear_2000 |  -.0821711   .0042522   -19.32   0.000    -.0907163   -.0736259
  _Tyear_2001 |  -.0921553   .0034897   -26.41   0.000    -.0991681   -.0851425
  _Tyear_2002 |  -.1019141   .0039526   -25.78   0.000    -.1098571    -.093971
  _Tyear_2003 |  -.1210504   .0037842   -31.99   0.000    -.1286551   -.1134458
  _Tyear_2004 |  -.1250188   .0037919   -32.97   0.000    -.1326389   -.1173987
  _Tyear_2005 |  -.1278576   .0038125   -33.54   0.000    -.1355191   -.1201961
  _Tyear_2006 |  -.1301567   .0048168   -27.02   0.000    -.1398364    -.120477
  _Tyear_2007 |  -.1320715   .0041144   -32.10   0.000    -.1403396   -.1238033
  _Tyear_2008 |  -.1313033   .0036346   -36.13   0.000    -.1386073   -.1239993
  _Tyear_2009 |  -.1384785   .0034673   -39.94   0.000    -.1454463   -.1315107
  _Tyear_2010 |  -.1438141   .0041957   -34.28   0.000    -.1522457   -.1353824
 _Sstatefip_1 |   .0192519   .0022109     8.71   0.000     .0148088    .0236949
 _Sstatefip_2 |  -.0684235   .0026607   -25.72   0.000    -.0737704   -.0630766
 _Sstatefip_4 |  -.0878159   .0018297   -47.99   0.000    -.0914929   -.0841389
 _Sstatefip_5 |  -.0248715   .0026631    -9.34   0.000    -.0302233   -.0195198
 _Sstatefip_6 |   -.038612   .0011408   -33.85   0.000    -.0409046   -.0363194
 _Sstatefip_8 |  -.0541346    .000755   -71.70   0.000    -.0556518   -.0526173
 _Sstatefip_9 |   .0238226   .0003866    61.62   0.000     .0230457    .0245996
_Sstatefip_10 |  -.0014495   .0005937    -2.44   0.018    -.0026425   -.0002565
_Sstatefip_12 |  -.1128735   .0027367   -41.24   0.000    -.1183731   -.1073739
_Sstatefip_13 |  -.0047343   .0025799    -1.84   0.073    -.0099189    .0004503
_Sstatefip_15 |  -.1181079   .0006533  -180.78   0.000    -.1194208    -.116795
_Sstatefip_16 |  -.0905298    .002503   -36.17   0.000    -.0955597   -.0854999
_Sstatefip_18 |   .0402791   .0014639    27.52   0.000     .0373374    .0432209
_Sstatefip_19 |  -.0713508   .0022386   -31.87   0.000    -.0758495   -.0668521
_Sstatefip_20 |  -.0379876   .0004804   -79.08   0.000     -.038953   -.0370223
_Sstatefip_21 |  -.0045148   .0013182    -3.43   0.001    -.0071637   -.0018659
_Sstatefip_22 |  -.0842437   .0024613   -34.23   0.000      -.08919   -.0792974
_Sstatefip_23 |   .0115156    .001184     9.73   0.000     .0091363     .013895
_Sstatefip_24 |  -.0298288    .000724   -41.20   0.000    -.0312838   -.0283738
_Sstatefip_25 |   .0150699   .0006551    23.01   0.000     .0137535    .0163863
_Sstatefip_26 |   .0201198   .0005965    33.73   0.000     .0189211    .0213185
_Sstatefip_27 |  -.0541618   .0008711   -62.18   0.000    -.0559123   -.0524113
_Sstatefip_28 |  -.0022633   .0029029    -0.78   0.439    -.0080969    .0035703
_Sstatefip_29 |  -.0115813   .0006762   -17.13   0.000    -.0129402   -.0102225
_Sstatefip_30 |  -.1240454   .0008431  -147.13   0.000    -.1257396   -.1223512
_Sstatefip_31 |  -.1046147   .0007596  -137.72   0.000    -.1061412   -.1030882
_Sstatefip_32 |  -.1622548   .0005059  -320.71   0.000    -.1632715   -.1612381
_Sstatefip_33 |   .0557021   .0007911    70.41   0.000     .0541123    .0572919
_Sstatefip_34 |   .0092393   .0001588    58.17   0.000     .0089201    .0095585
_Sstatefip_35 |  -.1165511   .0024368   -47.83   0.000    -.1214481   -.1116541
_Sstatefip_36 |  -.0363133   .0002777  -130.75   0.000    -.0368714   -.0357552
_Sstatefip_37 |   .0681082   .0009601    70.94   0.000     .0661789    .0700376
_Sstatefip_38 |  -.1719276   .0008088  -212.58   0.000    -.1735529   -.1703023
_Sstatefip_39 |   .0286176   .0024783    11.55   0.000     .0236373    .0335978
_Sstatefip_40 |   -.027286   .0007443   -36.66   0.000    -.0287818   -.0257902
_Sstatefip_41 |  -.0389785   .0006838   -57.00   0.000    -.0403527   -.0376043
_Sstatefip_42 |    .005183   .0011735     4.42   0.000     .0028247    .0075412
_Sstatefip_44 |   .0425823   .0007777    54.76   0.000     .0410195    .0441451
_Sstatefip_45 |    .008048   .0037808     2.13   0.038     .0004502    .0156457
_Sstatefip_46 |  -.1366619   .0010474  -130.47   0.000    -.1387668    -.134557
_Sstatefip_47 |   .0577976   .0026054    22.18   0.000     .0525618    .0630333
_Sstatefip_48 |  -.0517718   .0011145   -46.45   0.000    -.0540115    -.049532
_Sstatefip_49 |  -.0239465   .0028403    -8.43   0.000    -.0296543   -.0182386
_Sstatefip_50 |   -.049469    .001018   -48.59   0.000    -.0515147   -.0474232
_Sstatefip_51 |  -.0036738   .0006377    -5.76   0.000    -.0049553   -.0023922
_Sstatefip_53 |  -.0480086   .0006928   -69.29   0.000    -.0494009   -.0466163
_Sstatefip_54 |   .0012504   .0018341     0.68   0.499    -.0024352    .0049361
_Sstatefip_55 |   .0052598   .0009243     5.69   0.000     .0034023    .0071173
_Sstatefip_56 |  -.0799143   .0007571  -105.55   0.000    -.0814358   -.0783929
 _SstaXttre_1 |  -.0000552   .0003455    -0.16   0.874    -.0007495     .000639
 _SstaXttre_2 |   .0025371   .0002922     8.68   0.000       .00195    .0031242
 _SstaXttre_4 |   .0016751   .0003129     5.35   0.000     .0010464    .0023038
 _SstaXttre_5 |   .0021994   .0002688     8.18   0.000     .0016592    .0027396
 _SstaXttre_6 |  -.0001116   .0000491    -2.27   0.027    -.0002102    -.000013
 _SstaXttre_8 |   .0003149   .0000266    11.83   0.000     .0002614    .0003684
 _SstaXttre_9 |  -.0021497   8.54e-06  -251.59   0.000    -.0021669   -.0021325
_SstaXttre_10 |   -.001628   .0000137  -119.25   0.000    -.0016555   -.0016006
_SstaXttre_12 |   .0012161   .0003222     3.77   0.000     .0005687    .0018635
_SstaXttre_13 |  -.0001778    .000358    -0.50   0.622    -.0008972    .0005417
_SstaXttre_15 |   .0017996   .0000197    91.20   0.000     .0017599    .0018392
_SstaXttre_16 |   .0028497   .0003139     9.08   0.000     .0022189    .0034804
_SstaXttre_18 |    .000338   .0000284    11.89   0.000     .0002809    .0003951
_SstaXttre_19 |   .0034369   .0003351    10.26   0.000     .0027635    .0041103
_SstaXttre_20 |   .0012444   .0000186    66.73   0.000      .001207    .0012819
_SstaXttre_21 |   .0003261   .0000273    11.93   0.000     .0002712    .0003811
_SstaXttre_22 |   .0023922   .0002733     8.75   0.000      .001843    .0029413
_SstaXttre_23 |  -.0021887   .0000321   -68.16   0.000    -.0022532   -.0021241
_SstaXttre_24 |  -.0004129   .0000154   -26.81   0.000    -.0004439    -.000382
_SstaXttre_25 |  -.0028557    .000014  -204.51   0.000    -.0028837   -.0028276
_SstaXttre_26 |   .0007044   .0000272    25.89   0.000     .0006497    .0007591
_SstaXttre_27 |   .0019687   .0000391    50.41   0.000     .0018902    .0020472
_SstaXttre_28 |   .0012626    .000366     3.45   0.001     .0005271    .0019981
_SstaXttre_29 |   .0002651    .000028     9.47   0.000     .0002089    .0003214
_SstaXttre_30 |   .0020003   .0000257    77.80   0.000     .0019486     .002052
_SstaXttre_31 |   .0034605   .0000199   174.07   0.000     .0034206    .0035005
_SstaXttre_32 |   .0018233   .0000528    34.53   0.000     .0017172    .0019294
_SstaXttre_33 |  -.0025732   .0000291   -88.50   0.000    -.0026317   -.0025148
_SstaXttre_34 |  -.0015076   .0000107  -141.21   0.000    -.0015291   -.0014861
_SstaXttre_35 |    .002862   .0000139   206.20   0.000     .0028341    .0028899
_SstaXttre_36 |  -.0006185   7.34e-06   -84.32   0.000    -.0006333   -.0006038
_SstaXttre_37 |  -.0030818   .0000155  -198.82   0.000    -.0031129   -.0030506
_SstaXttre_38 |   .0045825   .0000308   148.81   0.000     .0045207    .0046444
_SstaXttre_39 |  -.0004478   .0002874    -1.56   0.126    -.0010254    .0001297
_SstaXttre_40 |   .0012577   .0000178    70.62   0.000     .0012219    .0012934
_SstaXttre_41 |   .0009474   9.55e-06    99.16   0.000     .0009282    .0009666
_SstaXttre_42 |  -.0007003   .0000231   -30.25   0.000    -.0007468   -.0006537
_SstaXttre_44 |  -.0023279   .0000155  -150.31   0.000    -.0023591   -.0022968
_SstaXttre_45 |   .0007047   .0001959     3.60   0.001     .0003111    .0010984
_SstaXttre_46 |   .0039401   .0000307   128.26   0.000     .0038784    .0040018
_SstaXttre_47 |  -.0022931   .0003205    -7.15   0.000    -.0029371    -.001649
_SstaXttre_48 |   .0011855   .0000446    26.61   0.000      .001096    .0012751
_SstaXttre_49 |    .001439   .0003183     4.52   0.000     .0007993    .0020787
_SstaXttre_50 |    .000723   .0000308    23.50   0.000     .0006612    .0007849
_SstaXttre_51 |  -.0012835    .000012  -106.56   0.000    -.0013077   -.0012593
_SstaXttre_53 |   .0012614   .0000138    91.61   0.000     .0012337    .0012891
_SstaXttre_54 |  -.0000559   .0000322    -1.74   0.089    -.0001206    8.79e-06
_SstaXttre_55 |    .001212   .0000192    63.17   0.000     .0011735    .0012506
_SstaXttre_56 |   .0036613   .0000275   133.32   0.000     .0036061    .0037165
        _cons |  -.0532424    .013029    -4.09   0.000    -.0794251   -.0270597
-------------------------------------------------------------------------------

. estimates store empdhi1 ;

. *** Spec 2: Add demog group specific state FE to Spec 1 ;
. drop _S* ;

. xi, prefix(_S) i.statefip*black i.statefip*hisp i.statefip*female i.statefip*young i.statefip*lowskill 
>   i.statefip*ttrend ;
i.statefip        _Sstatefip_1-56     (naturally coded; _Sstatefip_17 omitted)
i.state~p*black   _SstaXblac_#        (coded as above)
i.statefip*hisp   _SstaXhisp_#        (coded as above)
i.stat~p*female   _SstaXfema_#        (coded as above)
i.state~p*young   _SstaXyoun_#        (coded as above)
i.stat~p*lows~l   _SstaXlows_#        (coded as above)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)

. reg empdhi $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 3,252,460,320)

Linear regression                               Number of obs     =  2,075,295
                                                F(36, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0637
                                                Root MSE          =     .43362

                               (Std. Err. adjusted for 50 clusters in statefip)
-------------------------------------------------------------------------------
              |               Robust
       empdhi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     blackpro |   .0048989   .0099435     0.49   0.624    -.0150832     .024881
      hisppro |  -.0319994    .008667    -3.69   0.001    -.0494164   -.0145823
    femalepro |   .0048129   .0083527     0.58   0.567    -.0119725    .0215982
     youngpro |  -.0108361   .0067682    -1.60   0.116    -.0244374    .0027652
  lowskillpro |  -.0276135   .0047734    -5.78   0.000    -.0372061   -.0180209
          pro |   .0119605   .0099399     1.20   0.235    -.0080145    .0319354
        black |   .0527557   .0001244   424.19   0.000     .0525058    .0530056
         hisp |   .0715929    .000459   155.97   0.000     .0706705    .0725154
       female |  -.1618107   .0000595 -2718.39   0.000    -.1619303   -.1616911
     lowskill |    .078106   .0002334   334.67   0.000      .077637     .078575
          age |   .0212892   .0010391    20.49   0.000      .019201    .0233774
         age2 |  -.0002355   .0000125   -18.81   0.000    -.0002606   -.0002103
  _Tyear_1981 |  -.0056979   .0032501    -1.75   0.086    -.0122292    .0008335
  _Tyear_1982 |  -.0146255   .0043335    -3.37   0.001     -.023334   -.0059169
  _Tyear_1983 |  -.0282196    .004456    -6.33   0.000    -.0371743    -.019265
  _Tyear_1984 |  -.0279756    .005145    -5.44   0.000    -.0383149   -.0176362
  _Tyear_1985 |  -.0299774   .0048248    -6.21   0.000    -.0396731   -.0202817
  _Tyear_1986 |  -.0369963   .0047349    -7.81   0.000    -.0465114   -.0274811
  _Tyear_1987 |  -.0454974   .0049389    -9.21   0.000    -.0554224   -.0355724
  _Tyear_1988 |  -.0421114   .0050522    -8.34   0.000    -.0522643   -.0319586
  _Tyear_1989 |  -.0468107   .0049928    -9.38   0.000    -.0568441   -.0367774
  _Tyear_1990 |  -.0533464   .0050867   -10.49   0.000    -.0635685   -.0431243
  _Tyear_1991 |   -.058245   .0048118   -12.10   0.000    -.0679147   -.0485752
  _Tyear_1992 |  -.0622238   .0047904   -12.99   0.000    -.0718505   -.0525971
  _Tyear_1993 |  -.0660471   .0051596   -12.80   0.000    -.0764157   -.0556785
  _Tyear_1994 |   -.067856   .0054694   -12.41   0.000    -.0788472   -.0568647
  _Tyear_1995 |  -.0684623   .0050476   -13.56   0.000    -.0786057   -.0583188
  _Tyear_1996 |  -.0743482   .0046076   -16.14   0.000    -.0836075   -.0650889
  _Tyear_1997 |  -.0761591   .0043672   -17.44   0.000    -.0849353   -.0673829
  _Tyear_1998 |  -.0787546   .0047747   -16.49   0.000    -.0883497   -.0691595
  _Tyear_1999 |  -.0846296   .0043275   -19.56   0.000    -.0933259   -.0759332
  _Tyear_2000 |  -.0828383   .0039744   -20.84   0.000    -.0908252   -.0748513
  _Tyear_2001 |    -.09262   .0041141   -22.51   0.000    -.1008876   -.0843524
  _Tyear_2002 |  -.1026805   .0039546   -25.96   0.000    -.1106275   -.0947334
  _Tyear_2003 |  -.1217961   .0046778   -26.04   0.000    -.1311965   -.1123958
  _Tyear_2004 |  -.1258292   .0040427   -31.13   0.000    -.1339533   -.1177051
  _Tyear_2005 |  -.1285816   .0039282   -32.73   0.000    -.1364757   -.1206876
  _Tyear_2006 |  -.1308378   .0041269   -31.70   0.000    -.1391311   -.1225444
  _Tyear_2007 |  -.1328848   .0039905   -33.30   0.000     -.140904   -.1248656
  _Tyear_2008 |  -.1321964   .0040688   -32.49   0.000    -.1403729   -.1240198
  _Tyear_2009 |  -.1398758   .0041469   -33.73   0.000    -.1482094   -.1315422
  _Tyear_2010 |  -.1452464   .0045162   -32.16   0.000     -.154322   -.1361707
 _Sstatefip_1 |   .0067112   .0028031     2.39   0.021     .0010782    .0123443
 _Sstatefip_2 |  -.0444442   .0028443   -15.63   0.000    -.0501601   -.0387282
 _Sstatefip_4 |  -.0739599   .0036949   -20.02   0.000    -.0813852   -.0665347
 _Sstatefip_5 |  -.0700403   .0028512   -24.57   0.000      -.07577   -.0643107
 _Sstatefip_6 |   -.035711   .0008865   -40.28   0.000    -.0374925   -.0339295
 _Sstatefip_8 |  -.0345296   .0009273   -37.24   0.000    -.0363931   -.0326661
 _Sstatefip_9 |   .0331723   .0008917    37.20   0.000     .0313804    .0349642
_Sstatefip_10 |   .0426654    .000894    47.72   0.000     .0408687     .044462
_Sstatefip_12 |  -.1025141   .0033003   -31.06   0.000    -.1091463    -.095882
_Sstatefip_13 |  -.0393625   .0029153   -13.50   0.000     -.045221    -.033504
_Sstatefip_15 |  -.1060836   .0008963  -118.35   0.000    -.1078848   -.1042824
_Sstatefip_16 |  -.0927496   .0032454   -28.58   0.000    -.0992715   -.0862277
_Sstatefip_18 |   .0464689   .0009444    49.20   0.000      .044571    .0483668
_Sstatefip_19 |  -.0797106   .0028249   -28.22   0.000    -.0853876   -.0740337
_Sstatefip_20 |  -.0266921   .0009545   -27.96   0.000    -.0286103    -.024774
_Sstatefip_21 |   .0024575   .0008443     2.91   0.005     .0007607    .0041542
_Sstatefip_22 |  -.0510786   .0025374   -20.13   0.000    -.0561777   -.0459794
_Sstatefip_23 |   -.006543   .0009745    -6.71   0.000    -.0085014   -.0045847
_Sstatefip_24 |  -.0230283   .0009505   -24.23   0.000    -.0249384   -.0211181
_Sstatefip_25 |   .0143899    .000834    17.25   0.000     .0127139    .0160659
_Sstatefip_26 |   .0744933   .0009286    80.22   0.000     .0726271    .0763595
_Sstatefip_27 |  -.0377306    .000867   -43.52   0.000    -.0394729   -.0359883
_Sstatefip_28 |  -.0317719   .0028329   -11.22   0.000    -.0374647   -.0260791
_Sstatefip_29 |  -.0167277   .0009229   -18.12   0.000    -.0185823    -.014873
_Sstatefip_30 |  -.1190721    .000957  -124.42   0.000    -.1209952   -.1171489
_Sstatefip_31 |   -.120135   .0009203  -130.54   0.000    -.1219845   -.1182856
_Sstatefip_32 |   -.148368   .0010935  -135.68   0.000    -.1505655   -.1461704
_Sstatefip_33 |   .0566087   .0009558    59.23   0.000     .0546881    .0585294
_Sstatefip_34 |   .0127009   .0009155    13.87   0.000     .0108611    .0145406
_Sstatefip_35 |  -.1121784   .0009778  -114.72   0.000    -.1141434   -.1102133
_Sstatefip_36 |  -.0284894   .0009059   -31.45   0.000    -.0303099    -.026669
_Sstatefip_37 |   .0156156   .0009389    16.63   0.000     .0137288    .0175025
_Sstatefip_38 |  -.1668585   .0008569  -194.72   0.000    -.1685805   -.1651364
_Sstatefip_39 |   .0489772   .0026933    18.19   0.000     .0435648    .0543895
_Sstatefip_40 |   .0010983   .0008991     1.22   0.228    -.0007085    .0029051
_Sstatefip_41 |  -.0205508   .0010801   -19.03   0.000    -.0227213   -.0183803
_Sstatefip_42 |   .0148641   .0009407    15.80   0.000     .0129736    .0167546
_Sstatefip_44 |   .0124312    .000832    14.94   0.000     .0107593    .0141032
_Sstatefip_45 |  -.0173613   .0062759    -2.77   0.008    -.0299733   -.0047494
_Sstatefip_46 |  -.1596536   .0009242  -172.75   0.000    -.1615109   -.1577964
_Sstatefip_47 |   .0247918   .0028665     8.65   0.000     .0190313    .0305522
_Sstatefip_48 |  -.0189415   .0008849   -21.41   0.000    -.0207197   -.0171633
_Sstatefip_49 |  -.0298906   .0033464    -8.93   0.000    -.0366155   -.0231657
_Sstatefip_50 |  -.0624566   .0009397   -66.46   0.000    -.0643451   -.0605681
_Sstatefip_51 |   .0041835   .0009415     4.44   0.000     .0022915    .0060756
_Sstatefip_53 |  -.0182216   .0010568   -17.24   0.000    -.0203452   -.0160979
_Sstatefip_54 |   .0604202   .0009418    64.16   0.000     .0585277    .0623127
_Sstatefip_55 |   .0133836   .0009521    14.06   0.000     .0114704    .0152968
_Sstatefip_56 |  -.0243871   .0009623   -25.34   0.000     -.026321   -.0224532
 _SstaXblac_1 |  -.0107872   .0054253    -1.99   0.052    -.0216898    .0001154
 _SstaXblac_2 |  -.0831835   .0030674   -27.12   0.000    -.0893478   -.0770193
 _SstaXblac_4 |  -.0435013   .0070161    -6.20   0.000    -.0576006    -.029402
 _SstaXblac_5 |   .0224276   .0033787     6.64   0.000     .0156379    .0292174
 _SstaXblac_6 |  -.0026856   .0001103   -24.34   0.000    -.0029073   -.0024639
 _SstaXblac_8 |   .0135141   .0001402    96.38   0.000     .0132323    .0137958
 _SstaXblac_9 |  -.0114742   .0001361   -84.29   0.000    -.0117478   -.0112006
_SstaXblac_10 |   .0089404   .0001072    83.42   0.000     .0087251    .0091558
_SstaXblac_12 |  -.0162544   .0041949    -3.87   0.000    -.0246843   -.0078246
_SstaXblac_13 |   .0067094   .0051515     1.30   0.199    -.0036429    .0170617
_SstaXblac_15 |  -.1418744   .0003182  -445.90   0.000    -.1425138    -.141235
_SstaXblac_16 |   .0489211   .0067198     7.28   0.000     .0354171    .0624251
_SstaXblac_18 |  -.0302495   .0001251  -241.89   0.000    -.0305008   -.0299982
_SstaXblac_19 |   -.034049   .0063526    -5.36   0.000     -.046815    -.021283
_SstaXblac_20 |   .0028258   .0001585    17.83   0.000     .0025073    .0031443
_SstaXblac_21 |  -.0283596   .0002131  -133.07   0.000    -.0287878   -.0279313
_SstaXblac_22 |  -.0308679   .0027516   -11.22   0.000    -.0363974   -.0253383
_SstaXblac_23 |   .0793687   .0004426   179.32   0.000     .0784793    .0802581
_SstaXblac_24 |    .030489   .0000971   314.13   0.000     .0302939     .030684
_SstaXblac_25 |  -.0511419   .0001676  -305.14   0.000    -.0514788   -.0508051
_SstaXblac_26 |   .0048786   .0000631    77.33   0.000     .0047518    .0050053
_SstaXblac_27 |  -.0200515   .0002575   -77.86   0.000     -.020569    -.019534
_SstaXblac_28 |   .0465494   .0042595    10.93   0.000     .0379895    .0551092
_SstaXblac_29 |  -.0440101   .0000809  -544.19   0.000    -.0441726   -.0438476
_SstaXblac_30 |  -.1513202   .0004615  -327.92   0.000    -.1522476   -.1503929
_SstaXblac_31 |  -.0311151   .0001517  -205.07   0.000      -.03142   -.0308102
_SstaXblac_32 |  -.0636807    .000199  -319.95   0.000    -.0640806   -.0632807
_SstaXblac_33 |  -.0681577   .0003108  -219.31   0.000    -.0687822   -.0675331
_SstaXblac_34 |   .0110792   .0001067   103.82   0.000     .0108647    .0112936
_SstaXblac_35 |  -.0277664   .0002163  -128.34   0.000    -.0282012   -.0273317
_SstaXblac_36 |  -.0563289    .000085  -662.77   0.000    -.0564997   -.0561581
_SstaXblac_37 |  -.0012351   .0001105   -11.18   0.000    -.0014572   -.0010131
_SstaXblac_38 |  -.1103172   .0003726  -296.09   0.000    -.1110659   -.1095685
_SstaXblac_39 |   -.036985   .0036525   -10.13   0.000     -.044325   -.0296449
_SstaXblac_40 |  -.0418865   .0001258  -333.06   0.000    -.0421392   -.0416338
_SstaXblac_41 |  -.0104391   .0001417   -73.67   0.000    -.0107238   -.0101543
_SstaXblac_42 |   -.061181   .0000976  -626.61   0.000    -.0613772   -.0609848
_SstaXblac_44 |  -.0198101   .0002432   -81.45   0.000    -.0202989   -.0193213
_SstaXblac_45 |   .0427462   .0086091     4.97   0.000     .0254456    .0600468
_SstaXblac_46 |   .2222952   .0003971   559.83   0.000     .2214973    .2230932
_SstaXblac_47 |  -.0289069   .0044292    -6.53   0.000    -.0378077   -.0200062
_SstaXblac_48 |  -.0122196   .0001417   -86.26   0.000    -.0125043    -.011935
_SstaXblac_49 |  -.0507447   .0059755    -8.49   0.000     -.062753   -.0387364
_SstaXblac_50 |   .0269303   .0006242    43.14   0.000      .025676    .0281846
_SstaXblac_51 |   .0146872   .0000967   151.94   0.000      .014493    .0148815
_SstaXblac_53 |  -.0495092   .0002148  -230.46   0.000    -.0499409   -.0490775
_SstaXblac_54 |  -.0398267   .0002353  -169.27   0.000    -.0402995   -.0393538
_SstaXblac_55 |  -.0724024   .0001453  -498.20   0.000    -.0726944   -.0721103
_SstaXblac_56 |  -.0968957   .0002692  -360.00   0.000    -.0974365   -.0963548
 _SstaXhisp_1 |  -.0211607   .0080183    -2.64   0.011    -.0372742   -.0050472
 _SstaXhisp_2 |  -.1144847   .0042349   -27.03   0.000    -.1229951   -.1059742
 _SstaXhisp_4 |   -.049055   .0063566    -7.72   0.000    -.0618291   -.0362809
 _SstaXhisp_5 |   .0573526   .0057512     9.97   0.000     .0457951    .0689102
 _SstaXhisp_6 |  -.0393294   .0002755  -142.75   0.000    -.0398831   -.0387757
 _SstaXhisp_8 |  -.0338222   .0003657   -92.48   0.000    -.0345571   -.0330872
 _SstaXhisp_9 |  -.0336215   .0002794  -120.33   0.000     -.034183     -.03306
_SstaXhisp_10 |  -.0542681   .0002606  -208.25   0.000    -.0547917   -.0537444
_SstaXhisp_12 |   -.049564   .0045504   -10.89   0.000    -.0587085   -.0404196
_SstaXhisp_13 |  -.0444659   .0072097    -6.17   0.000    -.0589542   -.0299775
_SstaXhisp_15 |  -.0844713   .0003614  -233.76   0.000    -.0851975   -.0837451
_SstaXhisp_16 |  -.0089205   .0052716    -1.69   0.097    -.0195143    .0016732
_SstaXhisp_18 |  -.0278984   .0003396   -82.16   0.000    -.0285808    -.027216
_SstaXhisp_19 |   .1424877   .0074567    19.11   0.000     .1275028    .1574725
_SstaXhisp_20 |  -.0613396    .000257  -238.64   0.000    -.0618562   -.0608231
_SstaXhisp_21 |  -.1592656   .0003415  -466.38   0.000    -.1599519   -.1585793
_SstaXhisp_22 |    -.09559   .0029522   -32.38   0.000    -.1015226   -.0896573
_SstaXhisp_23 |  -.1215672   .0003889  -312.63   0.000    -.1223487   -.1207858
_SstaXhisp_24 |  -.1692433   .0002569  -658.74   0.000    -.1697596    -.168727
_SstaXhisp_25 |  -.0433085   .0002486  -174.22   0.000     -.043808   -.0428089
_SstaXhisp_26 |  -.0301748   .0002452  -123.09   0.000    -.0306675   -.0296822
_SstaXhisp_27 |  -.0602099   .0003527  -170.71   0.000    -.0609187   -.0595011
_SstaXhisp_28 |   .0087677   .0074002     1.18   0.242    -.0061035     .023639
_SstaXhisp_29 |  -.0521507   .0003857  -135.20   0.000    -.0529258   -.0513755
_SstaXhisp_30 |  -.1218004   .0003034  -401.48   0.000    -.1224101   -.1211908
_SstaXhisp_31 |   .0837188   .0003522   237.71   0.000     .0830111    .0844266
_SstaXhisp_32 |  -.1279806   .0002739  -467.25   0.000    -.1285311   -.1274302
_SstaXhisp_33 |  -.0093501   .0003603   -25.95   0.000    -.0100743    -.008626
_SstaXhisp_34 |   .0030633   .0002679    11.43   0.000     .0025249    .0036018
_SstaXhisp_35 |  -.0463544   .0003806  -121.78   0.000    -.0471193   -.0455895
_SstaXhisp_36 |  -.0763471   .0003063  -249.24   0.000    -.0769627   -.0757316
_SstaXhisp_37 |  -.1298395   .0003268  -397.30   0.000    -.1304963   -.1291828
_SstaXhisp_38 |  -.0159554   .0004676   -34.12   0.000     -.016895   -.0150157
_SstaXhisp_39 |  -.0490203   .0053597    -9.15   0.000     -.059791   -.0382497
_SstaXhisp_40 |  -.1264855   .0002955  -428.04   0.000    -.1270793   -.1258916
_SstaXhisp_41 |  -.1049356   .0002273  -461.72   0.000    -.1053923   -.1044789
_SstaXhisp_42 |  -.0303477   .0003077   -98.62   0.000    -.0309661   -.0297293
_SstaXhisp_44 |   .0931219   .0002577   361.40   0.000     .0926041    .0936397
_SstaXhisp_45 |  -.1282734   .0086019   -14.91   0.000    -.1455596   -.1109872
_SstaXhisp_46 |   .0309398   .0003858    80.20   0.000     .0301645    .0317151
_SstaXhisp_47 |  -.0956736   .0077507   -12.34   0.000    -.1112491   -.0800981
_SstaXhisp_48 |  -.0881095   .0002981  -295.59   0.000    -.0887086   -.0875105
_SstaXhisp_49 |  -.0156418   .0053758    -2.91   0.005    -.0264448   -.0048388
_SstaXhisp_50 |  -.1202654    .000374  -321.55   0.000     -.121017   -.1195137
_SstaXhisp_51 |  -.1942155   .0002177  -891.93   0.000    -.1946531   -.1937779
_SstaXhisp_53 |   -.156192    .000271  -576.35   0.000    -.1567366   -.1556474
_SstaXhisp_54 |  -.1210139   .0006556  -184.58   0.000    -.1223313   -.1196964
_SstaXhisp_55 |  -.0226755   .0003305   -68.61   0.000    -.0233396   -.0220114
_SstaXhisp_56 |  -.0783485   .0003623  -216.27   0.000    -.0790765   -.0776205
 _SstaXfema_1 |  -.0155118    .004407    -3.52   0.001    -.0243679   -.0066557
 _SstaXfema_2 |   .0504565   .0028038    18.00   0.000     .0448222    .0560909
 _SstaXfema_4 |   .0601488   .0053536    11.24   0.000     .0493903    .0709074
 _SstaXfema_5 |   .0150073   .0027255     5.51   0.000     .0095303    .0204843
 _SstaXfema_6 |    .063259   .0000715   884.38   0.000     .0631152    .0634027
 _SstaXfema_8 |   .0455406   .0000794   573.86   0.000     .0453811    .0457001
 _SstaXfema_9 |   .0059003   .0000688    85.73   0.000      .005762    .0060386
_SstaXfema_10 |   .0126597   .0000697   181.63   0.000     .0125196    .0127998
_SstaXfema_12 |   .0656177   .0036361    18.05   0.000     .0583106    .0729247
_SstaXfema_13 |   .0289455   .0042665     6.78   0.000     .0203717    .0375194
_SstaXfema_15 |   .0873475   .0000777  1124.81   0.000     .0871915    .0875036
_SstaXfema_16 |   .0290069   .0040169     7.22   0.000     .0209346    .0370791
_SstaXfema_18 |  -.0466219   .0000586  -795.89   0.000    -.0467396   -.0465041
_SstaXfema_19 |  -.0039759   .0043344    -0.92   0.363    -.0126863    .0047345
_SstaXfema_20 |  -.0120179   .0000615  -195.41   0.000    -.0121415   -.0118943
_SstaXfema_21 |  -.0215412   .0000675  -318.93   0.000    -.0216769   -.0214054
_SstaXfema_22 |  -.0391021   .0022176   -17.63   0.000    -.0435585   -.0346457
_SstaXfema_23 |  -.0115131   .0000466  -247.28   0.000    -.0116067   -.0114195
_SstaXfema_24 |   .0612609   .0000433  1413.59   0.000     .0611738     .061348
_SstaXfema_25 |   .0184233   .0000538   342.32   0.000     .0183151    .0185314
_SstaXfema_26 |  -.0695998   .0000433 -1606.08   0.000    -.0696869   -.0695127
_SstaXfema_27 |   .0094017   .0000725   129.71   0.000      .009256    .0095473
_SstaXfema_28 |   -.015311   .0035138    -4.36   0.000    -.0223723   -.0082498
_SstaXfema_29 |   .0160151    .000055   291.10   0.000     .0159045    .0161257
_SstaXfema_30 |   .0278826   .0000568   491.29   0.000     .0277685    .0279966
_SstaXfema_31 |    .025471   .0000403   632.09   0.000     .0253901     .025552
_SstaXfema_32 |   .0888334   .0000674  1318.20   0.000      .088698    .0889689
_SstaXfema_33 |   .0151847   .0000446   340.29   0.000     .0150951    .0152744
_SstaXfema_34 |   .0341208   .0000462   738.29   0.000     .0340279    .0342137
_SstaXfema_35 |   .0412505   .0000792   520.68   0.000     .0410913    .0414097
_SstaXfema_36 |   .0328736   .0000673   488.72   0.000     .0327385    .0330088
_SstaXfema_37 |   .0534058   .0000598   893.06   0.000     .0532856    .0535259
_SstaXfema_38 |   .0293448   .0000624   470.32   0.000     .0292194    .0294702
_SstaXfema_39 |  -.0614082    .002884   -21.29   0.000    -.0672038   -.0556126
_SstaXfema_40 |  -.0020372   .0000882   -23.10   0.000    -.0022145     -.00186
_SstaXfema_41 |  -.0026308   .0000496   -53.08   0.000    -.0027304   -.0025312
_SstaXfema_42 |  -.0334291   .0000557  -599.94   0.000    -.0335411   -.0333171
_SstaXfema_44 |   .0164828   .0000773   213.11   0.000     .0163274    .0166383
_SstaXfema_45 |   .0075554    .007271     1.04   0.304    -.0070563     .022167
_SstaXfema_46 |   .0457646    .000065   704.30   0.000      .045634    .0458951
_SstaXfema_47 |   .0244237   .0037054     6.59   0.000     .0169775    .0318699
_SstaXfema_48 |    .021532   .0000632   340.86   0.000      .021405    .0216589
_SstaXfema_49 |   .0270226   .0035346     7.65   0.000     .0199195    .0341256
_SstaXfema_50 |   .0259867   .0000476   545.81   0.000      .025891    .0260824
_SstaXfema_51 |   .0367876    .000072   511.23   0.000      .036643    .0369322
_SstaXfema_53 |   .0182077   .0000599   303.79   0.000     .0180872    .0183281
_SstaXfema_54 |  -.0944959   .0000691 -1367.38   0.000    -.0946348    -.094357
_SstaXfema_55 |   -.044919   .0000433 -1037.46   0.000     -.045006    -.044832
_SstaXfema_56 |   -.057992   .0000597  -970.84   0.000     -.058112   -.0578719
 _SstaXyoun_1 |  -.0051327   .0051825    -0.99   0.327    -.0155472    .0052819
 _SstaXyoun_2 |  -.0039664   .0047051    -0.84   0.403    -.0134216    .0054887
 _SstaXyoun_4 |  -.0038775   .0056719    -0.68   0.497    -.0152757    .0075207
 _SstaXyoun_5 |   .0167079   .0045999     3.63   0.001      .007464    .0259519
 _SstaXyoun_6 |  -.0031631    .004256    -0.74   0.461    -.0117158    .0053896
 _SstaXyoun_8 |  -.0222565   .0042027    -5.30   0.000    -.0307021   -.0138109
 _SstaXyoun_9 |  -.0220831   .0043565    -5.07   0.000    -.0308378   -.0133283
_SstaXyoun_10 |  -.0333064   .0042938    -7.76   0.000    -.0419351   -.0246777
_SstaXyoun_12 |   .0279115   .0049015     5.69   0.000     .0180616    .0377615
_SstaXyoun_13 |   .0058126   .0050486     1.15   0.255     -.004333    .0159582
_SstaXyoun_15 |  -.0116331   .0042979    -2.71   0.009    -.0202701   -.0029962
_SstaXyoun_16 |   .0001994    .005182     0.04   0.969    -.0102143    .0106131
_SstaXyoun_18 |  -.0183085   .0043852    -4.18   0.000    -.0271208   -.0094961
_SstaXyoun_19 |  -.0085265   .0052937    -1.61   0.114    -.0191645    .0021115
_SstaXyoun_20 |  -.0085009   .0043029    -1.98   0.054     -.017148    .0001462
_SstaXyoun_21 |  -.0155895   .0043248    -3.60   0.001    -.0242805   -.0068986
_SstaXyoun_22 |    .017136   .0045405     3.77   0.000     .0080115    .0262604
_SstaXyoun_23 |   .0036941   .0044798     0.82   0.414    -.0053084    .0126966
_SstaXyoun_24 |  -.0115348   .0043544    -2.65   0.011    -.0202854   -.0027843
_SstaXyoun_25 |   .0019519   .0042908     0.45   0.651    -.0066708    .0105747
_SstaXyoun_26 |  -.0526752    .004421   -11.91   0.000    -.0615596   -.0437909
_SstaXyoun_27 |  -.0186796   .0042844    -4.36   0.000    -.0272895   -.0100697
_SstaXyoun_28 |   .0137966   .0048685     2.83   0.007      .004013    .0235803
_SstaXyoun_29 |  -.0184068   .0043273    -4.25   0.000    -.0271027   -.0097108
_SstaXyoun_30 |   .0139243   .0043526     3.20   0.002     .0051774    .0226713
_SstaXyoun_31 |   .0065564   .0043425     1.51   0.138    -.0021702     .015283
_SstaXyoun_32 |   .0409651   .0042942     9.54   0.000     .0323355    .0495947
_SstaXyoun_33 |  -.0148831   .0044288    -3.36   0.002    -.0237831   -.0059831
_SstaXyoun_34 |  -.0207123   .0043569    -4.75   0.000    -.0294677   -.0119568
_SstaXyoun_35 |   .0080591   .0043645     1.85   0.071    -.0007117    .0168299
_SstaXyoun_36 |   .0023798   .0043017     0.55   0.583    -.0062648    .0110243
_SstaXyoun_37 |  -.0074667   .0042741    -1.75   0.087    -.0160557    .0011224
_SstaXyoun_38 |   .0205689   .0043754     4.70   0.000     .0117762    .0293615
_SstaXyoun_39 |  -.0415842   .0047264    -8.80   0.000    -.0510822   -.0320862
_SstaXyoun_40 |  -.0215482   .0044016    -4.90   0.000    -.0303935   -.0127028
_SstaXyoun_41 |  -.0030455   .0042683    -0.71   0.479    -.0116229    .0055319
_SstaXyoun_42 |  -.0214066   .0043999    -4.87   0.000    -.0302485   -.0125647
_SstaXyoun_44 |  -.0124496   .0043287    -2.88   0.006    -.0211485   -.0037508
_SstaXyoun_45 |  -.0029678   .0067843    -0.44   0.664    -.0166014    .0106658
_SstaXyoun_46 |   .0342097   .0044395     7.71   0.000     .0252882    .0431312
_SstaXyoun_47 |   .0156779   .0049692     3.16   0.003      .005692    .0256639
_SstaXyoun_48 |   .0012976   .0042565     0.30   0.762    -.0072562    .0098513
_SstaXyoun_49 |  -.0088676    .004865    -1.82   0.074    -.0186442     .000909
_SstaXyoun_50 |   .0068691   .0044457     1.55   0.129    -.0020648     .015803
_SstaXyoun_51 |  -.0214401   .0042889    -5.00   0.000    -.0300589   -.0128212
_SstaXyoun_53 |  -.0175378   .0043029    -4.08   0.000    -.0261847   -.0088908
_SstaXyoun_54 |  -.0231159   .0043526    -5.31   0.000    -.0318628    -.014369
_SstaXyoun_55 |  -.0057358   .0043983    -1.30   0.198    -.0145744    .0031029
_SstaXyoun_56 |  -.0167405   .0043783    -3.82   0.000     -.025539   -.0079421
 _SstaXlows_1 |   .0306476    .002621    11.69   0.000     .0253806    .0359146
 _SstaXlows_2 |  -.0707055   .0016155   -43.77   0.000    -.0739521    -.067459
 _SstaXlows_4 |  -.0719336   .0030636   -23.48   0.000    -.0780902    -.065777
 _SstaXlows_5 |   .0450163   .0016406    27.44   0.000     .0417194    .0483132
 _SstaXlows_6 |  -.0606317   .0001296  -467.75   0.000    -.0608922   -.0603712
 _SstaXlows_8 |  -.0699468   .0000479 -1459.32   0.000    -.0700431   -.0698504
 _SstaXlows_9 |  -.0060135   .0001111   -54.12   0.000    -.0062368   -.0057902
_SstaXlows_10 |  -.0692843   .0001273  -544.40   0.000    -.0695401   -.0690286
_SstaXlows_12 |  -.0735845   .0021478   -34.26   0.000    -.0779007   -.0692682
_SstaXlows_13 |   .0269879    .002457    10.98   0.000     .0220504    .0319254
_SstaXlows_15 |  -.0796743   .0001229  -648.30   0.000    -.0799213   -.0794273
_SstaXlows_16 |  -.0143882   .0023419    -6.14   0.000    -.0190943    -.009682
_SstaXlows_18 |   .0282442   .0001351   209.03   0.000     .0279727    .0285158
_SstaXlows_19 |   .0247211   .0024884     9.93   0.000     .0197204    .0297218
_SstaXlows_20 |   -.001642   .0000881   -18.64   0.000     -.001819    -.001465
_SstaXlows_21 |   .0110801   .0002033    54.50   0.000     .0106716    .0114887
_SstaXlows_22 |  -.0242976   .0013483   -18.02   0.000    -.0270072   -.0215881
_SstaXlows_23 |   .0379496   .0001473   257.63   0.000     .0376536    .0382456
_SstaXlows_24 |  -.0675119   .0001797  -375.68   0.000     -.067873   -.0671508
_SstaXlows_25 |  -.0056257   .0001697   -33.15   0.000    -.0059667   -.0052847
_SstaXlows_26 |   -.017496   .0001473  -118.75   0.000    -.0177921   -.0171999
_SstaXlows_27 |  -.0217784   .0001478  -147.33   0.000    -.0220755   -.0214814
_SstaXlows_28 |   .0301963   .0020574    14.68   0.000     .0260617    .0343309
_SstaXlows_29 |   .0112536   .0001489    75.57   0.000     .0109543    .0115528
_SstaXlows_30 |  -.0282174   .0001015  -278.10   0.000    -.0284213   -.0280135
_SstaXlows_31 |   .0095184   .0001335    71.28   0.000       .00925    .0097867
_SstaXlows_32 |  -.0922942   .0001259  -733.17   0.000    -.0925472   -.0920413
_SstaXlows_33 |   -.000903   .0000964    -9.37   0.000    -.0010967   -.0007093
_SstaXlows_34 |   -.027192   .0001754  -155.02   0.000    -.0275445   -.0268395
_SstaXlows_35 |  -.0463683   .0001155  -401.34   0.000    -.0466004   -.0461361
_SstaXlows_36 |   -.023972   .0002024  -118.42   0.000    -.0243788   -.0235652
_SstaXlows_37 |   .0439906   .0001579   278.68   0.000     .0436734    .0443079
_SstaXlows_38 |  -.0343821   .0001291  -266.33   0.000    -.0346416   -.0341227
_SstaXlows_39 |   .0325472   .0016909    19.25   0.000     .0291492    .0359451
_SstaXlows_40 |  -.0291063   .0001178  -247.06   0.000    -.0293431   -.0288696
_SstaXlows_41 |  -.0222501   .0000932  -238.75   0.000    -.0224374   -.0220628
_SstaXlows_42 |   .0214044   .0001821   117.54   0.000     .0210385    .0217704
_SstaXlows_44 |   .0458748   .0001314   348.99   0.000     .0456106    .0461389
_SstaXlows_45 |   .0169284   .0042398     3.99   0.000     .0084082    .0254486
_SstaXlows_46 |  -.0050889   .0001015   -50.15   0.000    -.0052928    -.004885
_SstaXlows_47 |   .0318576   .0022142    14.39   0.000      .027408    .0363072
_SstaXlows_48 |  -.0629911   .0001125  -559.89   0.000    -.0632172    -.062765
_SstaXlows_49 |   .0034489    .002003     1.72   0.091    -.0005762     .007474
_SstaXlows_50 |   .0050105   .0001739    28.82   0.000     .0046611    .0053598
_SstaXlows_51 |  -.0363087   .0001314  -276.22   0.000    -.0365728   -.0360445
_SstaXlows_53 |  -.0563866   .0000821  -686.98   0.000    -.0565516   -.0562217
_SstaXlows_54 |  -.0213506   .0001946  -109.70   0.000    -.0217418   -.0209595
_SstaXlows_55 |   .0288483   .0001101   262.09   0.000     .0286271    .0290695
_SstaXlows_56 |  -.0430846   .0000971  -443.59   0.000    -.0432797   -.0428894
 _SstaXttre_1 |   .0005248   .0003684     1.42   0.161    -.0002154     .001265
 _SstaXttre_2 |   .0021606   .0003188     6.78   0.000     .0015199    .0028012
 _SstaXttre_4 |   .0014655    .000348     4.21   0.000     .0007662    .0021649
 _SstaXttre_5 |   .0025983   .0003132     8.30   0.000     .0019688    .0032278
 _SstaXttre_6 |  -.0004599   .0000118   -38.95   0.000    -.0004837   -.0004362
 _SstaXttre_8 |  -.0000776   .0000145    -5.36   0.000    -.0001066   -.0000485
 _SstaXttre_9 |  -.0021293   7.86e-06  -270.75   0.000    -.0021451   -.0021135
_SstaXttre_10 |  -.0021046   .0000118  -178.80   0.000    -.0021282   -.0020809
_SstaXttre_12 |   .0008545   .0003399     2.51   0.015     .0001714    .0015376
_SstaXttre_13 |    .000266   .0003605     0.74   0.464    -.0004584    .0009904
_SstaXttre_15 |   .0014503   .0000107   135.22   0.000     .0014288    .0014719
_SstaXttre_16 |   .0026851   .0003645     7.37   0.000     .0019527    .0034175
_SstaXttre_18 |   .0008887   .0000112    79.50   0.000     .0008663    .0009112
_SstaXttre_19 |   .0034893    .000371     9.41   0.000     .0027438    .0042349
_SstaXttre_20 |   .0014607   .0000137   106.41   0.000     .0014331    .0014883
_SstaXttre_21 |   .0008208   9.77e-06    84.05   0.000     .0008012    .0008404
_SstaXttre_22 |   .0027074   .0002765     9.79   0.000     .0021517    .0032631
_SstaXttre_23 |  -.0015132    .000011  -137.80   0.000    -.0015353   -.0014911
_SstaXttre_24 |  -.0006495   .0000123   -52.69   0.000    -.0006742   -.0006247
_SstaXttre_25 |  -.0026509   7.95e-06  -333.40   0.000    -.0026669   -.0026349
_SstaXttre_26 |   .0007416   .0000102    72.49   0.000      .000721    .0007621
_SstaXttre_27 |   .0019622    .000012   163.59   0.000     .0019381    .0019863
_SstaXttre_28 |    .001609   .0003532     4.56   0.000     .0008992    .0023188
_SstaXttre_29 |   .0005842   .0000136    42.92   0.000     .0005569    .0006116
_SstaXttre_30 |   .0020422   .0000125   163.05   0.000     .0020171    .0020674
_SstaXttre_31 |   .0034824   .0000122   286.57   0.000      .003458    .0035069
_SstaXttre_32 |   .0020891   .0000275    75.95   0.000     .0020338    .0021444
_SstaXttre_33 |  -.0024157    .000011  -220.29   0.000    -.0024378   -.0023937
_SstaXttre_34 |  -.0019209   9.12e-06  -210.55   0.000    -.0019393   -.0019026
_SstaXttre_35 |   .0026397   .0000136   193.78   0.000     .0026123    .0026671
_SstaXttre_36 |  -.0005227   .0000119   -43.98   0.000    -.0005466   -.0004988
_SstaXttre_37 |  -.0022704   .0000142  -160.46   0.000    -.0022989    -.002242
_SstaXttre_38 |    .004523     .00001   450.67   0.000     .0045029    .0045432
_SstaXttre_39 |   .0000446   .0003234     0.14   0.891    -.0006053    .0006945
_SstaXttre_40 |   .0013397   .0000112   119.67   0.000     .0013172    .0013622
_SstaXttre_41 |   .0011231   .0000169    66.65   0.000     .0010892    .0011569
_SstaXttre_42 |   -.000245   .0000122   -20.10   0.000    -.0002695   -.0002205
_SstaXttre_44 |   -.002098   8.02e-06  -261.51   0.000    -.0021141   -.0020819
_SstaXttre_45 |   .0011498   .0001816     6.33   0.000     .0007849    .0015147
_SstaXttre_46 |   .0039858   .0000119   336.33   0.000      .003962    .0040096
_SstaXttre_47 |  -.0016583   .0003542    -4.68   0.000    -.0023701   -.0009464
_SstaXttre_48 |   .0011667   .0000133    87.50   0.000     .0011399    .0011934
_SstaXttre_49 |   .0013307   .0003525     3.78   0.000     .0006224    .0020389
_SstaXttre_50 |   .0009799   .0000128    76.74   0.000     .0009542    .0010056
_SstaXttre_51 |   -.001141   .0000126   -90.88   0.000    -.0011663   -.0011158
_SstaXttre_53 |   .0012784   .0000177    72.42   0.000     .0012429    .0013139
_SstaXttre_54 |   .0002807   .0000124    22.56   0.000     .0002557    .0003057
_SstaXttre_55 |   .0017344    .000011   157.08   0.000     .0017123    .0017566
_SstaXttre_56 |   .0037143   .0000136   273.96   0.000     .0036871    .0037415
        _cons |  -.0331689   .0184304    -1.80   0.078    -.0702063    .0038685
-------------------------------------------------------------------------------

. estimates store empdhi2 ;

. *** Spec 3: Add cubic state trends and demog group specific year FE ;
. drop _S* ;

. xi, prefix(_S) i.statefip*black i.statefip*hisp i.statefip*female i.statefip*young i.statefip*lowskill 
>   i.statefip*ttrend i.statefip*ttrend2 i.statefip*ttrend3 ;
i.statefip        _Sstatefip_1-56     (naturally coded; _Sstatefip_17 omitted)
i.state~p*black   _SstaXblac_#        (coded as above)
i.statefip*hisp   _SstaXhisp_#        (coded as above)
i.stat~p*female   _SstaXfema_#        (coded as above)
i.state~p*young   _SstaXyoun_#        (coded as above)
i.stat~p*lows~l   _SstaXlows_#        (coded as above)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)
i.stat~p*ttre~2   _SstaXttrea#        (coded as above)
i.stat~p*ttre~3   _SstaXttreb#        (coded as above)

. drop _T* ;

. xi, prefix(_T) i.year*black i.year*hisp i.year*female i.year*young i.year*lowskill ;
i.year            _Tyear_1980-2010    (naturally coded; _Tyear_1980 omitted)
i.year*black      _TyeaXbla_#         (coded as above)
i.year*hisp       _TyeaXhis_#         (coded as above)
i.year*female     _TyeaXfem_#         (coded as above)
i.year*young      _TyeaXyou_#         (coded as above)
i.year*lowskill   _TyeaXlow_#         (coded as above)

. global controls blackpro hisppro femalepro youngpro lowskillpro pro
>   black hisp female lowskill age age2
>   _T* _S* ;

.   reg empdhi $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 3,252,460,320)

Linear regression                               Number of obs     =  2,075,295
                                                F(48, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0651
                                                Root MSE          =     .43332

                                (Std. Err. adjusted for 50 clusters in statefip)
--------------------------------------------------------------------------------
               |               Robust
        empdhi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
      blackpro |    .015815   .0104455     1.51   0.136     -.005176    .0368059
       hisppro |  -.0097374   .0101127    -0.96   0.340    -.0300596    .0105849
     femalepro |  -.0184311   .0082045    -2.25   0.029    -.0349186   -.0019436
      youngpro |  -.0087477   .0073446    -1.19   0.239    -.0235072    .0060117
   lowskillpro |   .0096991   .0064486     1.50   0.139    -.0032599    .0226582
           pro |  -.0016873   .0086837    -0.19   0.847    -.0191378    .0157632
         black |   .0351615    .007937     4.43   0.000     .0192114    .0511116
          hisp |   .1125766    .007886    14.28   0.000     .0967291     .128424
        female |   -.191319   .0058553   -32.67   0.000    -.2030858   -.1795523
      lowskill |   .1378709   .0043614    31.61   0.000     .1291064    .1466353
           age |    .020627   .0007614    27.09   0.000      .019097     .022157
          age2 |  -.0002287   9.19e-06   -24.90   0.000    -.0002472   -.0002103
   _Tyear_1981 |  -.0079702   .0048054    -1.66   0.104    -.0176271    .0016867
   _Tyear_1982 |  -.0166003   .0058438    -2.84   0.007     -.028344   -.0048567
   _Tyear_1983 |  -.0201093   .0060276    -3.34   0.002    -.0322221   -.0079964
   _Tyear_1984 |  -.0282648   .0062438    -4.53   0.000    -.0408122   -.0157174
   _Tyear_1985 |  -.0223373   .0057599    -3.88   0.000    -.0339123   -.0107624
   _Tyear_1986 |  -.0232121   .0049047    -4.73   0.000    -.0330685   -.0133558
   _Tyear_1987 |  -.0323228   .0059742    -5.41   0.000    -.0443283   -.0203172
   _Tyear_1988 |  -.0310116   .0052563    -5.90   0.000    -.0415745   -.0204487
   _Tyear_1989 |  -.0345557   .0074032    -4.67   0.000     -.049433   -.0196785
   _Tyear_1990 |  -.0413893   .0061882    -6.69   0.000    -.0538249   -.0289537
   _Tyear_1991 |  -.0419644   .0038913   -10.78   0.000    -.0497842   -.0341445
   _Tyear_1992 |  -.0395086   .0050107    -7.88   0.000     -.049578   -.0294392
   _Tyear_1993 |  -.0389486   .0066965    -5.82   0.000    -.0524056   -.0254915
   _Tyear_1994 |  -.0378175   .0057362    -6.59   0.000    -.0493449   -.0262901
   _Tyear_1995 |  -.0399561   .0054824    -7.29   0.000    -.0509734   -.0289388
   _Tyear_1996 |  -.0425538   .0054189    -7.85   0.000    -.0534436    -.031664
   _Tyear_1997 |  -.0447486   .0062195    -7.19   0.000     -.057247   -.0322501
   _Tyear_1998 |  -.0462142   .0053887    -8.58   0.000    -.0570431   -.0353853
   _Tyear_1999 |  -.0485286   .0056744    -8.55   0.000    -.0599318   -.0371255
   _Tyear_2000 |  -.0503633   .0071593    -7.03   0.000    -.0647504   -.0359762
   _Tyear_2001 |   -.059036   .0061362    -9.62   0.000     -.071367   -.0467049
   _Tyear_2002 |  -.0643092     .00481   -13.37   0.000    -.0739752   -.0546432
   _Tyear_2003 |  -.0927921   .0047978   -19.34   0.000    -.1024336   -.0831505
   _Tyear_2004 |   -.093805   .0060032   -15.63   0.000    -.1058689   -.0817411
   _Tyear_2005 |  -.0984631    .005307   -18.55   0.000     -.109128   -.0877983
   _Tyear_2006 |  -.1049063   .0057559   -18.23   0.000    -.1164732   -.0933394
   _Tyear_2007 |   -.114496   .0055596   -20.59   0.000    -.1256684   -.1033236
   _Tyear_2008 |  -.1159878    .005931   -19.56   0.000    -.1279065    -.104069
   _Tyear_2009 |  -.1233527   .0052737   -23.39   0.000    -.1339507   -.1127548
   _Tyear_2010 |  -.1328477   .0057854   -22.96   0.000    -.1444739   -.1212214
_TyeaXbla_1981 |   .0151646   .0073375     2.07   0.044     .0004194    .0299099
_TyeaXbla_1982 |   .0190542   .0102952     1.85   0.070    -.0016347    .0397431
_TyeaXbla_1983 |   .0241262   .0085706     2.82   0.007      .006903    .0413494
_TyeaXbla_1984 |   .0315479   .0089849     3.51   0.001     .0134921    .0496038
_TyeaXbla_1985 |   .0266091   .0125388     2.12   0.039     .0014115    .0518067
_TyeaXbla_1986 |    .019844   .0129274     1.54   0.131    -.0061346    .0458226
_TyeaXbla_1987 |   .0299556   .0116426     2.57   0.013     .0065589    .0533523
_TyeaXbla_1988 |   .0319341   .0100069     3.19   0.002     .0118245    .0520437
_TyeaXbla_1989 |   .0138017   .0148128     0.93   0.356    -.0159657     .043569
_TyeaXbla_1990 |   .0286525   .0106491     2.69   0.010     .0072524    .0500526
_TyeaXbla_1991 |    .037858   .0123803     3.06   0.004     .0129787    .0627372
_TyeaXbla_1992 |    .015685   .0112851     1.39   0.171    -.0069932    .0383631
_TyeaXbla_1993 |   .0155385   .0119058     1.31   0.198     -.008387    .0394641
_TyeaXbla_1994 |   .0023396   .0121546     0.19   0.848     -.022086    .0267652
_TyeaXbla_1995 |   .0295614   .0126595     2.34   0.024     .0041212    .0550016
_TyeaXbla_1996 |   .0308294   .0131736     2.34   0.023      .004356    .0573028
_TyeaXbla_1997 |   .0221864   .0130497     1.70   0.095    -.0040379    .0484108
_TyeaXbla_1998 |   .0311644    .012239     2.55   0.014     .0065693    .0557595
_TyeaXbla_1999 |   .0146715   .0111542     1.32   0.195    -.0077437    .0370866
_TyeaXbla_2000 |   .0113235   .0110681     1.02   0.311    -.0109187    .0335657
_TyeaXbla_2001 |   .0109832   .0084627     1.30   0.200    -.0060232    .0279896
_TyeaXbla_2002 |   .0169705   .0131002     1.30   0.201    -.0093554    .0432965
_TyeaXbla_2003 |  -.0000393    .010568    -0.00   0.997    -.0212765     .021198
_TyeaXbla_2004 |   .0077841    .010083     0.77   0.444    -.0124784    .0280466
_TyeaXbla_2005 |    .018722   .0092444     2.03   0.048     .0001447    .0372992
_TyeaXbla_2006 |   .0148063   .0099716     1.48   0.144    -.0052324    .0348451
_TyeaXbla_2007 |   .0050457   .0098624     0.51   0.611    -.0147736    .0248649
_TyeaXbla_2008 |   .0074603   .0098365     0.76   0.452    -.0123068    .0272275
_TyeaXbla_2009 |   .0081616   .0080281     1.02   0.314    -.0079716    .0242948
_TyeaXbla_2010 |   -.000714   .0106143    -0.07   0.947    -.0220444    .0206163
_TyeaXhis_1981 |   .0144437   .0117624     1.23   0.225    -.0091937    .0380812
_TyeaXhis_1982 |   .0045041   .0125414     0.36   0.721    -.0206989     .029707
_TyeaXhis_1983 |  -.0021462   .0122481    -0.18   0.862    -.0267597    .0224674
_TyeaXhis_1984 |  -.0004863   .0075426    -0.06   0.949    -.0156438    .0146711
_TyeaXhis_1985 |  -.0057238   .0127411    -0.45   0.655     -.031328    .0198804
_TyeaXhis_1986 |  -.0166705   .0168473    -0.99   0.327    -.0505264    .0171854
_TyeaXhis_1987 |  -.0206711   .0109636    -1.89   0.065    -.0427033    .0013612
_TyeaXhis_1988 |  -.0197452   .0138912    -1.42   0.162    -.0476605    .0081702
_TyeaXhis_1989 |  -.0339727   .0116676    -2.91   0.005    -.0574195   -.0105258
_TyeaXhis_1990 |  -.0246399   .0090487    -2.72   0.009     -.042824   -.0064558
_TyeaXhis_1991 |  -.0302282   .0081845    -3.69   0.001    -.0466755   -.0137809
_TyeaXhis_1992 |  -.0350377   .0098322    -3.56   0.001    -.0547962   -.0152792
_TyeaXhis_1993 |  -.0248185   .0122592    -2.02   0.048    -.0494543   -.0001827
_TyeaXhis_1994 |  -.0326761   .0107184    -3.05   0.004    -.0542155   -.0111366
_TyeaXhis_1995 |  -.0364868    .011178    -3.26   0.002    -.0589498   -.0140237
_TyeaXhis_1996 |  -.0339466   .0114796    -2.96   0.005    -.0570157   -.0108775
_TyeaXhis_1997 |  -.0376177   .0127644    -2.95   0.005    -.0632688   -.0119667
_TyeaXhis_1998 |   -.033246   .0121906    -2.73   0.009    -.0577439   -.0087481
_TyeaXhis_1999 |  -.0444675   .0069458    -6.40   0.000    -.0584257   -.0305094
_TyeaXhis_2000 |   -.034064    .007801    -4.37   0.000    -.0497408   -.0183872
_TyeaXhis_2001 |  -.0361152   .0101761    -3.55   0.001    -.0565647   -.0156656
_TyeaXhis_2002 |  -.0428247   .0135794    -3.15   0.003    -.0701135   -.0155359
_TyeaXhis_2003 |  -.0367493   .0106245    -3.46   0.001    -.0581001   -.0153985
_TyeaXhis_2004 |  -.0480119   .0067136    -7.15   0.000    -.0615035   -.0345203
_TyeaXhis_2005 |  -.0481603   .0129394    -3.72   0.001     -.074163   -.0221577
_TyeaXhis_2006 |  -.0537202   .0124286    -4.32   0.000    -.0786965    -.028744
_TyeaXhis_2007 |  -.0591402   .0092157    -6.42   0.000    -.0776598   -.0406206
_TyeaXhis_2008 |  -.0594274   .0111586    -5.33   0.000    -.0818515   -.0370034
_TyeaXhis_2009 |  -.0482763    .010886    -4.43   0.000    -.0701526      -.0264
_TyeaXhis_2010 |  -.0508991   .0080627    -6.31   0.000    -.0671017   -.0346966
_TyeaXfem_1981 |   .0021274   .0034735     0.61   0.543     -.004853    .0091077
_TyeaXfem_1982 |   .0077655   .0065485     1.19   0.241    -.0053943    .0209252
_TyeaXfem_1983 |   .0135389   .0068803     1.97   0.055    -.0002876    .0273655
_TyeaXfem_1984 |   .0274324   .0061216     4.48   0.000     .0151306    .0397342
_TyeaXfem_1985 |   .0190854   .0067805     2.81   0.007     .0054595    .0327113
_TyeaXfem_1986 |   .0150777   .0072514     2.08   0.043     .0005055      .02965
_TyeaXfem_1987 |   .0164842    .006516     2.53   0.015     .0033897    .0295786
_TyeaXfem_1988 |   .0183065   .0068383     2.68   0.010     .0045643    .0320486
_TyeaXfem_1989 |   .0242032   .0062462     3.87   0.000      .011651    .0367553
_TyeaXfem_1990 |   .0256572   .0054991     4.67   0.000     .0146063    .0367081
_TyeaXfem_1991 |   .0293515   .0070628     4.16   0.000     .0151584    .0435447
_TyeaXfem_1992 |   .0235612   .0069516     3.39   0.001     .0095914    .0375311
_TyeaXfem_1993 |   .0213691   .0064286     3.32   0.002     .0084504    .0342878
_TyeaXfem_1994 |   .0149483   .0072221     2.07   0.044     .0004349    .0294618
_TyeaXfem_1995 |   .0216701   .0069144     3.13   0.003      .007775    .0355652
_TyeaXfem_1996 |    .021865   .0067966     3.22   0.002     .0082068    .0355232
_TyeaXfem_1997 |   .0248067   .0075992     3.26   0.002     .0095356    .0400778
_TyeaXfem_1998 |   .0238934   .0065332     3.66   0.001     .0107643    .0370224
_TyeaXfem_1999 |   .0266255   .0076146     3.50   0.001     .0113235    .0419276
_TyeaXfem_2000 |   .0329692   .0094239     3.50   0.001     .0140312    .0519072
_TyeaXfem_2001 |   .0377998   .0079653     4.75   0.000      .021793    .0538066
_TyeaXfem_2002 |   .0330964   .0082339     4.02   0.000     .0165498     .049643
_TyeaXfem_2003 |   .0486751   .0071831     6.78   0.000     .0342402      .06311
_TyeaXfem_2004 |   .0521791   .0076872     6.79   0.000     .0367311    .0676272
_TyeaXfem_2005 |   .0496541   .0081441     6.10   0.000      .033288    .0660202
_TyeaXfem_2006 |   .0452007    .008307     5.44   0.000     .0285072    .0618942
_TyeaXfem_2007 |   .0554187   .0081102     6.83   0.000     .0391207    .0717167
_TyeaXfem_2008 |   .0514761   .0080142     6.42   0.000     .0353709    .0675813
_TyeaXfem_2009 |   .0411304   .0087737     4.69   0.000     .0234989    .0587619
_TyeaXfem_2010 |   .0404435   .0090824     4.45   0.000     .0221917    .0586954
_TyeaXyou_1981 |  -.0062841    .008016    -0.78   0.437    -.0223929    .0098247
_TyeaXyou_1982 |  -.0169322   .0068351    -2.48   0.017    -.0306678   -.0031965
_TyeaXyou_1983 |  -.0432495   .0081926    -5.28   0.000    -.0597132   -.0267858
_TyeaXyou_1984 |  -.0371682    .006534    -5.69   0.000    -.0502988   -.0240375
_TyeaXyou_1985 |  -.0331171   .0072917    -4.54   0.000    -.0477704   -.0184639
_TyeaXyou_1986 |  -.0399686   .0068189    -5.86   0.000    -.0536718   -.0262655
_TyeaXyou_1987 |  -.0300941   .0079249    -3.80   0.000    -.0460198   -.0141684
_TyeaXyou_1988 |  -.0312688   .0076827    -4.07   0.000    -.0467078   -.0158298
_TyeaXyou_1989 |  -.0364709   .0080295    -4.54   0.000    -.0526067   -.0203351
_TyeaXyou_1990 |  -.0283125   .0076386    -3.71   0.001    -.0436628   -.0129622
_TyeaXyou_1991 |  -.0436288   .0073255    -5.96   0.000    -.0583499   -.0289077
_TyeaXyou_1992 |  -.0496983   .0092906    -5.35   0.000    -.0683685   -.0310282
_TyeaXyou_1993 |  -.0409799   .0064265    -6.38   0.000    -.0538944   -.0280653
_TyeaXyou_1994 |  -.0379752   .0088476    -4.29   0.000    -.0557553   -.0201952
_TyeaXyou_1995 |  -.0408089    .008495    -4.80   0.000    -.0578801   -.0237376
_TyeaXyou_1996 |  -.0377687   .0083438    -4.53   0.000    -.0545362   -.0210011
_TyeaXyou_1997 |  -.0380509    .007913    -4.81   0.000    -.0539526   -.0221491
_TyeaXyou_1998 |  -.0252718   .0088528    -2.85   0.006    -.0430621   -.0074815
_TyeaXyou_1999 |   -.034964   .0105554    -3.31   0.002    -.0561759   -.0137521
_TyeaXyou_2000 |   -.028746   .0095865    -3.00   0.004    -.0480107   -.0094812
_TyeaXyou_2001 |  -.0379244   .0108318    -3.50   0.001    -.0596916   -.0161571
_TyeaXyou_2002 |  -.0394618   .0079855    -4.94   0.000    -.0555093   -.0234142
_TyeaXyou_2003 |  -.0333277   .0056632    -5.88   0.000    -.0447084    -.021947
_TyeaXyou_2004 |  -.0509936   .0078452    -6.50   0.000    -.0667592    -.035228
_TyeaXyou_2005 |  -.0372138   .0082387    -4.52   0.000    -.0537701   -.0206575
_TyeaXyou_2006 |  -.0347024   .0071192    -4.87   0.000     -.049009   -.0203958
_TyeaXyou_2007 |  -.0332483    .007583    -4.38   0.000    -.0484869   -.0180098
_TyeaXyou_2008 |  -.0309526   .0067345    -4.60   0.000    -.0444861    -.017419
_TyeaXyou_2009 |  -.0282233   .0077088    -3.66   0.001    -.0437147   -.0127319
_TyeaXyou_2010 |  -.0289378   .0081958    -3.53   0.001    -.0454078   -.0124677
_TyeaXlow_1981 |  -.0042993   .0048304    -0.89   0.378    -.0140062    .0054077
_TyeaXlow_1982 |  -.0083683   .0063907    -1.31   0.196    -.0212108    .0044743
_TyeaXlow_1983 |  -.0221731   .0062427    -3.55   0.001    -.0347182   -.0096281
_TyeaXlow_1984 |   -.025568   .0065951    -3.88   0.000    -.0388214   -.0123146
_TyeaXlow_1985 |  -.0359448   .0057467    -6.25   0.000    -.0474932   -.0243964
_TyeaXlow_1986 |  -.0400612   .0069805    -5.74   0.000    -.0540889   -.0260334
_TyeaXlow_1987 |  -.0457362   .0055557    -8.23   0.000    -.0569007   -.0345717
_TyeaXlow_1988 |   -.043039   .0053463    -8.05   0.000    -.0537827   -.0322952
_TyeaXlow_1989 |  -.0416383   .0083728    -4.97   0.000    -.0584641   -.0248125
_TyeaXlow_1990 |  -.0480134   .0055991    -8.58   0.000    -.0592652   -.0367617
_TyeaXlow_1991 |  -.0530364   .0048752   -10.88   0.000    -.0628336   -.0432393
_TyeaXlow_1992 |  -.0504902   .0065793    -7.67   0.000    -.0637119   -.0372685
_TyeaXlow_1993 |  -.0599084   .0053861   -11.12   0.000    -.0707322   -.0490846
_TyeaXlow_1994 |   -.053473   .0058908    -9.08   0.000     -.065311   -.0416349
_TyeaXlow_1995 |  -.0586493   .0058395   -10.04   0.000    -.0703842   -.0469144
_TyeaXlow_1996 |  -.0654453   .0057758   -11.33   0.000    -.0770523   -.0538384
_TyeaXlow_1997 |  -.0620055   .0077328    -8.02   0.000    -.0775452   -.0464658
_TyeaXlow_1998 |  -.0698689   .0066067   -10.58   0.000    -.0831457   -.0565922
_TyeaXlow_1999 |  -.0686796   .0071585    -9.59   0.000    -.0830651   -.0542941
_TyeaXlow_2000 |  -.0703316   .0061287   -11.48   0.000    -.0826476   -.0580156
_TyeaXlow_2001 |  -.0736871   .0060894   -12.10   0.000    -.0859242     -.06145
_TyeaXlow_2002 |  -.0804206   .0055297   -14.54   0.000    -.0915329   -.0693083
_TyeaXlow_2003 |  -.0780911   .0067798   -11.52   0.000    -.0917156   -.0644665
_TyeaXlow_2004 |  -.0847151   .0078774   -10.75   0.000    -.1005453   -.0688848
_TyeaXlow_2005 |  -.0915247   .0094522    -9.68   0.000    -.1105196   -.0725298
_TyeaXlow_2006 |  -.0819041   .0073096   -11.21   0.000    -.0965933   -.0672149
_TyeaXlow_2007 |  -.0803707   .0075434   -10.65   0.000    -.0955296   -.0652117
_TyeaXlow_2008 |  -.0845008   .0077037   -10.97   0.000    -.0999819   -.0690196
_TyeaXlow_2009 |  -.0942857   .0073417   -12.84   0.000    -.1090395    -.079532
_TyeaXlow_2010 |  -.0962068   .0076234   -12.62   0.000    -.1115265   -.0808871
  _Sstatefip_1 |   .0082558   .0031893     2.59   0.013     .0018466     .014665
  _Sstatefip_2 |  -.0656224   .0026031   -25.21   0.000    -.0708535   -.0603913
  _Sstatefip_4 |  -.0558932   .0042433   -13.17   0.000    -.0644204    -.047366
  _Sstatefip_5 |  -.1164371   .0022933   -50.77   0.000    -.1210457   -.1118286
  _Sstatefip_6 |   -.050195   .0014603   -34.37   0.000    -.0531295   -.0472605
  _Sstatefip_8 |  -.0528868    .001482   -35.69   0.000    -.0558649   -.0499087
  _Sstatefip_9 |   .0237763   .0013648    17.42   0.000     .0210337     .026519
 _Sstatefip_10 |   .0214386   .0013519    15.86   0.000     .0187218    .0241555
 _Sstatefip_12 |  -.1131227   .0029378   -38.51   0.000    -.1190264    -.107219
 _Sstatefip_13 |  -.0523026   .0030952   -16.90   0.000    -.0585226   -.0460825
 _Sstatefip_15 |  -.1270948   .0016484   -77.10   0.000    -.1304074   -.1237822
 _Sstatefip_16 |  -.1123616   .0035006   -32.10   0.000    -.1193965   -.1053268
 _Sstatefip_18 |   .0237735   .0016623    14.30   0.000     .0204329    .0271141
 _Sstatefip_19 |   -.071826   .0036337   -19.77   0.000    -.0791283   -.0645238
 _Sstatefip_20 |  -.0086611   .0015111    -5.73   0.000    -.0116977   -.0056245
 _Sstatefip_21 |  -.0170622   .0015919   -10.72   0.000    -.0202612   -.0138632
 _Sstatefip_22 |  -.0502185   .0019001   -26.43   0.000    -.0540369   -.0464001
 _Sstatefip_23 |   .0034898   .0018593     1.88   0.066    -.0002465    .0072262
 _Sstatefip_24 |  -.0182877   .0014317   -12.77   0.000    -.0211649   -.0154105
 _Sstatefip_25 |   .0117472   .0015332     7.66   0.000     .0086661    .0148282
 _Sstatefip_26 |    .061448   .0013326    46.11   0.000     .0587701    .0641258
 _Sstatefip_27 |  -.0447748   .0018041   -24.82   0.000    -.0484002   -.0411493
 _Sstatefip_28 |  -.0503707   .0027306   -18.45   0.000     -.055858   -.0448834
 _Sstatefip_29 |  -.0693582   .0014779   -46.93   0.000    -.0723281   -.0663884
 _Sstatefip_30 |  -.1188768   .0017994   -66.06   0.000    -.1224929   -.1152607
 _Sstatefip_31 |  -.1399561    .001668   -83.91   0.000    -.1433081    -.136604
 _Sstatefip_32 |  -.1896485   .0016537  -114.68   0.000    -.1929716   -.1863253
 _Sstatefip_33 |   .0405163   .0017823    22.73   0.000     .0369347    .0440979
 _Sstatefip_34 |   .0024855   .0012111     2.05   0.046     .0000516    .0049194
 _Sstatefip_35 |  -.1246663   .0017203   -72.47   0.000    -.1281234   -.1212092
 _Sstatefip_36 |  -.0370547   .0011898   -31.14   0.000    -.0394457   -.0346636
 _Sstatefip_37 |   -.047287   .0013498   -35.03   0.000    -.0499996   -.0445744
 _Sstatefip_38 |  -.1691933   .0017948   -94.27   0.000    -.1728001   -.1655865
 _Sstatefip_39 |   .0360161   .0025238    14.27   0.000     .0309443     .041088
 _Sstatefip_40 |  -.0048095   .0015821    -3.04   0.004    -.0079888   -.0016302
 _Sstatefip_41 |  -.0349544   .0017392   -20.10   0.000    -.0384495   -.0314594
 _Sstatefip_42 |   .0244928   .0015139    16.18   0.000     .0214505    .0275351
 _Sstatefip_44 |   .0087857   .0016007     5.49   0.000     .0055691    .0120024
 _Sstatefip_45 |  -.0679304   .0054116   -12.55   0.000    -.0788053   -.0570554
 _Sstatefip_46 |  -.1761958   .0018963   -92.92   0.000    -.1800065   -.1723851
 _Sstatefip_47 |   -.015832   .0029264    -5.41   0.000    -.0217127   -.0099512
 _Sstatefip_48 |  -.0450091   .0013327   -33.77   0.000    -.0476872    -.042331
 _Sstatefip_49 |  -.0427955   .0033455   -12.79   0.000    -.0495186   -.0360725
 _Sstatefip_50 |  -.0587127   .0018842   -31.16   0.000     -.062499   -.0549263
 _Sstatefip_51 |  -.0225222    .001244   -18.10   0.000     -.025022   -.0200223
 _Sstatefip_53 |  -.0233148   .0016874   -13.82   0.000    -.0267059   -.0199238
 _Sstatefip_54 |   .0821752   .0018461    44.51   0.000     .0784652    .0858851
 _Sstatefip_55 |   .0159761   .0017273     9.25   0.000     .0125049    .0194472
 _Sstatefip_56 |  -.0052743   .0017005    -3.10   0.003    -.0086916   -.0018569
  _SstaXblac_1 |  -.0164615   .0056944    -2.89   0.006    -.0279048   -.0050182
  _SstaXblac_2 |   -.087087   .0032784   -26.56   0.000    -.0936751   -.0804989
  _SstaXblac_4 |  -.0498243   .0071122    -7.01   0.000    -.0641168   -.0355317
  _SstaXblac_5 |   .0186586   .0035454     5.26   0.000     .0115339    .0257834
  _SstaXblac_6 |  -.0023239   .0002453    -9.47   0.000    -.0028168    -.001831
  _SstaXblac_8 |   .0143139   .0002865    49.96   0.000     .0137382    .0148896
  _SstaXblac_9 |  -.0107753   .0003112   -34.63   0.000    -.0114006   -.0101499
 _SstaXblac_10 |   .0099183   .0003365    29.48   0.000     .0092421    .0105944
 _SstaXblac_12 |  -.0201116   .0043551    -4.62   0.000    -.0288635   -.0113597
 _SstaXblac_13 |   .0009123   .0053543     0.17   0.865    -.0098475    .0116722
 _SstaXblac_15 |   -.146823   .0007323  -200.50   0.000    -.1482945   -.1453514
 _SstaXblac_16 |   .0463926   .0066371     6.99   0.000      .033055    .0597303
 _SstaXblac_18 |  -.0290849   .0002115  -137.51   0.000      -.02951   -.0286599
 _SstaXblac_19 |  -.0391895   .0065225    -6.01   0.000     -.052297   -.0260821
 _SstaXblac_20 |   .0042121   .0003746    11.24   0.000     .0034592    .0049649
 _SstaXblac_21 |  -.0269926   .0003352   -80.54   0.000    -.0276662   -.0263191
 _SstaXblac_22 |  -.0329978   .0028698   -11.50   0.000    -.0387649   -.0272307
 _SstaXblac_23 |    .077893   .0009534    81.70   0.000      .075977     .079809
 _SstaXblac_24 |   .0310584   .0001522   204.02   0.000     .0307525    .0313643
 _SstaXblac_25 |   -.048804   .0004755  -102.64   0.000    -.0497595   -.0478485
 _SstaXblac_26 |   .0059353   .0001533    38.71   0.000     .0056271    .0062434
 _SstaXblac_27 |     -.0168   .0008273   -20.31   0.000    -.0184626   -.0151374
 _SstaXblac_28 |    .041768   .0045387     9.20   0.000     .0326471    .0508889
 _SstaXblac_29 |  -.0433183   .0002434  -177.95   0.000    -.0438075   -.0428291
 _SstaXblac_30 |  -.1489505   .0010079  -147.79   0.000    -.1509759   -.1469251
 _SstaXblac_31 |  -.0291609   .0004304   -67.76   0.000    -.0300257    -.028296
 _SstaXblac_32 |  -.0622218   .0005221  -119.18   0.000    -.0632709   -.0611726
 _SstaXblac_33 |  -.0640418   .0011463   -55.87   0.000    -.0663453   -.0617382
 _SstaXblac_34 |   .0116925   .0001445    80.90   0.000      .011402    .0119829
 _SstaXblac_35 |  -.0291795   .0004527   -64.46   0.000    -.0300892   -.0282698
 _SstaXblac_36 |  -.0559067   .0001679  -333.04   0.000    -.0562441   -.0555694
 _SstaXblac_37 |  -.0010849   .0001765    -6.15   0.000    -.0014395   -.0007302
 _SstaXblac_38 |  -.1098112   .0008748  -125.53   0.000    -.1115691   -.1080533
 _SstaXblac_39 |   -.040276   .0038074   -10.58   0.000    -.0479272   -.0326249
 _SstaXblac_40 |  -.0419662   .0003156  -132.99   0.000    -.0426003   -.0413321
 _SstaXblac_41 |  -.0081637   .0007145   -11.43   0.000    -.0095995   -.0067279
 _SstaXblac_42 |  -.0610385   .0002196  -277.94   0.000    -.0614799   -.0605972
 _SstaXblac_44 |  -.0174125    .000676   -25.76   0.000     -.018771    -.016054
 _SstaXblac_45 |     .03291   .0090607     3.63   0.001     .0147019     .051118
 _SstaXblac_46 |   .2304067   .0013649   168.81   0.000     .2276639    .2331495
 _SstaXblac_47 |  -.0339157   .0046518    -7.29   0.000    -.0432638   -.0245676
 _SstaXblac_48 |  -.0130651   .0002118   -61.67   0.000    -.0134908   -.0126394
 _SstaXblac_49 |  -.0550222   .0059775    -9.20   0.000    -.0670345     -.04301
 _SstaXblac_50 |   .0322915   .0011717    27.56   0.000     .0299369    .0346462
 _SstaXblac_51 |   .0146841   .0001852    79.28   0.000     .0143119    .0150563
 _SstaXblac_53 |  -.0491569   .0003715  -132.31   0.000    -.0499035   -.0484102
 _SstaXblac_54 |  -.0382319    .000417   -91.69   0.000    -.0390699    -.037394
 _SstaXblac_55 |  -.0708245   .0003672  -192.90   0.000    -.0715623   -.0700867
 _SstaXblac_56 |   -.095187    .000796  -119.58   0.000    -.0967866   -.0935874
  _SstaXhisp_1 |   -.033575   .0084359    -3.98   0.000    -.0505277   -.0166224
  _SstaXhisp_2 |   -.129144   .0047494   -27.19   0.000    -.1386883   -.1195997
  _SstaXhisp_4 |  -.0682694    .007231    -9.44   0.000    -.0828007   -.0537382
  _SstaXhisp_5 |   .0496299   .0059389     8.36   0.000     .0376951    .0615646
  _SstaXhisp_6 |  -.0428558   .0003909  -109.64   0.000    -.0436414   -.0420703
  _SstaXhisp_8 |  -.0347137   .0007123   -48.73   0.000    -.0361451   -.0332823
  _SstaXhisp_9 |  -.0332165   .0007693   -43.18   0.000    -.0347624   -.0316705
 _SstaXhisp_10 |  -.0488202   .0013773   -35.45   0.000    -.0515881   -.0460523
 _SstaXhisp_12 |  -.0648328   .0052251   -12.41   0.000     -.075333   -.0543325
 _SstaXhisp_13 |   -.055944   .0075476    -7.41   0.000    -.0711116   -.0407764
 _SstaXhisp_15 |  -.0863528   .0009992   -86.42   0.000    -.0883608   -.0843449
 _SstaXhisp_16 |  -.0230409   .0057311    -4.02   0.000    -.0345579    -.011524
 _SstaXhisp_18 |  -.0250815   .0011543   -21.73   0.000    -.0274012   -.0227618
 _SstaXhisp_19 |   .1247633   .0079923    15.61   0.000     .1087021    .1408245
 _SstaXhisp_20 |  -.0619524   .0009174   -67.53   0.000    -.0637961   -.0601088
 _SstaXhisp_21 |  -.1517501   .0016404   -92.51   0.000    -.1550465   -.1484537
 _SstaXhisp_22 |  -.1158532   .0037804   -30.65   0.000    -.1234503   -.1082562
 _SstaXhisp_23 |  -.1255321   .0009858  -127.34   0.000    -.1275131   -.1235511
 _SstaXhisp_24 |   -.162649   .0012924  -125.85   0.000    -.1652461   -.1600519
 _SstaXhisp_25 |  -.0414224   .0012482   -33.19   0.000    -.0439308    -.038914
 _SstaXhisp_26 |  -.0318122   .0006591   -48.26   0.000    -.0331368   -.0304876
 _SstaXhisp_27 |  -.0526644   .0018874   -27.90   0.000    -.0564574   -.0488714
 _SstaXhisp_28 |  -.0042044   .0076238    -0.55   0.584     -.019525    .0111163
 _SstaXhisp_29 |  -.0512031   .0007967   -64.27   0.000    -.0528042    -.049602
 _SstaXhisp_30 |  -.1250449   .0009055  -138.10   0.000    -.1268645   -.1232253
 _SstaXhisp_31 |   .0871533    .001307    66.68   0.000     .0845267    .0897798
 _SstaXhisp_32 |  -.1247665   .0012781   -97.62   0.000     -.127335   -.1221981
 _SstaXhisp_33 |  -.0067122   .0011399    -5.89   0.000    -.0090029   -.0044215
 _SstaXhisp_34 |   .0015843   .0004243     3.73   0.000     .0007316     .002437
 _SstaXhisp_35 |  -.0534768   .0007283   -73.43   0.000    -.0549403   -.0520133
 _SstaXhisp_36 |   -.081029   .0004888  -165.77   0.000    -.0820113   -.0800467
 _SstaXhisp_37 |  -.1146358   .0023593   -48.59   0.000     -.119377   -.1098946
 _SstaXhisp_38 |  -.0164746   .0010375   -15.88   0.000    -.0185596   -.0143896
 _SstaXhisp_39 |  -.0630313   .0056927   -11.07   0.000    -.0744711   -.0515915
 _SstaXhisp_40 |   -.129821   .0007828  -165.85   0.000    -.1313941   -.1282479
 _SstaXhisp_41 |  -.0998134   .0012521   -79.72   0.000    -.1023296   -.0972971
 _SstaXhisp_42 |  -.0300761   .0010122   -29.71   0.000    -.0321101   -.0280421
 _SstaXhisp_44 |   .0948666   .0011546    82.17   0.000     .0925464    .0971868
 _SstaXhisp_45 |  -.1382215   .0089012   -15.53   0.000     -.156109   -.1203339
 _SstaXhisp_46 |   .0388692   .0021518    18.06   0.000     .0345451    .0431934
 _SstaXhisp_47 |  -.1042576   .0080183   -13.00   0.000     -.120371   -.0881443
 _SstaXhisp_48 |  -.0927974   .0004183  -221.86   0.000     -.093638   -.0919569
 _SstaXhisp_49 |  -.0289541    .005746    -5.04   0.000     -.040501   -.0174071
 _SstaXhisp_50 |  -.1269883   .0009578  -132.58   0.000     -.128913   -.1250635
 _SstaXhisp_51 |  -.1890973    .001429  -132.33   0.000    -.1919689   -.1862256
 _SstaXhisp_53 |  -.1522877   .0013731  -110.90   0.000    -.1550471   -.1495283
 _SstaXhisp_54 |  -.1276603   .0010438  -122.30   0.000    -.1297579   -.1255626
 _SstaXhisp_55 |  -.0172374   .0018823    -9.16   0.000    -.0210199   -.0134548
 _SstaXhisp_56 |  -.0879613   .0007519  -116.99   0.000    -.0894723   -.0864503
  _SstaXfema_1 |  -.0029188   .0043285    -0.67   0.503    -.0116173    .0057797
  _SstaXfema_2 |   .0575635   .0027145    21.21   0.000     .0521085    .0630185
  _SstaXfema_4 |   .0727366   .0052021    13.98   0.000     .0622825    .0831907
  _SstaXfema_5 |   .0221616   .0026424     8.39   0.000     .0168516    .0274716
  _SstaXfema_6 |   .0620483   .0001766   351.29   0.000     .0616934    .0624033
  _SstaXfema_8 |   .0434513   .0002883   150.69   0.000     .0428718    .0440307
  _SstaXfema_9 |   .0060668   .0001217    49.85   0.000     .0058223    .0063114
 _SstaXfema_10 |   .0117241   .0001833    63.96   0.000     .0113557    .0120924
 _SstaXfema_12 |   .0743559   .0035268    21.08   0.000     .0672685    .0814433
 _SstaXfema_13 |   .0394488   .0041296     9.55   0.000     .0311501    .0477475
 _SstaXfema_15 |   .0871775   .0001316   662.43   0.000      .086913    .0874419
 _SstaXfema_16 |   .0385023   .0038864     9.91   0.000     .0306922    .0463124
 _SstaXfema_18 |  -.0468621    .000097  -482.88   0.000    -.0470571   -.0466671
 _SstaXfema_19 |   .0085476    .004261     2.01   0.050    -.0000151    .0171103
 _SstaXfema_20 |  -.0123723   .0001042  -118.75   0.000    -.0125816   -.0121629
 _SstaXfema_21 |  -.0218485   .0001233  -177.13   0.000    -.0220963   -.0216006
 _SstaXfema_22 |  -.0318696   .0021525   -14.81   0.000    -.0361951    -.027544
 _SstaXfema_23 |  -.0120667   .0001353   -89.21   0.000    -.0123385   -.0117949
 _SstaXfema_24 |   .0606406   .0001246   486.70   0.000     .0603902    .0608909
 _SstaXfema_25 |   .0184438   .0001205   153.07   0.000     .0182017     .018686
 _SstaXfema_26 |  -.0697693   .0001017  -686.34   0.000    -.0699736    -.069565
 _SstaXfema_27 |   .0088183   .0001342    65.72   0.000     .0085487     .009088
 _SstaXfema_28 |  -.0055189   .0034492    -1.60   0.116    -.0124504    .0014126
 _SstaXfema_29 |   .0154941   .0001059   146.36   0.000     .0152813    .0157068
 _SstaXfema_30 |   .0275892   .0001006   274.23   0.000      .027387    .0277914
 _SstaXfema_31 |   .0248982   .0001007   247.22   0.000     .0246958    .0251006
 _SstaXfema_32 |   .0848628   .0005436   156.11   0.000     .0837704    .0859552
 _SstaXfema_33 |   .0136722   .0001517    90.13   0.000     .0133673    .0139771
 _SstaXfema_34 |    .033998   .0001061   320.37   0.000     .0337848    .0342113
 _SstaXfema_35 |   .0400633   .0002263   177.03   0.000     .0396086    .0405181
 _SstaXfema_36 |      .0327   .0001107   295.40   0.000     .0324775    .0329224
 _SstaXfema_37 |   .0524965   .0001865   281.41   0.000     .0521216    .0528714
 _SstaXfema_38 |   .0295797   .0001108   266.87   0.000      .029357    .0298025
 _SstaXfema_39 |  -.0530539   .0028087   -18.89   0.000    -.0586982   -.0474096
 _SstaXfema_40 |  -.0023814   .0001843   -12.92   0.000    -.0027518   -.0020111
 _SstaXfema_41 |  -.0036482   .0001628   -22.41   0.000    -.0039754    -.003321
 _SstaXfema_42 |  -.0333887   .0000986  -338.49   0.000    -.0335869   -.0331905
 _SstaXfema_44 |   .0161761   .0001341   120.63   0.000     .0159067    .0164456
 _SstaXfema_45 |   .0271896   .0071295     3.81   0.000     .0128623    .0415169
 _SstaXfema_46 |   .0452934   .0001064   425.84   0.000     .0450797    .0455071
 _SstaXfema_47 |   .0340105   .0035955     9.46   0.000     .0267851     .041236
 _SstaXfema_48 |   .0201774   .0002144    94.12   0.000     .0197466    .0206082
 _SstaXfema_49 |   .0346244   .0034157    10.14   0.000     .0277602    .0414885
 _SstaXfema_50 |   .0252481   .0001373   183.82   0.000     .0249721    .0255241
 _SstaXfema_51 |   .0358798   .0001739   206.31   0.000     .0355303    .0362293
 _SstaXfema_53 |   .0168714   .0002258    74.72   0.000     .0164177    .0173252
 _SstaXfema_54 |  -.0936719   .0001032  -907.89   0.000    -.0938792   -.0934646
 _SstaXfema_55 |  -.0455306   .0001075  -423.61   0.000    -.0457466   -.0453146
 _SstaXfema_56 |  -.0570775   .0001139  -500.96   0.000    -.0573065   -.0568485
  _SstaXyoun_1 |   .0235814   .0060437     3.90   0.000      .011436    .0357267
  _SstaXyoun_2 |   .0249498    .005649     4.42   0.000     .0135978    .0363018
  _SstaXyoun_4 |    .024192   .0065648     3.69   0.001     .0109995    .0373844
  _SstaXyoun_5 |    .046471   .0055652     8.35   0.000     .0352874    .0576546
  _SstaXyoun_6 |   .0250705   .0054777     4.58   0.000     .0140627    .0360783
  _SstaXyoun_8 |   .0076415   .0054765     1.40   0.169    -.0033639    .0186469
  _SstaXyoun_9 |   .0055971   .0053678     1.04   0.302    -.0051898     .016384
 _SstaXyoun_10 |  -.0041276   .0054126    -0.76   0.449    -.0150046    .0067495
 _SstaXyoun_12 |   .0565706   .0057998     9.75   0.000     .0449154    .0682258
 _SstaXyoun_13 |   .0347373   .0059472     5.84   0.000     .0227859    .0466887
 _SstaXyoun_15 |   .0174832   .0055496     3.15   0.003     .0063309    .0286356
 _SstaXyoun_16 |    .029479    .006037     4.88   0.000     .0173471    .0416108
 _SstaXyoun_18 |   .0121562   .0054265     2.24   0.030     .0012513    .0230612
 _SstaXyoun_19 |    .018665   .0060456     3.09   0.003      .006516     .030814
 _SstaXyoun_20 |   .0199771   .0054057     3.70   0.001     .0091139    .0308403
 _SstaXyoun_21 |   .0134916    .005435     2.48   0.017     .0025697    .0244136
 _SstaXyoun_22 |   .0447752   .0054619     8.20   0.000     .0337991    .0557514
 _SstaXyoun_23 |   .0316483   .0054081     5.85   0.000     .0207804    .0425163
 _SstaXyoun_24 |   .0164538   .0053749     3.06   0.004     .0056525     .027255
 _SstaXyoun_25 |   .0301497   .0054327     5.55   0.000     .0192323    .0410672
 _SstaXyoun_26 |  -.0235513   .0054402    -4.33   0.000    -.0344839   -.0126188
 _SstaXyoun_27 |   .0114091   .0053883     2.12   0.039     .0005809    .0222372
 _SstaXyoun_28 |   .0423855     .00567     7.48   0.000     .0309912    .0537798
 _SstaXyoun_29 |   .0120078   .0054366     2.21   0.032     .0010824    .0229331
 _SstaXyoun_30 |   .0422641     .00547     7.73   0.000     .0312718    .0532564
 _SstaXyoun_31 |   .0360705   .0054827     6.58   0.000     .0250526    .0470884
 _SstaXyoun_32 |   .0706307   .0055118    12.81   0.000     .0595543    .0817071
 _SstaXyoun_33 |    .014063     .00542     2.59   0.012     .0031712    .0249548
 _SstaXyoun_34 |   .0085233   .0054199     1.57   0.122    -.0023684    .0194151
 _SstaXyoun_35 |   .0366577   .0054553     6.72   0.000     .0256948    .0476206
 _SstaXyoun_36 |   .0316418   .0053704     5.89   0.000     .0208496     .042434
 _SstaXyoun_37 |   .0223618   .0054899     4.07   0.000     .0113295    .0333942
 _SstaXyoun_38 |   .0503724   .0054419     9.26   0.000     .0394365    .0613083
 _SstaXyoun_39 |  -.0130458    .005553    -2.35   0.023    -.0242049   -.0018868
 _SstaXyoun_40 |   .0062875   .0054069     1.16   0.251     -.004578     .017153
 _SstaXyoun_41 |   .0267565   .0054661     4.89   0.000      .015772     .037741
 _SstaXyoun_42 |    .006815   .0054184     1.26   0.214    -.0040738    .0177037
 _SstaXyoun_44 |   .0164819   .0054049     3.05   0.004     .0056204    .0273434
 _SstaXyoun_45 |   .0264533   .0075489     3.50   0.001     .0112833    .0416233
 _SstaXyoun_46 |   .0638103   .0054261    11.76   0.000     .0529061    .0747145
 _SstaXyoun_47 |   .0450605   .0058738     7.67   0.000     .0332567    .0568644
 _SstaXyoun_48 |   .0306047   .0054775     5.59   0.000     .0195973     .041612
 _SstaXyoun_49 |   .0209337   .0058798     3.56   0.001     .0091177    .0327497
 _SstaXyoun_50 |    .034501   .0053584     6.44   0.000     .0237329     .045269
 _SstaXyoun_51 |   .0081028    .005455     1.49   0.144    -.0028595    .0190651
 _SstaXyoun_53 |   .0117748   .0055132     2.14   0.038     .0006955     .022854
 _SstaXyoun_54 |   .0042325   .0054801     0.77   0.444    -.0067802    .0152452
 _SstaXyoun_55 |   .0242052   .0054267     4.46   0.000     .0132997    .0351106
 _SstaXyoun_56 |   .0074432   .0053918     1.38   0.174    -.0033921    .0182785
  _SstaXlows_1 |   .0116304   .0034035     3.42   0.001     .0047907      .01847
  _SstaXlows_2 |  -.0822744   .0020127   -40.88   0.000     -.086319   -.0782297
  _SstaXlows_4 |  -.0918658   .0038489   -23.87   0.000    -.0996004   -.0841311
  _SstaXlows_5 |   .0346864   .0020348    17.05   0.000     .0305973    .0387756
  _SstaXlows_6 |   -.060408    .000306  -197.41   0.000     -.061023   -.0597931
  _SstaXlows_8 |  -.0691209   .0003641  -189.84   0.000    -.0698526   -.0683892
  _SstaXlows_9 |  -.0086858   .0002282   -38.06   0.000    -.0091444   -.0082271
 _SstaXlows_10 |  -.0685241   .0003744  -183.04   0.000    -.0692764   -.0677718
 _SstaXlows_12 |  -.0871125   .0026232   -33.21   0.000     -.092384   -.0818411
 _SstaXlows_13 |   .0110014   .0030774     3.57   0.001     .0048172    .0171856
 _SstaXlows_15 |  -.0806812   .0002359  -342.07   0.000    -.0811552   -.0802072
 _SstaXlows_16 |  -.0294318   .0029081   -10.12   0.000    -.0352759   -.0235877
 _SstaXlows_18 |   .0295388   .0003203    92.23   0.000     .0288952    .0301824
 _SstaXlows_19 |   .0048566   .0033181     1.46   0.150    -.0018114    .0115245
 _SstaXlows_20 |  -.0034695   .0002011   -17.25   0.000    -.0038737   -.0030653
 _SstaXlows_21 |   .0117063   .0002694    43.45   0.000      .011165    .0122477
 _SstaXlows_22 |  -.0356423   .0017565   -20.29   0.000    -.0391722   -.0321125
 _SstaXlows_23 |   .0383201   .0002827   135.56   0.000     .0377521    .0388882
 _SstaXlows_24 |  -.0682103    .000297  -229.64   0.000    -.0688072   -.0676134
 _SstaXlows_25 |   -.008108   .0002397   -33.83   0.000    -.0085897   -.0076264
 _SstaXlows_26 |   -.018158   .0002349   -77.30   0.000    -.0186301    -.017686
 _SstaXlows_27 |  -.0222506   .0001816  -122.55   0.000    -.0226154   -.0218857
 _SstaXlows_28 |   .0145395   .0026697     5.45   0.000     .0091746    .0199044
 _SstaXlows_29 |    .011654   .0002738    42.56   0.000     .0111038    .0122043
 _SstaXlows_30 |  -.0288858   .0002664  -108.43   0.000    -.0294211   -.0283504
 _SstaXlows_31 |   .0086533   .0002187    39.56   0.000     .0082138    .0090929
 _SstaXlows_32 |  -.0862557   .0007791  -110.71   0.000    -.0878215     -.08469
 _SstaXlows_33 |  -.0006803   .0002947    -2.31   0.025    -.0012726   -.0000881
 _SstaXlows_34 |  -.0282797   .0002132  -132.64   0.000    -.0287081   -.0278512
 _SstaXlows_35 |  -.0456063   .0003884  -117.42   0.000    -.0463867   -.0448258
 _SstaXlows_36 |  -.0252885   .0002186  -115.71   0.000    -.0257277   -.0248493
 _SstaXlows_37 |   .0455423   .0003164   143.94   0.000     .0449065    .0461781
 _SstaXlows_38 |  -.0367782   .0002186  -168.25   0.000    -.0372175   -.0363389
 _SstaXlows_39 |   .0194691   .0022035     8.84   0.000     .0150409    .0238973
 _SstaXlows_40 |  -.0294885    .000226  -130.48   0.000    -.0299427   -.0290344
 _SstaXlows_41 |  -.0221364   .0003113   -71.11   0.000     -.022762   -.0215108
 _SstaXlows_42 |    .021394   .0002539    84.28   0.000     .0208838    .0219041
 _SstaXlows_44 |    .044895   .0002537   176.97   0.000     .0443852    .0454047
 _SstaXlows_45 |  -.0141336   .0056046    -2.52   0.015    -.0253964   -.0028708
 _SstaXlows_46 |  -.0053012    .000211   -25.13   0.000    -.0057251   -.0048773
 _SstaXlows_47 |   .0171279   .0028285     6.06   0.000     .0114438     .022812
 _SstaXlows_48 |  -.0610022   .0003722  -163.91   0.000    -.0617501   -.0602543
 _SstaXlows_49 |  -.0088541    .002443    -3.62   0.001    -.0137635   -.0039447
 _SstaXlows_50 |   .0043388   .0002614    16.60   0.000     .0038135    .0048641
 _SstaXlows_51 |  -.0357892   .0003153  -113.50   0.000    -.0364229   -.0351556
 _SstaXlows_53 |  -.0557324   .0003736  -149.18   0.000    -.0564832   -.0549817
 _SstaXlows_54 |  -.0216096    .000276   -78.30   0.000    -.0221642    -.021055
 _SstaXlows_55 |   .0293339   .0002777   105.65   0.000     .0287759    .0298918
 _SstaXlows_56 |  -.0460659   .0002267  -203.23   0.000    -.0465214   -.0456104
  _SstaXttre_1 |   .0008255     .00065     1.27   0.210    -.0004808    .0021318
  _SstaXttre_2 |   .0113801   .0005144    22.12   0.000     .0103464    .0124138
  _SstaXttre_4 |  -.0021508   .0006186    -3.48   0.001    -.0033939   -.0009077
  _SstaXttre_5 |   .0142681   .0003792    37.63   0.000     .0135061    .0150301
  _SstaXttre_6 |   .0048407   .0003099    15.62   0.000     .0042178    .0054635
  _SstaXttre_8 |    .007597   .0002033    37.38   0.000     .0071886    .0080055
  _SstaXttre_9 |   .0037995   .0001862    20.41   0.000     .0034253    .0041737
 _SstaXttre_10 |   .0070449   .0001951    36.10   0.000     .0066528     .007437
 _SstaXttre_12 |   .0065823   .0007162     9.19   0.000     .0051431    .0080215
 _SstaXttre_13 |   .0026969   .0006973     3.87   0.000     .0012956    .0040982
 _SstaXttre_15 |   .0105383   .0003151    33.44   0.000     .0099051    .0111716
 _SstaXttre_16 |   .0090745   .0009505     9.55   0.000     .0071645    .0109845
 _SstaXttre_18 |   .0040868   .0002517    16.24   0.000      .003581    .0045926
 _SstaXttre_19 |   .0024276   .0008586     2.83   0.007     .0007023     .004153
 _SstaXttre_20 |  -.0020846   .0002235    -9.33   0.000    -.0025338   -.0016354
 _SstaXttre_21 |   .0064108   .0002747    23.34   0.000     .0058589    .0069627
 _SstaXttre_22 |   .0057906   .0003143    18.42   0.000      .005159    .0064223
 _SstaXttre_23 |  -.0020732   .0003948    -5.25   0.000    -.0028665   -.0012798
 _SstaXttre_24 |   .0000465   .0002808     0.17   0.869    -.0005177    .0006107
 _SstaXttre_25 |   .0009476   .0002596     3.65   0.001      .000426    .0014693
 _SstaXttre_26 |   .0039629   .0001515    26.16   0.000     .0036585    .0042674
 _SstaXttre_27 |   .0028868   .0003405     8.48   0.000     .0022026    .0035711
 _SstaXttre_28 |   .0087759   .0006623    13.25   0.000      .007445    .0101068
 _SstaXttre_29 |    .016771   .0001973    85.00   0.000     .0163745    .0171675
 _SstaXttre_30 |   .0013672    .000389     3.51   0.001     .0005855    .0021488
 _SstaXttre_31 |   .0100269   .0002983    33.61   0.000     .0094274    .0106264
 _SstaXttre_32 |   .0142764   .0002355    60.62   0.000     .0138031    .0147497
 _SstaXttre_33 |   .0053562   .0003649    14.68   0.000      .004623    .0060894
 _SstaXttre_34 |   .0023567   .0000659    35.74   0.000     .0022242    .0024892
 _SstaXttre_35 |    .007659   .0004967    15.42   0.000     .0066609    .0086571
 _SstaXttre_36 |   .0026692   .0000835    31.95   0.000     .0025013    .0028371
 _SstaXttre_37 |   .0157567   .0001814    86.87   0.000     .0153922    .0161212
 _SstaXttre_38 |   .0075588    .000365    20.71   0.000     .0068252    .0082923
 _SstaXttre_39 |   .0048328   .0005425     8.91   0.000     .0037427    .0059229
 _SstaXttre_40 |   .0056833   .0002247    25.30   0.000     .0052319    .0061348
 _SstaXttre_41 |   .0068774   .0003227    21.31   0.000     .0062288     .007526
 _SstaXttre_42 |  -.0023512   .0002355    -9.99   0.000    -.0028244    -.001878
 _SstaXttre_44 |  -.0014154   .0002748    -5.15   0.000    -.0019677   -.0008631
 _SstaXttre_45 |   .0180236   .0016197    11.13   0.000     .0147686    .0212786
 _SstaXttre_46 |   .0101632   .0003808    26.69   0.000     .0093979    .0109285
 _SstaXttre_47 |    .008722   .0007492    11.64   0.000     .0072163    .0102276
 _SstaXttre_48 |   .0072035   .0003414    21.10   0.000     .0065175    .0078895
 _SstaXttre_49 |    .007448   .0008102     9.19   0.000     .0058199    .0090761
 _SstaXttre_50 |  -.0007457   .0003885    -1.92   0.061    -.0015266    .0000351
 _SstaXttre_51 |   .0095127    .000189    50.34   0.000     .0091329    .0098925
 _SstaXttre_53 |   .0040107    .000311    12.90   0.000     .0033857    .0046356
 _SstaXttre_54 |  -.0057574   .0003867   -14.89   0.000    -.0065344   -.0049803
 _SstaXttre_55 |  -.0022682   .0003058    -7.42   0.000    -.0028828   -.0016536
 _SstaXttre_56 |   .0040795   .0003131    13.03   0.000     .0034503    .0047087
  _SstaXttrea1 |  -.0000815   .0000763    -1.07   0.291    -.0002349    .0000719
  _SstaXttrea2 |  -.0008311    .000037   -22.48   0.000    -.0009054   -.0007568
  _SstaXttrea4 |   .0001368   .0000822     1.66   0.103    -.0000285    .0003021
  _SstaXttrea5 |  -.0007241   .0000272   -26.60   0.000    -.0007788   -.0006694
  _SstaXttrea6 |  -.0005368   .0000271   -19.83   0.000    -.0005912   -.0004824
  _SstaXttrea8 |  -.0007241   .0000141   -51.29   0.000    -.0007524   -.0006957
  _SstaXttrea9 |  -.0006536   .0000142   -46.10   0.000    -.0006821   -.0006251
 _SstaXttrea10 |  -.0009066   .0000164   -55.26   0.000    -.0009396   -.0008736
 _SstaXttrea12 |   -.000592   .0000645    -9.18   0.000    -.0007217   -.0004624
 _SstaXttrea13 |  -.0001203   .0000702    -1.71   0.093    -.0002614    .0000208
 _SstaXttrea15 |  -.0008334    .000024   -34.74   0.000    -.0008816   -.0007852
 _SstaXttrea16 |  -.0004906   .0000882    -5.56   0.000    -.0006678   -.0003134
 _SstaXttrea18 |  -.0001654   .0000197    -8.38   0.000     -.000205   -.0001257
 _SstaXttrea19 |  -8.90e-06   .0000956    -0.09   0.926    -.0002009    .0001831
 _SstaXttrea20 |   .0000353   .0000169     2.09   0.042     1.29e-06    .0000693
 _SstaXttrea21 |  -.0004993   .0000219   -22.75   0.000    -.0005435   -.0004552
 _SstaXttrea22 |  -.0004866   .0000218   -22.27   0.000    -.0005305   -.0004427
 _SstaXttrea23 |  -.0002187   .0000303    -7.21   0.000    -.0002797   -.0001578
 _SstaXttrea24 |  -.0002715   .0000206   -13.18   0.000    -.0003129   -.0002301
 _SstaXttrea25 |   -.000475   .0000195   -24.38   0.000    -.0005141   -.0004358
 _SstaXttrea26 |  -.0002732    .000013   -21.07   0.000    -.0002993   -.0002472
 _SstaXttrea27 |   -.000083   .0000261    -3.18   0.003    -.0001355   -.0000305
 _SstaXttrea28 |  -.0005952   .0000607    -9.81   0.000    -.0007172   -.0004732
 _SstaXttrea29 |  -.0012165   .0000166   -73.26   0.000    -.0012499   -.0011832
 _SstaXttrea30 |   1.52e-06   .0000292     0.05   0.959    -.0000571    .0000602
 _SstaXttrea31 |  -.0005654   .0000221   -25.64   0.000    -.0006097    -.000521
 _SstaXttrea32 |  -.0009841   .0000166   -59.24   0.000    -.0010175   -.0009508
 _SstaXttrea33 |  -.0007659   .0000279   -27.41   0.000    -.0008221   -.0007098
 _SstaXttrea34 |  -.0004813   3.67e-06  -131.27   0.000    -.0004887    -.000474
 _SstaXttrea35 |   -.000603   .0000453   -13.30   0.000    -.0006942   -.0005119
 _SstaXttrea36 |  -.0003567   5.83e-06   -61.16   0.000    -.0003684   -.0003449
 _SstaXttrea37 |  -.0012942   .0000154   -84.19   0.000     -.001325   -.0012633
 _SstaXttrea38 |  -.0004045   .0000281   -14.37   0.000     -.000461   -.0003479
 _SstaXttrea39 |  -.0004264   .0000446    -9.56   0.000     -.000516   -.0003367
 _SstaXttrea40 |  -.0005667    .000016   -35.53   0.000    -.0005987   -.0005346
 _SstaXttrea41 |  -.0005475   .0000242   -22.59   0.000    -.0005962   -.0004988
 _SstaXttrea42 |  -.0000545    .000019    -2.86   0.006    -.0000927   -.0000162
 _SstaXttrea44 |  -.0001178   .0000199    -5.91   0.000    -.0001578   -.0000777
 _SstaXttrea45 |  -.0011574   .0000954   -12.13   0.000    -.0013492   -.0009656
 _SstaXttrea46 |  -.0005902   .0000286   -20.65   0.000    -.0006477   -.0005328
 _SstaXttrea47 |  -.0006249   .0000717    -8.72   0.000     -.000769   -.0004808
 _SstaXttrea48 |  -.0004949   .0000307   -16.12   0.000    -.0005566   -.0004332
 _SstaXttrea49 |  -.0005808   .0000653    -8.89   0.000     -.000712   -.0004495
 _SstaXttrea50 |    .000061   .0000298     2.05   0.046     1.07e-06     .000121
 _SstaXttrea51 |  -.0009775   .0000151   -64.92   0.000    -.0010078   -.0009473
 _SstaXttrea53 |  -.0003254   .0000238   -13.69   0.000    -.0003732   -.0002777
 _SstaXttrea54 |   .0001972   .0000303     6.51   0.000     .0001364    .0002581
 _SstaXttrea55 |   .0003375   .0000232    14.57   0.000      .000291    .0003841
 _SstaXttrea56 |  -.0004946   .0000233   -21.20   0.000    -.0005414   -.0004477
  _SstaXttreb1 |   3.03e-06   1.67e-06     1.81   0.076    -3.30e-07    6.39e-06
  _SstaXttreb2 |   .0000195   5.07e-07    38.53   0.000     .0000185    .0000205
  _SstaXttreb4 |  -3.09e-07   1.90e-06    -0.16   0.872    -4.14e-06    3.52e-06
  _SstaXttreb5 |   .0000129   3.39e-07    38.24   0.000     .0000123    .0000136
  _SstaXttreb6 |   .0000135   5.81e-07    23.28   0.000     .0000124    .0000147
  _SstaXttreb8 |   .0000171   2.78e-07    61.71   0.000     .0000166    .0000177
  _SstaXttreb9 |   .0000166   2.85e-07    58.34   0.000      .000016    .0000172
 _SstaXttreb10 |   .0000223   3.55e-07    62.67   0.000     .0000215     .000023
 _SstaXttreb12 |   .0000152   1.18e-06    12.87   0.000     .0000128    .0000175
 _SstaXttreb13 |   2.01e-06   1.42e-06     1.41   0.165    -8.55e-07    4.87e-06
 _SstaXttreb15 |   .0000193   4.88e-07    39.61   0.000     .0000183    .0000203
 _SstaXttreb16 |   .0000107   1.71e-06     6.23   0.000     7.21e-06    .0000141
 _SstaXttreb18 |   2.55e-06   4.28e-07     5.96   0.000     1.69e-06    3.41e-06
 _SstaXttreb19 |   1.97e-06   2.09e-06     0.94   0.350    -2.22e-06    6.16e-06
 _SstaXttreb20 |   2.88e-06   3.42e-07     8.41   0.000     2.19e-06    3.56e-06
 _SstaXttreb21 |   .0000117   4.67e-07    25.15   0.000     .0000108    .0000127
 _SstaXttreb22 |   .0000145   5.70e-07    25.45   0.000     .0000134    .0000156
 _SstaXttreb23 |   8.65e-06   6.26e-07    13.81   0.000     7.40e-06    9.91e-06
 _SstaXttreb24 |   9.07e-06   4.17e-07    21.76   0.000     8.23e-06    9.91e-06
 _SstaXttreb25 |   .0000128   3.90e-07    32.86   0.000      .000012    .0000136
 _SstaXttreb26 |   6.11e-06   2.84e-07    21.50   0.000     5.54e-06    6.68e-06
 _SstaXttreb27 |   1.76e-06   5.31e-07     3.31   0.002     6.93e-07    2.83e-06
 _SstaXttreb28 |   .0000135   1.15e-06    11.76   0.000     .0000112    .0000158
 _SstaXttreb29 |   .0000251   3.67e-07    68.33   0.000     .0000243    .0000258
 _SstaXttreb30 |   6.83e-07   5.84e-07     1.17   0.248    -4.90e-07    1.86e-06
 _SstaXttreb31 |   .0000127   4.41e-07    28.88   0.000     .0000118    .0000136
 _SstaXttreb32 |   .0000217   3.32e-07    65.42   0.000     .0000211    .0000224
 _SstaXttreb33 |   .0000184   5.70e-07    32.32   0.000     .0000173    .0000196
 _SstaXttreb34 |   .0000126   7.23e-08   174.32   0.000     .0000125    .0000128
 _SstaXttreb35 |   .0000167   9.96e-07    16.73   0.000     .0000147    .0000187
 _SstaXttreb36 |   9.32e-06   1.20e-07    77.76   0.000     9.08e-06    9.56e-06
 _SstaXttreb37 |   .0000259   3.37e-07    76.85   0.000     .0000252    .0000265
 _SstaXttreb38 |   .0000108   5.72e-07    18.95   0.000     9.69e-06     .000012
 _SstaXttreb39 |   .0000102   6.80e-07    15.00   0.000     8.84e-06    .0000116
 _SstaXttreb40 |   .0000156   3.22e-07    48.45   0.000      .000015    .0000163
 _SstaXttreb41 |   .0000129   4.91e-07    26.30   0.000     .0000119    .0000139
 _SstaXttreb42 |   4.78e-06   4.10e-07    11.66   0.000     3.96e-06    5.61e-06
 _SstaXttreb44 |   3.47e-06   4.01e-07     8.65   0.000     2.67e-06    4.28e-06
 _SstaXttreb45 |   .0000223   1.71e-06    13.09   0.000     .0000189    .0000258
 _SstaXttreb46 |   .0000141   5.81e-07    24.27   0.000     .0000129    .0000153
 _SstaXttreb47 |   .0000108   1.37e-06     7.89   0.000     8.08e-06    .0000136
 _SstaXttreb48 |   .0000116   6.60e-07    17.52   0.000     .0000102    .0000129
 _SstaXttreb49 |   .0000141   1.08e-06    13.03   0.000     .0000119    .0000163
 _SstaXttreb50 |  -1.27e-07   6.13e-07    -0.21   0.836    -1.36e-06    1.10e-06
 _SstaXttreb51 |   .0000229   3.16e-07    72.53   0.000     .0000223    .0000235
 _SstaXttreb53 |   8.40e-06   4.82e-07    17.42   0.000     7.43e-06    9.37e-06
 _SstaXttreb54 |   4.76e-07   6.42e-07     0.74   0.462    -8.15e-07    1.77e-06
 _SstaXttreb55 |  -7.41e-06   4.76e-07   -15.58   0.000    -8.36e-06   -6.45e-06
 _SstaXttreb56 |   .0000177   4.74e-07    37.30   0.000     .0000167    .0000186
         _cons |  -.0351801   .0146839    -2.40   0.020    -.0646885   -.0056717
--------------------------------------------------------------------------------

. estimates store empdhi3 ;

. *** Spec 4: Sub demog group specific cubic time trends for group specific year FE ;
. drop _S* _T* ;

. xi, prefix(_S) i.statefip*black i.statefip*hisp i.statefip*female i.statefip*young i.statefip*lowskill 
>   i.statefip*ttrend i.statefip*ttrend2 i.statefip*ttrend3 ;
i.statefip        _Sstatefip_1-56     (naturally coded; _Sstatefip_17 omitted)
i.state~p*black   _SstaXblac_#        (coded as above)
i.statefip*hisp   _SstaXhisp_#        (coded as above)
i.stat~p*female   _SstaXfema_#        (coded as above)
i.state~p*young   _SstaXyoun_#        (coded as above)
i.stat~p*lows~l   _SstaXlows_#        (coded as above)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)
i.stat~p*ttre~2   _SstaXttrea#        (coded as above)
i.stat~p*ttre~3   _SstaXttreb#        (coded as above)

. global controls blackpro hisppro femalepro youngpro lowskillpro pro
>   black hisp female lowskill age age2
>   tt* _S* ;

.   reg empdhi $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 3,252,460,320)

Linear regression                               Number of obs     =  2,075,295
                                                F(22, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0648
                                                Root MSE          =     .43337

                               (Std. Err. adjusted for 50 clusters in statefip)
-------------------------------------------------------------------------------
              |               Robust
       empdhi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
     blackpro |   .0159631   .0104815     1.52   0.134    -.0051002    .0370264
      hisppro |   -.007783    .010318    -0.75   0.454    -.0285179    .0129518
    femalepro |  -.0159085   .0083413    -1.91   0.062    -.0326711     .000854
     youngpro |  -.0099049   .0068021    -1.46   0.152    -.0235743    .0037646
  lowskillpro |   .0081975    .006411     1.28   0.207    -.0046859     .021081
          pro |  -.0075937   .0094795    -0.80   0.427    -.0266435    .0114562
        black |   .0455039   .0088672     5.13   0.000     .0276845    .0633232
         hisp |   .1192074   .0053162    22.42   0.000     .1085242    .1298907
       female |  -.1835935   .0050079   -36.66   0.000    -.1936573   -.1735297
     lowskill |   .1378896   .0045934    30.02   0.000     .1286587    .1471204
          age |   .0207453   .0007745    26.79   0.000     .0191888    .0223017
         age2 |  -.0002301   9.33e-06   -24.67   0.000    -.0002488   -.0002114
       ttrend |   -.004729   .0007656    -6.18   0.000    -.0062676   -.0031905
      ttrend2 |   .0002973   .0000545     5.46   0.000     .0001878    .0004069
      ttrend3 |  -9.64e-06   1.12e-06    -8.61   0.000    -.0000119   -7.39e-06
     ttrendbl |   .0038522   .0026726     1.44   0.156    -.0015186    .0092231
    ttrend2bl |  -.0002708   .0001894    -1.43   0.159    -.0006514    .0001097
    ttrend3bl |   4.58e-06   3.72e-06     1.23   0.224    -2.90e-06     .000012
     ttrendhi |  -.0035781   .0017737    -2.02   0.049    -.0071425   -.0000137
    ttrend2hi |   .0000677   .0001563     0.43   0.667    -.0002465    .0003818
    ttrend3hi |  -5.42e-07   3.33e-06    -0.16   0.871    -7.23e-06    6.15e-06
     ttrendfe |   .0013389   .0010344     1.29   0.202    -.0007397    .0034175
    ttrend2fe |  -8.48e-06   .0000797    -0.11   0.916    -.0001686    .0001516
    ttrend3fe |   3.98e-07   1.82e-06     0.22   0.828    -3.26e-06    4.06e-06
     ttrendyo |  -.0068964   .0011609    -5.94   0.000    -.0092294   -.0045635
    ttrend2yo |   .0004073   .0000924     4.41   0.000     .0002216    .0005929
    ttrend3yo |  -6.99e-06   2.07e-06    -3.38   0.001    -.0000111   -2.84e-06
     ttrendlo |  -.0075677   .0008879    -8.52   0.000    -.0093519   -.0057835
    ttrend2lo |   .0003092   .0000713     4.34   0.000     .0001659    .0004525
    ttrend3lo |  -5.48e-06   1.63e-06    -3.35   0.002    -8.77e-06   -2.20e-06
 _Sstatefip_1 |   .0094458   .0029585     3.19   0.002     .0035006     .015391
 _Sstatefip_2 |   -.064658   .0023323   -27.72   0.000    -.0693449   -.0599712
 _Sstatefip_4 |  -.0558722   .0038877   -14.37   0.000    -.0636849   -.0480596
 _Sstatefip_5 |   -.115691    .002106   -54.93   0.000    -.1199232   -.1114589
 _Sstatefip_6 |  -.0490548   .0009832   -49.89   0.000    -.0510306   -.0470791
 _Sstatefip_8 |  -.0523816   .0008955   -58.49   0.000    -.0541812   -.0505819
 _Sstatefip_9 |   .0251008   .0008616    29.13   0.000     .0233695    .0268322
_Sstatefip_10 |   .0219225   .0009356    23.43   0.000     .0200423    .0238026
_Sstatefip_12 |  -.1115639   .0028295   -39.43   0.000    -.1172501   -.1058777
_Sstatefip_13 |  -.0511398   .0030086   -17.00   0.000    -.0571858   -.0450938
_Sstatefip_15 |  -.1266963    .001111  -114.04   0.000     -.128929   -.1244636
_Sstatefip_16 |  -.1110533   .0033773   -32.88   0.000    -.1178401   -.1042664
_Sstatefip_18 |   .0249401   .0013778    18.10   0.000     .0221712     .027709
_Sstatefip_19 |  -.0699911   .0034283   -20.42   0.000    -.0768806   -.0631017
_Sstatefip_20 |  -.0077047   .0010101    -7.63   0.000    -.0097345   -.0056748
_Sstatefip_21 |  -.0164164   .0012496   -13.14   0.000    -.0189275   -.0139052
_Sstatefip_22 |  -.0486048   .0016203   -30.00   0.000    -.0518609   -.0453487
_Sstatefip_23 |    .004214   .0014752     2.86   0.006     .0012494    .0071785
_Sstatefip_24 |  -.0172449    .001156   -14.92   0.000     -.019568   -.0149218
_Sstatefip_25 |   .0127204   .0010739    11.84   0.000     .0105622    .0148786
_Sstatefip_26 |   .0624949   .0008749    71.43   0.000     .0607368     .064253
_Sstatefip_27 |  -.0438025   .0013683   -32.01   0.000    -.0465522   -.0410527
_Sstatefip_28 |  -.0483733   .0026037   -18.58   0.000    -.0536057   -.0431408
_Sstatefip_29 |  -.0682978    .001065   -64.13   0.000     -.070438   -.0661575
_Sstatefip_30 |  -.1179169   .0012991   -90.77   0.000    -.1205276   -.1153062
_Sstatefip_31 |   -.138902   .0011521  -120.57   0.000    -.1412172   -.1365868
_Sstatefip_32 |  -.1907058   .0010618  -179.61   0.000    -.1928395   -.1885721
_Sstatefip_33 |   .0408727   .0013019    31.39   0.000     .0382564    .0434891
_Sstatefip_34 |   .0034433   .0007794     4.42   0.000     .0018771    .0050095
_Sstatefip_35 |  -.1227234   .0012102  -101.40   0.000    -.1251555   -.1202913
_Sstatefip_36 |   -.035751   .0007585   -47.13   0.000    -.0372753   -.0342268
_Sstatefip_37 |  -.0465815   .0010574   -44.05   0.000    -.0487065   -.0444565
_Sstatefip_38 |  -.1680024   .0012481  -134.61   0.000    -.1705106   -.1654943
_Sstatefip_39 |   .0379933    .002303    16.50   0.000     .0333652    .0426214
_Sstatefip_40 |  -.0038206   .0010878    -3.51   0.001    -.0060066   -.0016346
_Sstatefip_41 |  -.0343465   .0011616   -29.57   0.000    -.0366808   -.0320121
_Sstatefip_42 |   .0256544   .0011459    22.39   0.000     .0233516    .0279571
_Sstatefip_44 |   .0096395   .0012085     7.98   0.000     .0072109    .0120681
_Sstatefip_45 |  -.0684752   .0047989   -14.27   0.000     -.078119   -.0588314
_Sstatefip_46 |  -.1754941   .0014912  -117.69   0.000    -.1784908   -.1724974
_Sstatefip_47 |  -.0139624   .0028318    -4.93   0.000    -.0196531   -.0082717
_Sstatefip_48 |  -.0438776   .0009662   -45.41   0.000    -.0458192    -.041936
_Sstatefip_49 |  -.0421209    .003146   -13.39   0.000     -.048443   -.0357988
_Sstatefip_50 |  -.0578888   .0013809   -41.92   0.000    -.0606638   -.0551139
_Sstatefip_51 |  -.0218036   .0008856   -24.62   0.000    -.0235834   -.0200238
_Sstatefip_53 |  -.0228257   .0010945   -20.85   0.000    -.0250252   -.0206262
_Sstatefip_54 |   .0835101   .0014909    56.01   0.000     .0805141    .0865061
_Sstatefip_55 |     .01661   .0013248    12.54   0.000     .0139478    .0192723
_Sstatefip_56 |  -.0036932   .0011165    -3.31   0.002    -.0059368   -.0014496
 _SstaXblac_1 |  -.0163914   .0056909    -2.88   0.006    -.0278277   -.0049551
 _SstaXblac_2 |  -.0868733   .0032188   -26.99   0.000    -.0933417   -.0804049
 _SstaXblac_4 |  -.0492802   .0071151    -6.93   0.000    -.0635786   -.0349818
 _SstaXblac_5 |   .0189869   .0034904     5.44   0.000     .0119727    .0260011
 _SstaXblac_6 |  -.0022611   .0001518   -14.89   0.000    -.0025663    -.001956
 _SstaXblac_8 |   .0141362   .0001641    86.15   0.000     .0138064    .0144659
 _SstaXblac_9 |  -.0102451   .0000817  -125.33   0.000    -.0104094   -.0100808
_SstaXblac_10 |   .0104605   .0002257    46.34   0.000     .0100069    .0109141
_SstaXblac_12 |  -.0200389   .0043781    -4.58   0.000    -.0288371   -.0112408
_SstaXblac_13 |   .0011366   .0053474     0.21   0.833    -.0096093    .0118825
_SstaXblac_15 |  -.1458736   .0006142  -237.50   0.000    -.1471079   -.1446393
_SstaXblac_16 |   .0468597   .0067586     6.93   0.000     .0332777    .0604416
_SstaXblac_18 |  -.0297926   .0001664  -179.04   0.000     -.030127   -.0294582
_SstaXblac_19 |  -.0385654   .0064827    -5.95   0.000    -.0515929    -.025538
_SstaXblac_20 |   .0048248   .0002339    20.63   0.000     .0043548    .0052947
_SstaXblac_21 |  -.0268306   .0003357   -79.93   0.000    -.0275051    -.026156
_SstaXblac_22 |  -.0328891   .0029142   -11.29   0.000    -.0387453   -.0270328
_SstaXblac_23 |   .0768865   .0005269   145.93   0.000     .0758277    .0779453
_SstaXblac_24 |   .0313243   .0001093   286.60   0.000     .0311047     .031544
_SstaXblac_25 |  -.0487292   .0004032  -120.85   0.000    -.0495395   -.0479189
_SstaXblac_26 |   .0055562   .0001265    43.91   0.000     .0053019    .0058105
_SstaXblac_27 |   -.016677   .0007428   -22.45   0.000    -.0181697   -.0151842
_SstaXblac_28 |   .0419142   .0044902     9.33   0.000     .0328908    .0509377
_SstaXblac_29 |  -.0433231   .0001347  -321.61   0.000    -.0435938   -.0430524
_SstaXblac_30 |  -.1484533   .0008068  -184.00   0.000    -.1500747   -.1468319
_SstaXblac_31 |  -.0285923   .0002371  -120.60   0.000    -.0290688   -.0281159
_SstaXblac_32 |  -.0619735   .0004562  -135.85   0.000    -.0628902   -.0610568
_SstaXblac_33 |  -.0627721   .0010428   -60.20   0.000    -.0648676   -.0606765
_SstaXblac_34 |   .0118469   .0000649   182.52   0.000     .0117164    .0119773
_SstaXblac_35 |  -.0288021   .0002457  -117.21   0.000    -.0292959   -.0283083
_SstaXblac_36 |   -.055926   .0000623  -897.65   0.000    -.0560512   -.0558008
_SstaXblac_37 |  -.0009962   .0001356    -7.35   0.000    -.0012687   -.0007237
_SstaXblac_38 |  -.1107078   .0006063  -182.61   0.000    -.1119261   -.1094895
_SstaXblac_39 |  -.0402914   .0038286   -10.52   0.000    -.0479852   -.0325976
_SstaXblac_40 |   -.041506   .0001017  -408.25   0.000    -.0417103   -.0413017
_SstaXblac_41 |  -.0073847   .0003886   -19.01   0.000    -.0081656   -.0066039
_SstaXblac_42 |   -.060715   .0001673  -363.02   0.000    -.0610511   -.0603789
_SstaXblac_44 |  -.0167022   .0006156   -27.13   0.000    -.0179393    -.015465
_SstaXblac_45 |   .0325711   .0090865     3.58   0.001      .014311    .0508312
_SstaXblac_46 |   .2294156   .0011403   201.19   0.000     .2271242    .2317071
_SstaXblac_47 |  -.0335635    .004622    -7.26   0.000    -.0428518   -.0242753
_SstaXblac_48 |  -.0128889    .000144   -89.49   0.000    -.0131783   -.0125995
_SstaXblac_49 |  -.0542012   .0059235    -9.15   0.000    -.0661049   -.0422975
_SstaXblac_50 |   .0339589   .0011038    30.77   0.000     .0317408    .0361769
_SstaXblac_51 |   .0149976   .0001212   123.77   0.000     .0147541    .0152411
_SstaXblac_53 |  -.0485488   .0003226  -150.49   0.000    -.0491971   -.0479006
_SstaXblac_54 |  -.0387391   .0002467  -157.02   0.000    -.0392349   -.0382433
_SstaXblac_55 |  -.0708486   .0002192  -323.28   0.000     -.071289   -.0704082
_SstaXblac_56 |  -.0959843   .0004946  -194.05   0.000    -.0969783   -.0949903
 _SstaXhisp_1 |   -.033297   .0086008    -3.87   0.000     -.050581   -.0160131
 _SstaXhisp_2 |  -.1299421   .0048897   -26.57   0.000    -.1397683   -.1201159
 _SstaXhisp_4 |  -.0695339   .0073813    -9.42   0.000    -.0843672   -.0547007
 _SstaXhisp_5 |   .0486734   .0061493     7.92   0.000      .036316    .0610308
 _SstaXhisp_6 |  -.0426677   .0002793  -152.77   0.000     -.043229   -.0421065
 _SstaXhisp_8 |  -.0345182    .000474   -72.83   0.000    -.0354706   -.0335657
 _SstaXhisp_9 |  -.0333073   .0004052   -82.20   0.000    -.0341216    -.032493
_SstaXhisp_10 |  -.0490867   .0011355   -43.23   0.000    -.0513684   -.0468049
_SstaXhisp_12 |  -.0656443   .0053494   -12.27   0.000    -.0763944   -.0548942
_SstaXhisp_13 |  -.0576772   .0077225    -7.47   0.000    -.0731961   -.0421583
_SstaXhisp_15 |  -.0864897   .0008413  -102.80   0.000    -.0881804   -.0847989
_SstaXhisp_16 |  -.0239275   .0059746    -4.00   0.000    -.0359339    -.011921
_SstaXhisp_18 |  -.0255141   .0008548   -29.85   0.000    -.0272319   -.0237963
_SstaXhisp_19 |   .1236689   .0081779    15.12   0.000     .1072348    .1401031
_SstaXhisp_20 |  -.0614882   .0007034   -87.42   0.000    -.0629017   -.0600747
_SstaXhisp_21 |  -.1504827    .001735   -86.73   0.000    -.1539694    -.146996
_SstaXhisp_22 |  -.1156333   .0039931   -28.96   0.000    -.1236578   -.1076089
_SstaXhisp_23 |  -.1249405   .0007933  -157.50   0.000    -.1265346   -.1233463
_SstaXhisp_24 |  -.1635323   .0012717  -128.59   0.000    -.1660879   -.1609766
_SstaXhisp_25 |  -.0414418   .0008707   -47.59   0.000    -.0431916    -.039692
_SstaXhisp_26 |  -.0318176   .0004628   -68.75   0.000    -.0327477   -.0308876
_SstaXhisp_27 |  -.0532503   .0016281   -32.71   0.000    -.0565221   -.0499785
_SstaXhisp_28 |  -.0055641   .0077323    -0.72   0.475    -.0211026    .0099745
_SstaXhisp_29 |  -.0520064   .0007583   -68.58   0.000    -.0535304   -.0504825
_SstaXhisp_30 |  -.1252372   .0007158  -174.95   0.000    -.1266758   -.1237987
_SstaXhisp_31 |   .0875607   .0011262    77.75   0.000     .0852976    .0898239
_SstaXhisp_32 |  -.1246466   .0011713  -106.42   0.000    -.1270004   -.1222928
_SstaXhisp_33 |  -.0065286   .0010993    -5.94   0.000    -.0087376   -.0043195
_SstaXhisp_34 |   .0016945   .0002176     7.79   0.000     .0012572    .0021318
_SstaXhisp_35 |  -.0535101   .0006066   -88.22   0.000     -.054729   -.0522911
_SstaXhisp_36 |  -.0807456   .0003452  -233.89   0.000    -.0814393   -.0800518
_SstaXhisp_37 |   -.115853   .0022178   -52.24   0.000    -.1203099   -.1113962
_SstaXhisp_38 |  -.0185607   .0007142   -25.99   0.000     -.019996   -.0171254
_SstaXhisp_39 |  -.0651452   .0059085   -11.03   0.000    -.0770188   -.0532716
_SstaXhisp_40 |  -.1293096   .0004612  -280.36   0.000    -.1302364   -.1283827
_SstaXhisp_41 |  -.0994139    .001185   -83.89   0.000    -.1017953   -.0970325
_SstaXhisp_42 |  -.0301362   .0009053   -33.29   0.000    -.0319554    -.028317
_SstaXhisp_44 |    .094331    .000872   108.18   0.000     .0925787    .0960833
_SstaXhisp_45 |  -.1409773   .0092172   -15.29   0.000       -.1595   -.1224545
_SstaXhisp_46 |   .0388795   .0015227    25.53   0.000     .0358196    .0419394
_SstaXhisp_47 |  -.1064424    .008194   -12.99   0.000    -.1229089   -.0899759
_SstaXhisp_48 |  -.0925493   .0002705  -342.20   0.000    -.0930928   -.0920058
_SstaXhisp_49 |  -.0300351   .0059491    -5.05   0.000    -.0419903   -.0180799
_SstaXhisp_50 |  -.1264353   .0007001  -180.59   0.000    -.1278423   -.1250284
_SstaXhisp_51 |  -.1899298   .0012586  -150.91   0.000     -.192459   -.1874007
_SstaXhisp_53 |  -.1520716   .0013336  -114.03   0.000    -.1547516   -.1493915
_SstaXhisp_54 |  -.1258812   .0009949  -126.53   0.000    -.1278806   -.1238819
_SstaXhisp_55 |   -.016967   .0016788   -10.11   0.000    -.0203406   -.0135933
_SstaXhisp_56 |  -.0879101   .0005925  -148.36   0.000    -.0891009   -.0867194
 _SstaXfema_1 |  -.0042056   .0043993    -0.96   0.344    -.0130464    .0046352
 _SstaXfema_2 |   .0565682   .0027585    20.51   0.000     .0510249    .0621115
 _SstaXfema_4 |   .0711839   .0052969    13.44   0.000     .0605394    .0818284
 _SstaXfema_5 |   .0213091   .0026888     7.93   0.000     .0159058    .0267124
 _SstaXfema_6 |      .0621    .000125   496.75   0.000     .0618487    .0623512
 _SstaXfema_8 |   .0433558   .0002459   176.33   0.000     .0428617    .0438499
 _SstaXfema_9 |   .0061586   .0001226    50.23   0.000     .0059123     .006405
_SstaXfema_10 |    .011712   .0001364    85.85   0.000     .0114378    .0119862
_SstaXfema_12 |   .0732521    .003596    20.37   0.000     .0660257    .0804786
_SstaXfema_13 |   .0382034   .0042084     9.08   0.000     .0297462    .0466606
_SstaXfema_15 |   .0873084   .0000763  1144.42   0.000     .0871551    .0874617
_SstaXfema_16 |   .0371704   .0039574     9.39   0.000     .0292177    .0451231
_SstaXfema_18 |  -.0469524   .0000528  -889.90   0.000    -.0470584   -.0468464
_SstaXfema_19 |   .0070839   .0043355     1.63   0.109    -.0016285    .0157964
_SstaXfema_20 |  -.0124007   .0000482  -257.15   0.000    -.0124976   -.0123038
_SstaXfema_21 |  -.0218893   .0000562  -389.70   0.000    -.0220022   -.0217764
_SstaXfema_22 |  -.0326736   .0022137   -14.76   0.000    -.0371222   -.0282249
_SstaXfema_23 |  -.0120373   .0000608  -197.85   0.000    -.0121596    -.011915
_SstaXfema_24 |   .0606517   .0000685   885.15   0.000      .060514    .0607894
_SstaXfema_25 |    .018346   .0000805   227.78   0.000     .0181842    .0185079
_SstaXfema_26 |  -.0698834   .0000528 -1324.31   0.000    -.0699895   -.0697774
_SstaXfema_27 |   .0087968   .0000761   115.55   0.000     .0086438    .0089497
_SstaXfema_28 |  -.0064831   .0034955    -1.85   0.070    -.0135076    .0005413
_SstaXfema_29 |   .0155345   .0000454   342.30   0.000     .0154433    .0156257
_SstaXfema_30 |   .0273787   .0000533   513.98   0.000     .0272717    .0274858
_SstaXfema_31 |   .0249209    .000041   607.74   0.000     .0248385    .0250033
_SstaXfema_32 |   .0849271   .0005072   167.45   0.000     .0839079    .0859462
_SstaXfema_33 |    .013738   .0000945   145.40   0.000     .0135481    .0139279
_SstaXfema_34 |    .034031   .0000442   769.98   0.000     .0339422    .0341199
_SstaXfema_35 |    .040096   .0001739   230.61   0.000     .0397466    .0404454
_SstaXfema_36 |   .0327126   .0000636   514.19   0.000     .0325848    .0328404
_SstaXfema_37 |   .0523276   .0001249   418.81   0.000     .0520765    .0525786
_SstaXfema_38 |   .0296882   .0000582   510.09   0.000     .0295712    .0298052
_SstaXfema_39 |  -.0539961   .0028658   -18.84   0.000    -.0597552    -.048237
_SstaXfema_40 |  -.0023817   .0001048   -22.72   0.000    -.0025924   -.0021711
_SstaXfema_41 |  -.0037674   .0001229   -30.66   0.000    -.0040143   -.0035204
_SstaXfema_42 |  -.0334967   .0000685  -488.90   0.000    -.0336344    -.033359
_SstaXfema_44 |    .016218   .0000751   215.84   0.000      .016067     .016369
_SstaXfema_45 |   .0250727   .0072553     3.46   0.001     .0104926    .0396528
_SstaXfema_46 |   .0453082   .0000546   829.15   0.000     .0451984     .045418
_SstaXfema_47 |   .0327178   .0036666     8.92   0.000     .0253496    .0400861
_SstaXfema_48 |   .0201743   .0001723   117.09   0.000      .019828    .0205205
_SstaXfema_49 |   .0333333   .0034635     9.62   0.000     .0263732    .0402934
_SstaXfema_50 |   .0252209   .0001169   215.80   0.000     .0249861    .0254558
_SstaXfema_51 |    .035848   .0001289   278.15   0.000      .035589     .036107
_SstaXfema_53 |   .0167962   .0001893    88.73   0.000     .0164158    .0171766
_SstaXfema_54 |  -.0937515   .0000657 -1427.32   0.000    -.0938835   -.0936195
_SstaXfema_55 |  -.0456691   .0000588  -776.46   0.000    -.0457873   -.0455509
_SstaXfema_56 |  -.0572554   .0000955  -599.63   0.000    -.0574473   -.0570635
 _SstaXyoun_1 |   .0193929   .0043285     4.48   0.000     .0106945    .0280913
 _SstaXyoun_2 |   .0202794   .0037249     5.44   0.000     .0127939    .0277648
 _SstaXyoun_4 |   .0203289   .0048915     4.16   0.000     .0104991    .0301587
 _SstaXyoun_5 |   .0418445    .003598    11.63   0.000     .0346141     .049075
 _SstaXyoun_6 |    .020015   .0034052     5.88   0.000     .0131719     .026858
 _SstaXyoun_8 |   .0027091   .0033552     0.81   0.423    -.0040335    .0094516
 _SstaXyoun_9 |    .000592   .0033408     0.18   0.860    -.0061214    .0073055
_SstaXyoun_10 |  -.0092207   .0033715    -2.73   0.009     -.015996   -.0024455
_SstaXyoun_12 |   .0523592   .0039658    13.20   0.000     .0443895    .0603288
_SstaXyoun_13 |   .0303655   .0042205     7.19   0.000      .021884     .038847
_SstaXyoun_15 |   .0125395   .0033849     3.70   0.001     .0057372    .0193417
_SstaXyoun_16 |    .025043    .004201     5.96   0.000     .0166007    .0334852
_SstaXyoun_18 |   .0071416   .0033387     2.14   0.037     .0004322     .013851
_SstaXyoun_19 |   .0143724   .0043209     3.33   0.002     .0056891    .0230557
_SstaXyoun_20 |   .0154345   .0033285     4.64   0.000     .0087456    .0221234
_SstaXyoun_21 |   .0089068   .0033649     2.65   0.011     .0021448    .0156688
_SstaXyoun_22 |   .0399836   .0035013    11.42   0.000     .0329474    .0470198
_SstaXyoun_23 |   .0264142   .0033529     7.88   0.000     .0196763     .033152
_SstaXyoun_24 |   .0114542   .0033191     3.45   0.001     .0047842    .0181242
_SstaXyoun_25 |   .0253489   .0033019     7.68   0.000     .0187135    .0319843
_SstaXyoun_26 |  -.0282869   .0033574    -8.43   0.000    -.0350338     -.02154
_SstaXyoun_27 |    .006337   .0033042     1.92   0.061     -.000303    .0129769
_SstaXyoun_28 |   .0383617   .0039207     9.78   0.000     .0304828    .0462405
_SstaXyoun_29 |   .0068414   .0033473     2.04   0.046     .0001147     .013568
_SstaXyoun_30 |   .0374185   .0032991    11.34   0.000     .0307887    .0440484
_SstaXyoun_31 |   .0311672   .0033394     9.33   0.000     .0244565     .037878
_SstaXyoun_32 |   .0654223   .0034315    19.07   0.000     .0585264    .0723181
_SstaXyoun_33 |   .0091882   .0033702     2.73   0.009     .0024155    .0159609
_SstaXyoun_34 |   .0036797   .0032986     1.12   0.270    -.0029491    .0103085
_SstaXyoun_35 |   .0314858   .0033872     9.30   0.000      .024679    .0382925
_SstaXyoun_36 |   .0264881   .0032807     8.07   0.000     .0198952     .033081
_SstaXyoun_37 |   .0175831   .0033845     5.20   0.000     .0107816    .0243845
_SstaXyoun_38 |   .0451817    .003309    13.65   0.000      .038532    .0518314
_SstaXyoun_39 |   -.017584   .0036708    -4.79   0.000    -.0249607   -.0102073
_SstaXyoun_40 |   .0007518   .0033182     0.23   0.822    -.0059163      .00742
_SstaXyoun_41 |   .0216912   .0033595     6.46   0.000       .01494    .0284424
_SstaXyoun_42 |   .0018308   .0033053     0.55   0.582    -.0048115    .0084731
_SstaXyoun_44 |    .011501   .0033258     3.46   0.001     .0048175    .0181845
_SstaXyoun_45 |   .0222294   .0061195     3.63   0.001     .0099317    .0345271
_SstaXyoun_46 |   .0588814   .0033318    17.67   0.000      .052186    .0655769
_SstaXyoun_47 |   .0403784   .0040328    10.01   0.000     .0322742    .0484825
_SstaXyoun_48 |   .0255553   .0033707     7.58   0.000     .0187816    .0323289
_SstaXyoun_49 |    .016273   .0040129     4.06   0.000     .0082087    .0243373
_SstaXyoun_50 |   .0289222    .003285     8.80   0.000     .0223208    .0355237
_SstaXyoun_51 |   .0029026   .0033524     0.87   0.391    -.0038342    .0096394
_SstaXyoun_53 |   .0070737   .0033901     2.09   0.042      .000261    .0138865
_SstaXyoun_54 |  -.0005603   .0033166    -0.17   0.867    -.0072252    .0061046
_SstaXyoun_55 |   .0190763   .0033267     5.73   0.000     .0123911    .0257615
_SstaXyoun_56 |   .0022856   .0032508     0.70   0.485    -.0042471    .0088183
 _SstaXlows_1 |   .0126599   .0033979     3.73   0.001     .0058316    .0194883
 _SstaXlows_2 |  -.0813763   .0019951   -40.79   0.000    -.0853857   -.0773669
 _SstaXlows_4 |  -.0906397   .0038431   -23.58   0.000    -.0983627   -.0829166
 _SstaXlows_5 |   .0355091   .0020432    17.38   0.000     .0314031    .0396152
 _SstaXlows_6 |  -.0602919   .0002272  -265.41   0.000    -.0607484   -.0598354
 _SstaXlows_8 |  -.0689398   .0003088  -223.27   0.000    -.0695603   -.0683193
 _SstaXlows_9 |  -.0084142   .0001439   -58.48   0.000    -.0087033   -.0081251
_SstaXlows_10 |  -.0685893   .0002644  -259.44   0.000    -.0691206    -.068058
_SstaXlows_12 |  -.0860992   .0026345   -32.68   0.000    -.0913934    -.080805
_SstaXlows_13 |   .0120517   .0030962     3.89   0.000     .0058296    .0182737
_SstaXlows_15 |   -.080361   .0001294  -620.97   0.000    -.0806211    -.080101
_SstaXlows_16 |   -.028336   .0028956    -9.79   0.000    -.0341549   -.0225171
_SstaXlows_18 |   .0295585   .0002511   117.73   0.000     .0290539     .030063
_SstaXlows_19 |   .0058799   .0033121     1.78   0.082     -.000776    .0125358
_SstaXlows_20 |  -.0030761   .0001183   -26.00   0.000    -.0033139   -.0028384
_SstaXlows_21 |   .0119514   .0002016    59.29   0.000     .0115464    .0123565
_SstaXlows_22 |  -.0351121   .0017364   -20.22   0.000    -.0386015   -.0316226
_SstaXlows_23 |   .0384624   .0001733   221.92   0.000     .0381141    .0388106
_SstaXlows_24 |  -.0681185   .0001954  -348.56   0.000    -.0685113   -.0677258
_SstaXlows_25 |  -.0078668   .0001451   -54.21   0.000    -.0081584   -.0075752
_SstaXlows_26 |  -.0179382   .0001363  -131.62   0.000     -.018212   -.0176643
_SstaXlows_27 |   -.022124    .000111  -199.25   0.000    -.0223471   -.0219008
_SstaXlows_28 |   .0152975   .0026859     5.70   0.000        .0099    .0206949
_SstaXlows_29 |   .0117542   .0001579    74.44   0.000     .0114369    .0120715
_SstaXlows_30 |  -.0287704   .0001648  -174.54   0.000    -.0291017   -.0284391
_SstaXlows_31 |   .0088511    .000117    75.65   0.000      .008616    .0090862
_SstaXlows_32 |  -.0861888    .000754  -114.31   0.000     -.087704   -.0846735
_SstaXlows_33 |  -.0004774   .0001756    -2.72   0.009    -.0008302   -.0001245
_SstaXlows_34 |  -.0280172   .0001218  -230.00   0.000     -.028262   -.0277724
_SstaXlows_35 |  -.0455663   .0003318  -137.32   0.000    -.0462332   -.0448995
_SstaXlows_36 |  -.0251501   .0001146  -219.39   0.000    -.0253804   -.0249197
_SstaXlows_37 |   .0457035   .0002577   177.34   0.000     .0451856    .0462214
_SstaXlows_38 |  -.0366726   .0001232  -297.79   0.000    -.0369201   -.0364251
_SstaXlows_39 |   .0201688   .0021866     9.22   0.000     .0157745     .024563
_SstaXlows_40 |  -.0294363   .0001658  -177.59   0.000    -.0297694   -.0291032
_SstaXlows_41 |  -.0217898   .0002532   -86.04   0.000    -.0222987   -.0212809
_SstaXlows_42 |   .0215933   .0001509   143.10   0.000       .02129    .0218965
_SstaXlows_44 |   .0448699   .0001247   359.87   0.000     .0446194    .0451205
_SstaXlows_45 |  -.0126298   .0055714    -2.27   0.028     -.023826   -.0014336
_SstaXlows_46 |  -.0050898   .0001511   -33.69   0.000    -.0053934   -.0047862
_SstaXlows_47 |   .0176059   .0028011     6.29   0.000     .0119769    .0232348
_SstaXlows_48 |  -.0608417   .0003099  -196.35   0.000    -.0614644    -.060219
_SstaXlows_49 |  -.0078145   .0024281    -3.22   0.002     -.012694   -.0029351
_SstaXlows_50 |   .0047305   .0002378    19.89   0.000     .0042526    .0052085
_SstaXlows_51 |  -.0358819   .0002051  -174.91   0.000    -.0362941   -.0354696
_SstaXlows_53 |  -.0554313   .0003049  -181.81   0.000     -.056044   -.0548186
_SstaXlows_54 |  -.0213099     .00019  -112.15   0.000    -.0216918   -.0209281
_SstaXlows_55 |   .0295332   .0001878   157.24   0.000     .0291557    .0299106
_SstaXlows_56 |  -.0459012   .0001418  -323.69   0.000    -.0461861   -.0456162
 _SstaXttre_1 |   .0003679   .0006755     0.54   0.588    -.0009895    .0017254
 _SstaXttre_2 |   .0112972   .0005612    20.13   0.000     .0101695    .0124249
 _SstaXttre_4 |  -.0021309   .0006688    -3.19   0.003    -.0034749   -.0007869
 _SstaXttre_5 |   .0142152   .0004206    33.80   0.000       .01337    .0150605
 _SstaXttre_6 |    .004756   .0002963    16.05   0.000     .0041606    .0053514
 _SstaXttre_8 |   .0078386   .0001806    43.41   0.000     .0074757    .0082014
 _SstaXttre_9 |   .0037369   .0001699    22.00   0.000     .0033956    .0040783
_SstaXttre_10 |   .0073327    .000121    60.61   0.000     .0070896    .0075758
_SstaXttre_12 |   .0061589   .0007659     8.04   0.000     .0046198     .007698
_SstaXttre_13 |    .002315   .0007713     3.00   0.004      .000765    .0038649
_SstaXttre_15 |   .0106697   .0003052    34.95   0.000     .0100563    .0112831
_SstaXttre_16 |    .008801   .0010237     8.60   0.000     .0067437    .0108582
_SstaXttre_18 |   .0041575   .0002608    15.94   0.000     .0036333    .0046816
_SstaXttre_19 |   .0018346   .0009147     2.01   0.050    -3.57e-06    .0036728
_SstaXttre_20 |  -.0020509   .0002136    -9.60   0.000    -.0024801   -.0016216
_SstaXttre_21 |   .0066247   .0002746    24.12   0.000     .0060728    .0071766
_SstaXttre_22 |   .0056373   .0002829    19.93   0.000     .0050689    .0062057
_SstaXttre_23 |  -.0019124   .0003908    -4.89   0.000    -.0026977   -.0011271
_SstaXttre_24 |   .0001296   .0002569     0.50   0.616    -.0003866    .0006458
_SstaXttre_25 |   .0009447   .0002608     3.62   0.001     .0004206    .0014687
_SstaXttre_26 |    .003981   .0001344    29.61   0.000     .0037108    .0042511
_SstaXttre_27 |   .0030235   .0003284     9.21   0.000     .0023636    .0036834
_SstaXttre_28 |   .0081859   .0007082    11.56   0.000     .0067626    .0096091
_SstaXttre_29 |   .0168626   .0001894    89.01   0.000     .0164819    .0172433
_SstaXttre_30 |   .0014594   .0003789     3.85   0.000     .0006979    .0022209
_SstaXttre_31 |   .0100608   .0002867    35.10   0.000     .0094847    .0106369
_SstaXttre_32 |   .0151368   .0001495   101.28   0.000     .0148364    .0154371
_SstaXttre_33 |   .0056051   .0003487    16.08   0.000     .0049044    .0063058
_SstaXttre_34 |   .0023523    .000061    38.59   0.000     .0022298    .0024748
_SstaXttre_35 |   .0073199   .0004212    17.38   0.000     .0064735    .0081663
_SstaXttre_36 |   .0025931   .0000659    39.32   0.000     .0024606    .0027257
_SstaXttre_37 |   .0160153   .0001601   100.02   0.000     .0156935    .0163371
_SstaXttre_38 |   .0075686   .0003615    20.94   0.000     .0068422     .008295
_SstaXttre_39 |   .0044071   .0005917     7.45   0.000     .0032181    .0055961
_SstaXttre_40 |   .0057892   .0002277    25.42   0.000     .0053316    .0062469
_SstaXttre_41 |   .0070451   .0002983    23.61   0.000     .0064456    .0076447
_SstaXttre_42 |  -.0023109   .0002355    -9.81   0.000    -.0027841   -.0018377
_SstaXttre_44 |   -.001308   .0002678    -4.88   0.000    -.0018463   -.0007698
_SstaXttre_45 |   .0194722   .0017083    11.40   0.000     .0160391    .0229052
_SstaXttre_46 |   .0103091   .0003815    27.02   0.000     .0095424    .0110759
_SstaXttre_47 |   .0082399   .0008076    10.20   0.000      .006617    .0098628
_SstaXttre_48 |   .0071539   .0003087    23.17   0.000     .0065335    .0077742
_SstaXttre_49 |   .0075188   .0008652     8.69   0.000     .0057802    .0092575
_SstaXttre_50 |  -.0005678   .0004002    -1.42   0.162     -.001372    .0002364
_SstaXttre_51 |   .0096933   .0001393    69.60   0.000     .0094134    .0099731
_SstaXttre_53 |   .0043115   .0002749    15.69   0.000     .0037591    .0048638
_SstaXttre_54 |  -.0058536   .0003772   -15.52   0.000    -.0066116   -.0050956
_SstaXttre_55 |  -.0020325   .0002935    -6.93   0.000    -.0026223   -.0014427
_SstaXttre_56 |   .0040135    .000313    12.82   0.000     .0033844    .0046426
 _SstaXttrea1 |  -.0000195   .0000811    -0.24   0.811    -.0001825    .0001434
 _SstaXttrea2 |  -.0008275   .0000409   -20.22   0.000    -.0009098   -.0007453
 _SstaXttrea4 |   .0001657   .0000888     1.87   0.068    -.0000128    .0003441
 _SstaXttrea5 |  -.0007222   .0000303   -23.85   0.000     -.000783   -.0006613
 _SstaXttrea6 |  -.0005309   .0000256   -20.74   0.000    -.0005824   -.0004795
 _SstaXttrea8 |  -.0007444   .0000133   -55.86   0.000    -.0007712   -.0007176
 _SstaXttrea9 |  -.0006532   .0000134   -48.73   0.000    -.0006802   -.0006263
_SstaXttrea10 |  -.0009314   .0000102   -91.35   0.000    -.0009519   -.0009109
_SstaXttrea12 |  -.0005519    .000069    -8.00   0.000    -.0006905   -.0004133
_SstaXttrea13 |  -.0000745   .0000783    -0.95   0.346     -.000232    .0000829
_SstaXttrea15 |  -.0008446    .000024   -35.18   0.000    -.0008929   -.0007964
_SstaXttrea16 |  -.0004601   .0000947    -4.86   0.000    -.0006504   -.0002699
_SstaXttrea18 |  -.0001729   .0000197    -8.76   0.000    -.0002126   -.0001332
_SstaXttrea19 |    .000061   .0001015     0.60   0.550    -.0001429     .000265
_SstaXttrea20 |   .0000306   .0000168     1.82   0.075    -3.20e-06    .0000643
_SstaXttrea21 |  -.0005187   .0000213   -24.30   0.000    -.0005616   -.0004758
_SstaXttrea22 |   -.000483   .0000187   -25.90   0.000    -.0005205   -.0004456
_SstaXttrea23 |   -.000234   .0000301    -7.77   0.000    -.0002946   -.0001735
_SstaXttrea24 |  -.0002829   .0000186   -15.21   0.000    -.0003203   -.0002455
_SstaXttrea25 |  -.0004754   .0000199   -23.90   0.000    -.0005154   -.0004354
_SstaXttrea26 |  -.0002745   .0000117   -23.56   0.000    -.0002979   -.0002511
_SstaXttrea27 |  -.0000978    .000025    -3.90   0.000    -.0001482   -.0000475
_SstaXttrea28 |  -.0005386   .0000661    -8.15   0.000    -.0006714   -.0004057
_SstaXttrea29 |  -.0012274   .0000155   -78.94   0.000    -.0012587   -.0011962
_SstaXttrea30 |  -8.34e-06   .0000294    -0.28   0.778    -.0000674    .0000507
_SstaXttrea31 |  -.0005713   .0000219   -26.07   0.000    -.0006153   -.0005272
_SstaXttrea32 |  -.0010547   .0000114   -92.46   0.000    -.0010777   -.0010318
_SstaXttrea33 |  -.0007875   .0000272   -28.96   0.000    -.0008421   -.0007328
_SstaXttrea34 |  -.0004829   4.21e-06  -114.73   0.000    -.0004914   -.0004745
_SstaXttrea35 |  -.0005766   .0000381   -15.14   0.000    -.0006531      -.0005
_SstaXttrea36 |  -.0003542   4.49e-06   -78.84   0.000    -.0003632   -.0003451
_SstaXttrea37 |  -.0013182   .0000125  -105.80   0.000    -.0013433   -.0012932
_SstaXttrea38 |  -.0004098   .0000285   -14.38   0.000    -.0004671   -.0003526
_SstaXttrea39 |  -.0003927   .0000489    -8.02   0.000    -.0004911   -.0002944
_SstaXttrea40 |  -.0005798   .0000173   -33.56   0.000    -.0006145   -.0005451
_SstaXttrea41 |   -.000561    .000023   -24.41   0.000    -.0006072   -.0005148
_SstaXttrea42 |  -.0000611   .0000188    -3.25   0.002    -.0000989   -.0000233
_SstaXttrea44 |   -.000128   .0000198    -6.46   0.000    -.0001678   -.0000882
_SstaXttrea45 |  -.0012414    .000099   -12.54   0.000    -.0014403   -.0010425
_SstaXttrea46 |  -.0006039   .0000289   -20.89   0.000     -.000662   -.0005458
_SstaXttrea47 |  -.0005747   .0000776    -7.41   0.000    -.0007305   -.0004188
_SstaXttrea48 |  -.0004934   .0000278   -17.73   0.000    -.0005493   -.0004375
_SstaXttrea49 |  -.0005856   .0000702    -8.34   0.000    -.0007267   -.0004445
_SstaXttrea50 |   .0000405   .0000314     1.29   0.203    -.0000226    .0001036
_SstaXttrea51 |  -.0009935   .0000107   -93.23   0.000    -.0010149    -.000972
_SstaXttrea53 |  -.0003531   .0000217   -16.29   0.000    -.0003966   -.0003095
_SstaXttrea54 |   .0002024   .0000294     6.89   0.000     .0001434    .0002615
_SstaXttrea55 |   .0003162   .0000221    14.30   0.000     .0002718    .0003606
_SstaXttrea56 |  -.0004955   .0000241   -20.53   0.000     -.000544    -.000447
 _SstaXttreb1 |   1.64e-06   1.78e-06     0.92   0.362    -1.94e-06    5.22e-06
 _SstaXttreb2 |   .0000198   5.58e-07    35.40   0.000     .0000186    .0000209
 _SstaXttreb4 |  -1.08e-06   2.05e-06    -0.53   0.601    -5.19e-06    3.04e-06
 _SstaXttreb5 |   .0000132   3.53e-07    37.42   0.000     .0000125    .0000139
 _SstaXttreb6 |   .0000134   5.40e-07    24.81   0.000     .0000123    .0000145
 _SstaXttreb8 |   .0000176   2.67e-07    65.74   0.000      .000017    .0000181
 _SstaXttreb9 |   .0000167   2.75e-07    60.65   0.000     .0000161    .0000172
_SstaXttreb10 |   .0000228   2.22e-07   102.64   0.000     .0000223    .0000232
_SstaXttreb12 |   .0000145   1.25e-06    11.57   0.000      .000012     .000017
_SstaXttreb13 |   1.11e-06   1.59e-06     0.70   0.487    -2.08e-06    4.30e-06
_SstaXttreb15 |   .0000196   4.93e-07    39.67   0.000     .0000186    .0000206
_SstaXttreb16 |   .0000102   1.84e-06     5.53   0.000     6.47e-06    .0000139
_SstaXttreb18 |   2.71e-06   4.18e-07     6.48   0.000     1.87e-06    3.55e-06
_SstaXttreb19 |   4.51e-07   2.21e-06     0.20   0.839    -4.00e-06    4.90e-06
_SstaXttreb20 |   2.99e-06   3.43e-07     8.69   0.000     2.30e-06    3.68e-06
_SstaXttreb21 |   .0000122   4.47e-07    27.24   0.000     .0000113    .0000131
_SstaXttreb22 |   .0000148   5.22e-07    28.31   0.000     .0000137    .0000158
_SstaXttreb23 |   9.00e-06   6.20e-07    14.51   0.000     7.75e-06    .0000102
_SstaXttreb24 |   9.36e-06   3.73e-07    25.07   0.000     8.61e-06    .0000101
_SstaXttreb25 |   .0000128   3.96e-07    32.36   0.000      .000012    .0000136
_SstaXttreb26 |   6.11e-06   2.50e-07    24.44   0.000     5.61e-06    6.62e-06
_SstaXttreb27 |   2.11e-06   5.05e-07     4.17   0.000     1.09e-06    3.12e-06
_SstaXttreb28 |   .0000124   1.25e-06     9.98   0.000     9.93e-06    .0000149
_SstaXttreb29 |   .0000253   3.34e-07    75.82   0.000     .0000247     .000026
_SstaXttreb30 |   9.25e-07   5.98e-07     1.55   0.128    -2.76e-07    2.13e-06
_SstaXttreb31 |   .0000129   4.43e-07    29.07   0.000      .000012    .0000138
_SstaXttreb32 |   .0000232   2.53e-07    91.73   0.000     .0000227    .0000238
_SstaXttreb33 |   .0000189   5.55e-07    34.02   0.000     .0000178      .00002
_SstaXttreb34 |   .0000127   9.12e-08   138.78   0.000     .0000125    .0000128
_SstaXttreb35 |   .0000161   8.18e-07    19.68   0.000     .0000145    .0000177
_SstaXttreb36 |   9.31e-06   8.91e-08   104.50   0.000     9.13e-06    9.49e-06
_SstaXttreb37 |   .0000264   2.60e-07   101.51   0.000     .0000259    .0000269
_SstaXttreb38 |    .000011   5.81e-07    18.94   0.000     9.84e-06    .0000122
_SstaXttreb39 |   9.76e-06   7.51e-07    13.00   0.000     8.25e-06    .0000113
_SstaXttreb40 |   .0000159   3.57e-07    44.67   0.000     .0000152    .0000167
_SstaXttreb41 |   .0000132   4.68e-07    28.18   0.000     .0000123    .0000141
_SstaXttreb42 |   4.95e-06   4.03e-07    12.31   0.000     4.15e-06    5.76e-06
_SstaXttreb44 |   3.69e-06   4.00e-07     9.23   0.000     2.89e-06    4.49e-06
_SstaXttreb45 |   .0000238   1.75e-06    13.62   0.000     .0000203    .0000273
_SstaXttreb46 |   .0000144   5.88e-07    24.47   0.000     .0000132    .0000156
_SstaXttreb47 |   9.90e-06   1.49e-06     6.64   0.000     6.90e-06    .0000129
_SstaXttreb48 |   .0000116   5.98e-07    19.33   0.000     .0000104    .0000128
_SstaXttreb49 |   .0000145   1.17e-06    12.36   0.000     .0000121    .0000168
_SstaXttreb50 |   3.85e-07   6.49e-07     0.59   0.556    -9.20e-07    1.69e-06
_SstaXttreb51 |   .0000232   2.19e-07   106.10   0.000     .0000228    .0000237
_SstaXttreb53 |   9.02e-06   4.41e-07    20.47   0.000     8.14e-06    9.91e-06
_SstaXttreb54 |   3.92e-07   6.20e-07     0.63   0.530    -8.54e-07    1.64e-06
_SstaXttreb55 |  -6.94e-06   4.49e-07   -15.44   0.000    -7.84e-06   -6.04e-06
_SstaXttreb56 |   .0000178   4.96e-07    35.80   0.000     .0000168    .0000188
        _cons |  -.0454282   .0154788    -2.93   0.005     -.076534   -.0143224
-------------------------------------------------------------------------------

. estimates store empdhi4 ;

. *** Spec 5: Add time varying state controls to Spec 4 - this drops 2007-2010 ;
. drop _S* ;

. xi, prefix(_S) i.statefip*black i.statefip*hisp i.statefip*female i.statefip*young i.statefip*lowskill 
>   i.statefip*ttrend i.statefip*ttrend2 i.statefip*ttrend3 ;
i.statefip        _Sstatefip_1-56     (naturally coded; _Sstatefip_17 omitted)
i.state~p*black   _SstaXblac_#        (coded as above)
i.statefip*hisp   _SstaXhisp_#        (coded as above)
i.stat~p*female   _SstaXfema_#        (coded as above)
i.state~p*young   _SstaXyoun_#        (coded as above)
i.stat~p*lows~l   _SstaXlows_#        (coded as above)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)
i.stat~p*ttre~2   _SstaXttrea#        (coded as above)
i.stat~p*ttre~3   _SstaXttreb#        (coded as above)

. global controls blackpro hisppro femalepro youngpro lowskillpro pro
>   black hisp female lowskill age age2
>   minwage unemploymentrate incarcr
>   tt* _S* ;

.   reg empdhi $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 3,252,460,320)

Linear regression                               Number of obs     =  2,075,295
                                                F(25, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0649
                                                Root MSE          =     .43336

                                  (Std. Err. adjusted for 50 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
          empdhi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
        blackpro |   .0156263   .0105611     1.48   0.145     -.005597    .0368496
         hisppro |   -.007876   .0102789    -0.77   0.447    -.0285323    .0127803
       femalepro |  -.0159065   .0083529    -1.90   0.063    -.0326923    .0008793
        youngpro |  -.0098946   .0067652    -1.46   0.150    -.0234899    .0037006
     lowskillpro |   .0081579   .0064098     1.27   0.209     -.004723    .0210388
             pro |  -.0036539    .009026    -0.40   0.687    -.0217924    .0144846
           black |   .0456791    .008863     5.15   0.000     .0278683    .0634899
            hisp |    .119652   .0049689    24.08   0.000     .1096666    .1296373
          female |  -.1834903   .0050124   -36.61   0.000     -.193563   -.1734175
        lowskill |   .1373656   .0045167    30.41   0.000     .1282889    .1464423
             age |   .0207566   .0007765    26.73   0.000     .0191962    .0223171
            age2 |  -.0002302   9.35e-06   -24.63   0.000     -.000249   -.0002114
         minwage |   .0090857   .0016055     5.66   0.000     .0058594    .0123121
unemploymentrate |  -.0016291   .0005935    -2.74   0.008    -.0028219   -.0004364
         incarcr |   1.271597   .9279761     1.37   0.177    -.5932404    3.136435
          ttrend |  -.0055628    .000859    -6.48   0.000    -.0072889   -.0038366
         ttrend2 |   .0002441   .0000627     3.89   0.000      .000118    .0003702
         ttrend3 |  -8.79e-06   1.42e-06    -6.19   0.000    -.0000116   -5.93e-06
        ttrendbl |   .0037567   .0026682     1.41   0.165    -.0016053    .0091186
       ttrend2bl |  -.0002637    .000189    -1.40   0.169    -.0006435    .0001161
       ttrend3bl |   4.44e-06   3.71e-06     1.20   0.238    -3.02e-06    .0000119
        ttrendhi |  -.0037901   .0018456    -2.05   0.045    -.0074989   -.0000813
       ttrend2hi |    .000086   .0001653     0.52   0.605    -.0002461    .0004182
       ttrend3hi |  -9.52e-07   3.54e-06    -0.27   0.789    -8.07e-06    6.17e-06
        ttrendfe |   .0013036   .0010331     1.26   0.213    -.0007725    .0033798
       ttrend2fe |  -6.14e-06   .0000795    -0.08   0.939    -.0001659    .0001536
       ttrend3fe |   3.54e-07   1.81e-06     0.19   0.846    -3.29e-06    4.00e-06
        ttrendyo |   -.006862   .0011588    -5.92   0.000    -.0091908   -.0045333
       ttrend2yo |   .0004048   .0000921     4.39   0.000     .0002196      .00059
       ttrend3yo |  -6.94e-06   2.06e-06    -3.37   0.001    -.0000111   -2.80e-06
        ttrendlo |  -.0073579   .0008701    -8.46   0.000    -.0091065   -.0056093
       ttrend2lo |   .0002927   .0000705     4.15   0.000      .000151    .0004343
       ttrend3lo |  -5.13e-06   1.62e-06    -3.17   0.003    -8.38e-06   -1.88e-06
    _Sstatefip_1 |    .008141   .0034442     2.36   0.022     .0012196    .0150625
    _Sstatefip_2 |  -.0759039   .0036205   -20.97   0.000    -.0831795   -.0686282
    _Sstatefip_4 |  -.0614692   .0038475   -15.98   0.000     -.069201   -.0537373
    _Sstatefip_5 |  -.1186341   .0020951   -56.63   0.000    -.1228443   -.1144239
    _Sstatefip_6 |  -.0558371   .0023262   -24.00   0.000    -.0605119   -.0511623
    _Sstatefip_8 |  -.0565726   .0024489   -23.10   0.000     -.061494   -.0516513
    _Sstatefip_9 |   .0141145   .0028834     4.90   0.000     .0083202    .0199089
   _Sstatefip_10 |   .0108957   .0037459     2.91   0.005     .0033679    .0184234
   _Sstatefip_12 |  -.1221675   .0037976   -32.17   0.000    -.1297991   -.1145358
   _Sstatefip_13 |  -.0602331   .0036795   -16.37   0.000    -.0676274   -.0528388
   _Sstatefip_15 |  -.1353441   .0027297   -49.58   0.000    -.1408297   -.1298585
   _Sstatefip_16 |  -.1147156   .0031565   -36.34   0.000    -.1210588   -.1083724
   _Sstatefip_18 |   .0263488   .0015654    16.83   0.000     .0232031    .0294946
   _Sstatefip_19 |  -.0718515   .0033102   -21.71   0.000    -.0785035   -.0651995
   _Sstatefip_20 |  -.0149829   .0029152    -5.14   0.000    -.0208412   -.0091246
   _Sstatefip_21 |  -.0161128   .0012579   -12.81   0.000    -.0186406    -.013585
   _Sstatefip_22 |  -.0537263   .0031773   -16.91   0.000    -.0601112   -.0473413
   _Sstatefip_23 |  -.0010811   .0024226    -0.45   0.657    -.0059495    .0037874
   _Sstatefip_24 |  -.0243642   .0026822    -9.08   0.000    -.0297544   -.0189741
   _Sstatefip_25 |   .0050795   .0034309     1.48   0.145    -.0018151    .0119741
   _Sstatefip_26 |   .0688298   .0024132    28.52   0.000     .0639804    .0736793
   _Sstatefip_27 |   -.046615    .002773   -16.81   0.000    -.0521875   -.0410425
   _Sstatefip_28 |  -.0527257   .0035989   -14.65   0.000    -.0599579   -.0454935
   _Sstatefip_29 |   -.071589   .0015995   -44.76   0.000    -.0748033   -.0683747
   _Sstatefip_30 |  -.1222379   .0019927   -61.34   0.000    -.1262424   -.1182335
   _Sstatefip_31 |  -.1454417   .0029966   -48.54   0.000    -.1514636   -.1394198
   _Sstatefip_32 |  -.1966463   .0028315   -69.45   0.000    -.2023363   -.1909563
   _Sstatefip_33 |   .0358896   .0040217     8.92   0.000     .0278078    .0439714
   _Sstatefip_34 |   .0012421   .0023708     0.52   0.603    -.0035222    .0060064
   _Sstatefip_35 |  -.1252226   .0018123   -69.09   0.000    -.1288646   -.1215806
   _Sstatefip_36 |   -.040243   .0016844   -23.89   0.000     -.043628   -.0368581
   _Sstatefip_37 |  -.0539879   .0033397   -16.17   0.000    -.0606992   -.0472766
   _Sstatefip_38 |   -.173214   .0030608   -56.59   0.000    -.1793649   -.1670632
   _Sstatefip_39 |   .0394482   .0022238    17.74   0.000     .0349792    .0439172
   _Sstatefip_40 |  -.0124651   .0029869    -4.17   0.000    -.0184676   -.0064627
   _Sstatefip_41 |  -.0352717   .0013304   -26.51   0.000    -.0379452   -.0325982
   _Sstatefip_42 |   .0268081   .0013567    19.76   0.000     .0240816    .0295346
   _Sstatefip_44 |   .0042338   .0025664     1.65   0.105    -.0009235    .0093911
   _Sstatefip_45 |  -.0732594   .0055802   -13.13   0.000    -.0844732   -.0620457
   _Sstatefip_46 |  -.1824509   .0030964   -58.92   0.000    -.1886733   -.1762285
   _Sstatefip_47 |  -.0164885    .002964    -5.56   0.000    -.0224449   -.0105321
   _Sstatefip_48 |  -.0535668   .0033725   -15.88   0.000    -.0603441   -.0467894
   _Sstatefip_49 |  -.0445337   .0030649   -14.53   0.000    -.0506929   -.0383744
   _Sstatefip_50 |  -.0657592   .0027419   -23.98   0.000    -.0712693   -.0602491
   _Sstatefip_51 |  -.0296348   .0028993   -10.22   0.000    -.0354611   -.0238084
   _Sstatefip_53 |  -.0265757   .0012651   -21.01   0.000    -.0291181   -.0240333
   _Sstatefip_54 |   .0876917   .0019035    46.07   0.000     .0838665     .091517
   _Sstatefip_55 |   .0155087   .0013552    11.44   0.000     .0127854     .018232
   _Sstatefip_56 |  -.0118107   .0030721    -3.84   0.000    -.0179843   -.0056372
    _SstaXblac_1 |  -.0162523   .0057286    -2.84   0.007    -.0277644   -.0047401
    _SstaXblac_2 |  -.0865984   .0032523   -26.63   0.000    -.0931342   -.0800627
    _SstaXblac_4 |  -.0491728   .0071536    -6.87   0.000    -.0635485    -.034797
    _SstaXblac_5 |   .0192027   .0035203     5.45   0.000     .0121283     .026277
    _SstaXblac_6 |  -.0021984   .0001532   -14.35   0.000    -.0025063   -.0018906
    _SstaXblac_8 |   .0142827   .0001689    84.58   0.000     .0139433     .014622
    _SstaXblac_9 |  -.0105245   .0000955  -110.18   0.000    -.0107165   -.0103325
   _SstaXblac_10 |   .0104877   .0002217    47.32   0.000     .0100422    .0109331
   _SstaXblac_12 |  -.0198672   .0044118    -4.50   0.000     -.028733   -.0110013
   _SstaXblac_13 |   .0013243   .0053843     0.25   0.807    -.0094958    .0121445
   _SstaXblac_15 |  -.1458129   .0006363  -229.16   0.000    -.1470916   -.1445343
   _SstaXblac_16 |   .0467556   .0067861     6.89   0.000     .0331184    .0603928
   _SstaXblac_18 |  -.0296883   .0001641  -180.93   0.000    -.0300181   -.0293586
   _SstaXblac_19 |  -.0385498   .0065128    -5.92   0.000    -.0516377   -.0254618
   _SstaXblac_20 |   .0046051   .0002316    19.89   0.000     .0041398    .0050704
   _SstaXblac_21 |  -.0267229   .0003352   -79.72   0.000    -.0273965   -.0260493
   _SstaXblac_22 |  -.0327536   .0029445   -11.12   0.000    -.0386709   -.0268363
   _SstaXblac_23 |   .0768265   .0005244   146.50   0.000     .0757726    .0778804
   _SstaXblac_24 |   .0313769   .0001128   278.26   0.000     .0311502    .0316035
   _SstaXblac_25 |  -.0488573   .0004099  -119.19   0.000     -.049681   -.0480335
   _SstaXblac_26 |   .0056045   .0001248    44.91   0.000     .0053538    .0058553
   _SstaXblac_27 |  -.0166153     .00074   -22.45   0.000    -.0181024   -.0151281
   _SstaXblac_28 |   .0421203   .0045304     9.30   0.000     .0330162    .0512244
   _SstaXblac_29 |  -.0432382   .0001318  -328.08   0.000    -.0435031   -.0429734
   _SstaXblac_30 |   -.148769   .0008354  -178.08   0.000    -.1504478   -.1470902
   _SstaXblac_31 |  -.0286087    .000235  -121.75   0.000    -.0290809   -.0281365
   _SstaXblac_32 |  -.0619449    .000454  -136.44   0.000    -.0628573   -.0610326
   _SstaXblac_33 |  -.0634679   .0010468   -60.63   0.000    -.0655716   -.0613643
   _SstaXblac_34 |   .0119158   .0000646   184.40   0.000     .0117859    .0120457
   _SstaXblac_35 |  -.0287099   .0002476  -115.94   0.000    -.0292075   -.0282123
   _SstaXblac_36 |  -.0558695   .0000649  -861.14   0.000    -.0559999   -.0557392
   _SstaXblac_37 |  -.0009803   .0001426    -6.87   0.000     -.001267   -.0006937
   _SstaXblac_38 |  -.1104478   .0005958  -185.38   0.000    -.1116451   -.1092505
   _SstaXblac_39 |  -.0400656   .0038645   -10.37   0.000    -.0478316   -.0322997
   _SstaXblac_40 |  -.0417342   .0001231  -338.91   0.000    -.0419817   -.0414867
   _SstaXblac_41 |  -.0073534   .0004052   -18.15   0.000    -.0081677   -.0065392
   _SstaXblac_42 |  -.0607393   .0001665  -364.85   0.000    -.0610738   -.0604047
   _SstaXblac_44 |  -.0167382   .0006312   -26.52   0.000    -.0180067   -.0154698
   _SstaXblac_45 |   .0331876   .0091692     3.62   0.001     .0147614    .0516138
   _SstaXblac_46 |    .228825   .0011456   199.74   0.000     .2265228    .2311272
   _SstaXblac_47 |  -.0333371   .0046735    -7.13   0.000    -.0427288   -.0239453
   _SstaXblac_48 |  -.0128958   .0001502   -85.88   0.000    -.0131975    -.012594
   _SstaXblac_49 |    -.05365   .0059501    -9.02   0.000    -.0656073   -.0416928
   _SstaXblac_50 |   .0339832   .0010966    30.99   0.000     .0317795    .0361869
   _SstaXblac_51 |   .0150315   .0001226   122.60   0.000     .0147852    .0152779
   _SstaXblac_53 |  -.0488482   .0003308  -147.68   0.000    -.0495129   -.0481835
   _SstaXblac_54 |  -.0386693   .0002748  -140.72   0.000    -.0392216   -.0381171
   _SstaXblac_55 |  -.0709707   .0002201  -322.48   0.000     -.071413   -.0705284
   _SstaXblac_56 |  -.0962107   .0004909  -195.98   0.000    -.0971972   -.0952241
    _SstaXhisp_1 |  -.0333724   .0085187    -3.92   0.000    -.0504914   -.0162534
    _SstaXhisp_2 |   -.130108   .0048585   -26.78   0.000    -.1398714   -.1203445
    _SstaXhisp_4 |  -.0695634   .0073376    -9.48   0.000    -.0843089    -.054818
    _SstaXhisp_5 |   .0487275   .0060959     7.99   0.000     .0364773    .0609777
    _SstaXhisp_6 |  -.0426388   .0002857  -149.22   0.000     -.043213   -.0420646
    _SstaXhisp_8 |  -.0343813   .0004755   -72.31   0.000    -.0353368   -.0334258
    _SstaXhisp_9 |  -.0334215   .0004314   -77.48   0.000    -.0342884   -.0325547
   _SstaXhisp_10 |  -.0490613   .0011514   -42.61   0.000    -.0513751   -.0467475
   _SstaXhisp_12 |  -.0656883   .0053144   -12.36   0.000     -.076368   -.0550085
   _SstaXhisp_13 |  -.0572818   .0076546    -7.48   0.000    -.0726643   -.0418993
   _SstaXhisp_15 |   -.086707   .0008864   -97.82   0.000    -.0884883   -.0849257
   _SstaXhisp_16 |  -.0239228   .0059278    -4.04   0.000    -.0358352   -.0120104
   _SstaXhisp_18 |  -.0254401   .0008825   -28.83   0.000    -.0272135   -.0236667
   _SstaXhisp_19 |   .1238831   .0081256    15.25   0.000     .1075541    .1402121
   _SstaXhisp_20 |  -.0614198   .0007071   -86.86   0.000    -.0628408   -.0599987
   _SstaXhisp_21 |  -.1508413   .0017844   -84.54   0.000    -.1544271   -.1472555
   _SstaXhisp_22 |  -.1157269   .0039858   -29.03   0.000    -.1237368   -.1077171
   _SstaXhisp_23 |  -.1247506   .0007859  -158.74   0.000    -.1263299   -.1231714
   _SstaXhisp_24 |  -.1633905   .0012844  -127.22   0.000    -.1659715   -.1608095
   _SstaXhisp_25 |  -.0416931   .0009196   -45.34   0.000     -.043541   -.0398451
   _SstaXhisp_26 |  -.0318685   .0004865   -65.50   0.000    -.0328462   -.0308908
   _SstaXhisp_27 |  -.0532989   .0016596   -32.12   0.000     -.056634   -.0499638
   _SstaXhisp_28 |  -.0048914   .0076473    -0.64   0.525    -.0202592    .0104765
   _SstaXhisp_29 |  -.0516079   .0007506   -68.75   0.000    -.0531163   -.0500994
   _SstaXhisp_30 |  -.1252941   .0007018  -178.53   0.000    -.1267044   -.1238838
   _SstaXhisp_31 |   .0877117   .0011353    77.26   0.000     .0854301    .0899933
   _SstaXhisp_32 |  -.1246678   .0011926  -104.53   0.000    -.1270645   -.1222711
   _SstaXhisp_33 |  -.0062862   .0011216    -5.60   0.000    -.0085402   -.0040323
   _SstaXhisp_34 |   .0015128   .0002171     6.97   0.000     .0010766    .0019489
   _SstaXhisp_35 |  -.0534551   .0006135   -87.13   0.000    -.0546879   -.0522222
   _SstaXhisp_36 |  -.0808367   .0003401  -237.68   0.000    -.0815202   -.0801532
   _SstaXhisp_37 |  -.1155657   .0022726   -50.85   0.000    -.1201327   -.1109987
   _SstaXhisp_38 |  -.0179088   .0007436   -24.08   0.000    -.0194031   -.0164145
   _SstaXhisp_39 |  -.0645377   .0058581   -11.02   0.000      -.07631   -.0527654
   _SstaXhisp_40 |  -.1292785   .0004626  -279.49   0.000     -.130208   -.1283489
   _SstaXhisp_41 |  -.0994851   .0011905   -83.57   0.000    -.1018775   -.0970927
   _SstaXhisp_42 |  -.0298745   .0009135   -32.70   0.000    -.0317103   -.0280386
   _SstaXhisp_44 |   .0942791   .0008696   108.42   0.000     .0925316    .0960266
   _SstaXhisp_45 |  -.1404507   .0091522   -15.35   0.000    -.1588427   -.1220586
   _SstaXhisp_46 |    .039108   .0015318    25.53   0.000     .0360297    .0421864
   _SstaXhisp_47 |  -.1058365   .0081263   -13.02   0.000     -.122167   -.0895061
   _SstaXhisp_48 |  -.0925301   .0002722  -339.91   0.000    -.0930771   -.0919831
   _SstaXhisp_49 |  -.0298314   .0059077    -5.05   0.000    -.0417034   -.0179594
   _SstaXhisp_50 |  -.1262823    .000705  -179.11   0.000    -.1276992   -.1248655
   _SstaXhisp_51 |  -.1895555   .0012821  -147.85   0.000     -.192132    -.186979
   _SstaXhisp_53 |  -.1520731   .0013538  -112.33   0.000    -.1547937   -.1493525
   _SstaXhisp_54 |  -.1258102   .0009346  -134.62   0.000    -.1276883   -.1239321
   _SstaXhisp_55 |  -.0167478    .001677    -9.99   0.000    -.0201178   -.0133778
   _SstaXhisp_56 |  -.0877409   .0006008  -146.04   0.000    -.0889482   -.0865335
    _SstaXfema_1 |  -.0042459   .0044089    -0.96   0.340    -.0131059     .004614
    _SstaXfema_2 |    .056584   .0027673    20.45   0.000      .051023     .062145
    _SstaXfema_4 |   .0712305   .0052982    13.44   0.000     .0605832    .0818777
    _SstaXfema_5 |   .0213174   .0026922     7.92   0.000     .0159072    .0267276
    _SstaXfema_6 |   .0621374   .0001239   501.34   0.000     .0618884    .0623865
    _SstaXfema_8 |   .0434283   .0002453   177.03   0.000     .0429353    .0439212
    _SstaXfema_9 |   .0062501   .0001239    50.46   0.000     .0060012     .006499
   _SstaXfema_10 |   .0117077   .0001387    84.44   0.000      .011429    .0119863
   _SstaXfema_12 |   .0733037   .0035992    20.37   0.000     .0660709    .0805365
   _SstaXfema_13 |   .0382342    .004213     9.08   0.000     .0297678    .0467005
   _SstaXfema_15 |   .0873584   .0000743  1175.83   0.000     .0872091    .0875077
   _SstaXfema_16 |   .0372094   .0039651     9.38   0.000     .0292413    .0451775
   _SstaXfema_18 |  -.0469238   .0000524  -894.77   0.000    -.0470292   -.0468184
   _SstaXfema_19 |   .0071274   .0043447     1.64   0.107    -.0016037    .0158585
   _SstaXfema_20 |  -.0123791   .0000501  -246.86   0.000    -.0124799   -.0122783
   _SstaXfema_21 |   -.021824    .000062  -351.78   0.000    -.0219487   -.0216993
   _SstaXfema_22 |  -.0326716   .0022144   -14.75   0.000    -.0371216   -.0282215
   _SstaXfema_23 |  -.0120004    .000059  -203.45   0.000    -.0121189   -.0118819
   _SstaXfema_24 |   .0606537   .0000693   874.91   0.000     .0605144    .0607931
   _SstaXfema_25 |   .0183889   .0000857   214.70   0.000     .0182168     .018561
   _SstaXfema_26 |  -.0698142   .0000551 -1267.71   0.000    -.0699248   -.0697035
   _SstaXfema_27 |   .0088005   .0000746   117.95   0.000     .0086506    .0089504
   _SstaXfema_28 |  -.0065066   .0035014    -1.86   0.069     -.013543    .0005298
   _SstaXfema_29 |   .0155479   .0000478   324.95   0.000     .0154517     .015644
   _SstaXfema_30 |    .027404   .0000576   475.38   0.000     .0272882    .0275199
   _SstaXfema_31 |   .0249123   .0000426   585.19   0.000     .0248268    .0249979
   _SstaXfema_32 |   .0849266   .0005063   167.76   0.000     .0839093     .085944
   _SstaXfema_33 |   .0137886   .0000925   149.00   0.000     .0136026    .0139745
   _SstaXfema_34 |   .0340457   .0000464   733.00   0.000     .0339523     .034139
   _SstaXfema_35 |   .0400943   .0001721   232.96   0.000     .0397485    .0404402
   _SstaXfema_36 |   .0327466   .0000666   491.65   0.000     .0326128    .0328805
   _SstaXfema_37 |   .0523792   .0001239   422.82   0.000     .0521302    .0526281
   _SstaXfema_38 |   .0296783   .0000653   454.65   0.000     .0295471    .0298094
   _SstaXfema_39 |  -.0539739   .0028738   -18.78   0.000    -.0597489   -.0481988
   _SstaXfema_40 |  -.0023487   .0001073   -21.89   0.000    -.0025643   -.0021332
   _SstaXfema_41 |  -.0036755   .0001246   -29.50   0.000    -.0039258   -.0034251
   _SstaXfema_42 |  -.0334942   .0000692  -484.00   0.000    -.0336333   -.0333552
   _SstaXfema_44 |   .0162277   .0000751   215.96   0.000     .0160767    .0163787
   _SstaXfema_45 |   .0250721   .0072651     3.45   0.001     .0104723    .0396719
   _SstaXfema_46 |   .0453008   .0000552   820.02   0.000     .0451898    .0454118
   _SstaXfema_47 |   .0327026   .0036666     8.92   0.000     .0253342    .0400709
   _SstaXfema_48 |   .0202123   .0001695   119.28   0.000     .0198717    .0205528
   _SstaXfema_49 |   .0333496   .0034677     9.62   0.000     .0263811    .0403181
   _SstaXfema_50 |   .0252802   .0001174   215.31   0.000     .0250443    .0255162
   _SstaXfema_51 |   .0359248   .0001276   281.58   0.000     .0356684    .0361811
   _SstaXfema_53 |   .0168351    .000188    89.54   0.000     .0164572    .0172129
   _SstaXfema_54 |  -.0937004   .0000781 -1200.05   0.000    -.0938573   -.0935435
   _SstaXfema_55 |   -.045629   .0000575  -792.98   0.000    -.0457447   -.0455134
   _SstaXfema_56 |   -.057266    .000097  -590.22   0.000     -.057461   -.0570711
    _SstaXyoun_1 |   .0193181   .0042772     4.52   0.000     .0107227    .0279135
    _SstaXyoun_2 |   .0202334   .0036748     5.51   0.000     .0128486    .0276182
    _SstaXyoun_4 |   .0202566   .0048595     4.17   0.000      .010491    .0300223
    _SstaXyoun_5 |   .0416871   .0035602    11.71   0.000     .0345327    .0488415
    _SstaXyoun_6 |   .0198444   .0033607     5.90   0.000     .0130909     .026598
    _SstaXyoun_8 |   .0025914   .0033232     0.78   0.439    -.0040867    .0092696
    _SstaXyoun_9 |   .0004384   .0032997     0.13   0.895    -.0061926    .0070694
   _SstaXyoun_10 |  -.0092991   .0033241    -2.80   0.007     -.015979   -.0026191
   _SstaXyoun_12 |   .0522109   .0039162    13.33   0.000      .044341    .0600808
   _SstaXyoun_13 |   .0303217   .0041726     7.27   0.000     .0219366    .0387069
   _SstaXyoun_15 |    .012619   .0033687     3.75   0.000     .0058494    .0193887
   _SstaXyoun_16 |   .0249531   .0041645     5.99   0.000     .0165842     .033322
   _SstaXyoun_18 |   .0070845   .0033046     2.14   0.037     .0004436    .0137254
   _SstaXyoun_19 |   .0142454   .0042794     3.33   0.002     .0056456    .0228452
   _SstaXyoun_20 |   .0153339   .0032942     4.65   0.000      .008714    .0219537
   _SstaXyoun_21 |   .0088051   .0033223     2.65   0.011     .0021286    .0154816
   _SstaXyoun_22 |   .0399876   .0034654    11.54   0.000     .0330236    .0469515
   _SstaXyoun_23 |   .0262858   .0033113     7.94   0.000     .0196315    .0329402
   _SstaXyoun_24 |   .0114409   .0032794     3.49   0.001     .0048507     .018031
   _SstaXyoun_25 |   .0251899   .0032635     7.72   0.000     .0186317     .031748
   _SstaXyoun_26 |  -.0283816   .0033175    -8.56   0.000    -.0350485   -.0217148
   _SstaXyoun_27 |   .0062955   .0032703     1.93   0.060    -.0002764    .0128674
   _SstaXyoun_28 |   .0382921   .0038626     9.91   0.000     .0305299    .0460544
   _SstaXyoun_29 |   .0068728   .0033228     2.07   0.044     .0001954    .0135502
   _SstaXyoun_30 |   .0373572   .0032715    11.42   0.000     .0307829    .0439314
   _SstaXyoun_31 |   .0311065   .0033078     9.40   0.000     .0244592    .0377538
   _SstaXyoun_32 |   .0653672   .0033947    19.26   0.000     .0585453     .072189
   _SstaXyoun_33 |    .009089   .0033007     2.75   0.008      .002456     .015722
   _SstaXyoun_34 |   .0035942   .0032584     1.10   0.275    -.0029537    .0101422
   _SstaXyoun_35 |   .0315778   .0033506     9.42   0.000     .0248446     .038311
   _SstaXyoun_36 |    .026452   .0032375     8.17   0.000      .019946     .032958
   _SstaXyoun_37 |   .0175122   .0033445     5.24   0.000     .0107912    .0242333
   _SstaXyoun_38 |   .0450667   .0032781    13.75   0.000      .038479    .0516544
   _SstaXyoun_39 |  -.0176021   .0036254    -4.86   0.000    -.0248877   -.0103165
   _SstaXyoun_40 |   .0007557   .0032973     0.23   0.820    -.0058704    .0073818
   _SstaXyoun_41 |   .0216266   .0033199     6.51   0.000     .0149549    .0282982
   _SstaXyoun_42 |   .0018082   .0032703     0.55   0.583    -.0047637    .0083802
   _SstaXyoun_44 |    .011406   .0032858     3.47   0.001     .0048029    .0180091
   _SstaXyoun_45 |   .0222758   .0060674     3.67   0.001     .0100829    .0344687
   _SstaXyoun_46 |   .0587241    .003302    17.78   0.000     .0520886    .0653597
   _SstaXyoun_47 |   .0403613    .003996    10.10   0.000      .032331    .0483916
   _SstaXyoun_48 |   .0254979   .0033395     7.64   0.000     .0187869    .0322089
   _SstaXyoun_49 |   .0161462   .0039803     4.06   0.000     .0081475     .024145
   _SstaXyoun_50 |   .0287192   .0032376     8.87   0.000     .0222131    .0352254
   _SstaXyoun_51 |   .0028704   .0033194     0.86   0.391    -.0038001     .009541
   _SstaXyoun_53 |   .0070002    .003355     2.09   0.042     .0002581    .0137423
   _SstaXyoun_54 |  -.0006311   .0032976    -0.19   0.849     -.007258    .0059957
   _SstaXyoun_55 |   .0190764   .0032906     5.80   0.000     .0124638     .025689
   _SstaXyoun_56 |   .0022147   .0032211     0.69   0.495    -.0042584    .0086878
    _SstaXlows_1 |   .0127817    .003395     3.76   0.000     .0059592    .0196042
    _SstaXlows_2 |  -.0814136    .001989   -40.93   0.000    -.0854106   -.0774167
    _SstaXlows_4 |  -.0905867    .003841   -23.58   0.000    -.0983054    -.082868
    _SstaXlows_5 |   .0355205   .0020421    17.39   0.000     .0314167    .0396243
    _SstaXlows_6 |  -.0604357    .000227  -266.21   0.000    -.0608919   -.0599795
    _SstaXlows_8 |  -.0688901   .0003086  -223.26   0.000    -.0695102     -.06827
    _SstaXlows_9 |  -.0085489   .0001487   -57.51   0.000    -.0088476   -.0082502
   _SstaXlows_10 |   -.068594   .0002644  -259.40   0.000    -.0691254   -.0680626
   _SstaXlows_12 |  -.0862172    .002635   -32.72   0.000    -.0915124    -.080922
   _SstaXlows_13 |   .0120076   .0030971     3.88   0.000     .0057838    .0182314
   _SstaXlows_15 |  -.0805076   .0001253  -642.36   0.000    -.0807595   -.0802557
   _SstaXlows_16 |   -.028349   .0028934    -9.80   0.000    -.0341635   -.0225344
   _SstaXlows_18 |   .0295338   .0002484   118.89   0.000     .0290346     .030033
   _SstaXlows_19 |   .0059544   .0033094     1.80   0.078     -.000696    .0126048
   _SstaXlows_20 |  -.0030579   .0001115   -27.43   0.000    -.0032819   -.0028338
   _SstaXlows_21 |   .0119711   .0002041    58.67   0.000      .011561    .0123812
   _SstaXlows_22 |  -.0350633   .0017366   -20.19   0.000    -.0385531   -.0315735
   _SstaXlows_23 |    .038397   .0001689   227.37   0.000     .0380576    .0387363
   _SstaXlows_24 |  -.0681245   .0001943  -350.56   0.000    -.0685151    -.067734
   _SstaXlows_25 |  -.0079302   .0001454   -54.53   0.000    -.0082225   -.0076379
   _SstaXlows_26 |  -.0179381    .000135  -132.89   0.000    -.0182094   -.0176668
   _SstaXlows_27 |  -.0220952   .0001031  -214.33   0.000    -.0223023    -.021888
   _SstaXlows_28 |   .0153515   .0026872     5.71   0.000     .0099512    .0207517
   _SstaXlows_29 |   .0118447   .0001657    71.50   0.000     .0115118    .0121776
   _SstaXlows_30 |  -.0287153   .0001673  -171.61   0.000    -.0290516   -.0283791
   _SstaXlows_31 |   .0089373   .0001181    75.69   0.000        .0087    .0091746
   _SstaXlows_32 |  -.0862724   .0007481  -115.32   0.000    -.0877758    -.084769
   _SstaXlows_33 |  -.0005585   .0001789    -3.12   0.003    -.0009181   -.0001989
   _SstaXlows_34 |  -.0280111   .0001214  -230.80   0.000     -.028255   -.0277672
   _SstaXlows_35 |  -.0455404   .0003363  -135.41   0.000    -.0462163   -.0448646
   _SstaXlows_36 |  -.0251739    .000115  -218.96   0.000    -.0254049   -.0249428
   _SstaXlows_37 |   .0457106   .0002563   178.37   0.000     .0451956    .0462256
   _SstaXlows_38 |  -.0366763   .0001178  -311.39   0.000     -.036913   -.0364396
   _SstaXlows_39 |   .0202036   .0021874     9.24   0.000     .0158079    .0245994
   _SstaXlows_40 |  -.0294323   .0001653  -178.06   0.000    -.0297645   -.0291002
   _SstaXlows_41 |  -.0218372   .0002482   -88.00   0.000    -.0223359   -.0213385
   _SstaXlows_42 |   .0215875    .000147   146.84   0.000     .0212921     .021883
   _SstaXlows_44 |   .0446984    .000136   328.57   0.000      .044425    .0449718
   _SstaXlows_45 |  -.0126038   .0055714    -2.26   0.028       -.0238   -.0014076
   _SstaXlows_46 |  -.0050985   .0001483   -34.38   0.000    -.0053966   -.0048005
   _SstaXlows_47 |   .0175785   .0028006     6.28   0.000     .0119504    .0232066
   _SstaXlows_48 |  -.0608274   .0003109  -195.68   0.000    -.0614521   -.0602027
   _SstaXlows_49 |  -.0077726   .0024256    -3.20   0.002    -.0126471    -.002898
   _SstaXlows_50 |    .004731   .0002373    19.93   0.000     .0042541     .005208
   _SstaXlows_51 |  -.0358131    .000208  -172.18   0.000    -.0362311   -.0353951
   _SstaXlows_53 |  -.0555612   .0002989  -185.87   0.000    -.0561619   -.0549605
   _SstaXlows_54 |  -.0212991   .0001998  -106.63   0.000    -.0217005   -.0208977
   _SstaXlows_55 |   .0295637   .0001876   157.60   0.000     .0291867    .0299407
   _SstaXlows_56 |  -.0458349   .0001396  -328.38   0.000    -.0461154   -.0455544
    _SstaXttre_1 |   .0004439   .0006864     0.65   0.521    -.0009355    .0018234
    _SstaXttre_2 |   .0123872    .000821    15.09   0.000     .0107374     .014037
    _SstaXttre_4 |  -.0021394   .0008079    -2.65   0.011    -.0037628   -.0005159
    _SstaXttre_5 |   .0145275    .000403    36.05   0.000     .0137177    .0153373
    _SstaXttre_6 |   .0067981   .0007854     8.66   0.000     .0052198    .0083765
    _SstaXttre_8 |   .0081453   .0002309    35.27   0.000     .0076812    .0086094
    _SstaXttre_9 |   .0057268   .0004036    14.19   0.000     .0049158    .0065379
   _SstaXttre_10 |   .0083659   .0003369    24.84   0.000     .0076889    .0090428
   _SstaXttre_12 |   .0078452   .0008845     8.87   0.000     .0060678    .0096226
   _SstaXttre_13 |   .0032842   .0006933     4.74   0.000      .001891    .0046774
   _SstaXttre_15 |   .0109941   .0004933    22.29   0.000     .0100028    .0119854
   _SstaXttre_16 |   .0097752   .0010549     9.27   0.000     .0076553    .0118951
   _SstaXttre_18 |   .0032772   .0005013     6.54   0.000     .0022699    .0042845
   _SstaXttre_19 |   .0016017   .0009646     1.66   0.103    -.0003368    .0035402
   _SstaXttre_20 |  -.0020105   .0001889   -10.64   0.000    -.0023901   -.0016309
   _SstaXttre_21 |   .0066821   .0002557    26.13   0.000     .0061683     .007196
   _SstaXttre_22 |   .0067037   .0004452    15.06   0.000     .0058089    .0075984
   _SstaXttre_23 |  -.0010919   .0004577    -2.39   0.021    -.0020117    -.000172
   _SstaXttre_24 |   -.000166    .000266    -0.62   0.536    -.0007005    .0003686
   _SstaXttre_25 |   .0027589   .0003801     7.26   0.000      .001995    .0035229
   _SstaXttre_26 |   .0027963    .000307     9.11   0.000     .0021793    .0034133
   _SstaXttre_27 |   .0030509   .0004571     6.67   0.000     .0021324    .0039693
   _SstaXttre_28 |   .0101323   .0008226    12.32   0.000     .0084792    .0117853
   _SstaXttre_29 |    .016907   .0002897    58.35   0.000     .0163248    .0174893
   _SstaXttre_30 |   .0022905   .0005154     4.44   0.000     .0012548    .0033262
   _SstaXttre_31 |   .0098172   .0004484    21.89   0.000     .0089161    .0107182
   _SstaXttre_32 |   .0148749    .000542    27.44   0.000     .0137856    .0159642
   _SstaXttre_33 |   .0053867   .0003278    16.43   0.000      .004728    .0060454
   _SstaXttre_34 |   .0017751   .0002318     7.66   0.000     .0013092     .002241
   _SstaXttre_35 |   .0075615    .000542    13.95   0.000     .0064722    .0086507
   _SstaXttre_36 |   .0025592   .0002747     9.32   0.000     .0020072    .0031112
   _SstaXttre_37 |   .0161109   .0004632    34.79   0.000     .0151802    .0170417
   _SstaXttre_38 |   .0079932   .0005172    15.45   0.000     .0069538    .0090325
   _SstaXttre_39 |   .0036765   .0006458     5.69   0.000     .0023788    .0049742
   _SstaXttre_40 |   .0066738    .000428    15.59   0.000     .0058137    .0075339
   _SstaXttre_41 |   .0076373   .0005591    13.66   0.000     .0065138    .0087607
   _SstaXttre_42 |  -.0029124   .0003117    -9.34   0.000    -.0035389    -.002286
   _SstaXttre_44 |  -.0003045   .0003204    -0.95   0.347    -.0009485    .0003395
   _SstaXttre_45 |   .0179373   .0016536    10.85   0.000     .0146143    .0212603
   _SstaXttre_46 |   .0104315   .0005009    20.82   0.000     .0094248    .0114382
   _SstaXttre_47 |   .0090754   .0009536     9.52   0.000     .0071591    .0109917
   _SstaXttre_48 |   .0091295   .0007556    12.08   0.000     .0076111     .010648
   _SstaXttre_49 |   .0074115   .0009155     8.10   0.000     .0055718    .0092512
   _SstaXttre_50 |   .0008792   .0005109     1.72   0.092    -.0001474    .0019058
   _SstaXttre_51 |   .0100911   .0002288    44.11   0.000     .0096314    .0105509
   _SstaXttre_53 |   .0061529   .0005926    10.38   0.000     .0049621    .0073437
   _SstaXttre_54 |  -.0047606   .0005683    -8.38   0.000    -.0059027   -.0036185
   _SstaXttre_55 |  -.0019981   .0007907    -2.53   0.015    -.0035871   -.0004091
   _SstaXttre_56 |   .0053529   .0004151    12.90   0.000     .0045189     .006187
    _SstaXttrea1 |  -.0000893   .0000814    -1.10   0.278    -.0002528    .0000742
    _SstaXttrea2 |  -.0009288   .0000615   -15.10   0.000    -.0010525   -.0008052
    _SstaXttrea4 |   .0001488   .0000927     1.60   0.115    -.0000375    .0003351
    _SstaXttrea5 |  -.0007533     .00003   -25.13   0.000    -.0008135   -.0006931
    _SstaXttrea6 |  -.0007194   .0000522   -13.79   0.000    -.0008242   -.0006145
    _SstaXttrea8 |  -.0007568   .0000171   -44.28   0.000    -.0007912   -.0007225
    _SstaXttrea9 |  -.0008388   .0000506   -16.57   0.000    -.0009405   -.0007371
   _SstaXttrea10 |  -.0010722   .0000504   -21.26   0.000    -.0011736   -.0009708
   _SstaXttrea12 |  -.0006701   .0000754    -8.89   0.000    -.0008217   -.0005186
   _SstaXttrea13 |  -.0001664   .0000723    -2.30   0.026    -.0003116   -.0000211
   _SstaXttrea15 |  -.0008734   .0000521   -16.77   0.000    -.0009781   -.0007687
   _SstaXttrea16 |  -.0005463   .0000991    -5.51   0.000    -.0007455    -.000347
   _SstaXttrea18 |  -.0001297   .0000296    -4.38   0.000    -.0001893   -.0000702
   _SstaXttrea19 |   .0000639   .0001032     0.62   0.539    -.0001435    .0002713
   _SstaXttrea20 |   .0000567   .0000221     2.57   0.013     .0000123    .0001012
   _SstaXttrea21 |  -.0005475   .0000195   -28.09   0.000    -.0005866   -.0005083
   _SstaXttrea22 |   -.000608   .0000387   -15.73   0.000    -.0006857   -.0005303
   _SstaXttrea23 |  -.0002664   .0000346    -7.71   0.000    -.0003358   -.0001969
   _SstaXttrea24 |   -.000245   .0000222   -11.03   0.000    -.0002896   -.0002003
   _SstaXttrea25 |  -.0006137   .0000363   -16.91   0.000    -.0006866   -.0005408
   _SstaXttrea26 |  -.0002447   .0000128   -19.10   0.000    -.0002705    -.000219
   _SstaXttrea27 |  -.0000775   .0000292    -2.65   0.011    -.0001362   -.0000187
   _SstaXttrea28 |  -.0007463   .0000824    -9.06   0.000    -.0009118   -.0005808
   _SstaXttrea29 |  -.0012425   .0000311   -39.96   0.000     -.001305     -.00118
   _SstaXttrea30 |  -.0000543    .000041    -1.32   0.191    -.0001367    .0000281
   _SstaXttrea31 |    -.00052   .0000373   -13.95   0.000    -.0005949   -.0004451
   _SstaXttrea32 |  -.0010398   .0000436   -23.85   0.000    -.0011274   -.0009522
   _SstaXttrea33 |  -.0007273     .00003   -24.23   0.000    -.0007876    -.000667
   _SstaXttrea34 |  -.0004409   .0000114   -38.71   0.000    -.0004638    -.000418
   _SstaXttrea35 |  -.0005656   .0000425   -13.32   0.000    -.0006509   -.0004803
   _SstaXttrea36 |  -.0003329   .0000167   -19.99   0.000    -.0003664   -.0002994
   _SstaXttrea37 |  -.0013137   .0000289   -45.41   0.000    -.0013718   -.0012555
   _SstaXttrea38 |  -.0004075   .0000374   -10.90   0.000    -.0004827   -.0003323
   _SstaXttrea39 |  -.0003592   .0000518    -6.93   0.000    -.0004633   -.0002551
   _SstaXttrea40 |  -.0006683   .0000244   -27.44   0.000    -.0007172   -.0006193
   _SstaXttrea41 |   -.000655   .0000462   -14.18   0.000    -.0007478   -.0005621
   _SstaXttrea42 |  -7.08e-06   .0000273    -0.26   0.796    -.0000619    .0000477
   _SstaXttrea44 |  -.0002306   .0000287    -8.03   0.000    -.0002884   -.0001729
   _SstaXttrea45 |  -.0011643   .0000945   -12.32   0.000    -.0013542   -.0009744
   _SstaXttrea46 |  -.0005928   .0000441   -13.43   0.000    -.0006815   -.0005042
   _SstaXttrea47 |  -.0006658   .0000853    -7.81   0.000    -.0008371   -.0004945
   _SstaXttrea48 |  -.0006746   .0000815    -8.28   0.000    -.0008385   -.0005108
   _SstaXttrea49 |  -.0005689   .0000751    -7.57   0.000    -.0007198   -.0004179
   _SstaXttrea50 |  -.0000656   .0000426    -1.54   0.130    -.0001513    .0000201
   _SstaXttrea51 |  -.0010232   .0000197   -51.95   0.000    -.0010628   -.0009837
   _SstaXttrea53 |  -.0005133   .0000473   -10.85   0.000    -.0006083   -.0004182
   _SstaXttrea54 |     .00012   .0000324     3.70   0.001     .0000549    .0001851
   _SstaXttrea55 |   .0003013   .0000613     4.92   0.000     .0001782    .0004244
   _SstaXttrea56 |  -.0005773   .0000244   -23.64   0.000    -.0006264   -.0005282
    _SstaXttreb1 |   3.89e-06   1.87e-06     2.08   0.042     1.37e-07    7.64e-06
    _SstaXttreb2 |   .0000218   1.12e-06    19.41   0.000     .0000195     .000024
    _SstaXttreb4 |  -5.19e-07   2.16e-06    -0.24   0.811    -4.86e-06    3.83e-06
    _SstaXttreb5 |   .0000139   4.05e-07    34.41   0.000     .0000131    .0000147
    _SstaXttreb6 |   .0000175   1.02e-06    17.14   0.000     .0000155    .0000196
    _SstaXttreb8 |   .0000179   3.09e-07    57.79   0.000     .0000172    .0000185
    _SstaXttreb9 |   .0000207   1.20e-06    17.27   0.000     .0000183    .0000231
   _SstaXttreb10 |   .0000264   1.23e-06    21.56   0.000      .000024    .0000289
   _SstaXttreb12 |   .0000168   1.46e-06    11.52   0.000     .0000139    .0000197
   _SstaXttreb13 |   3.55e-06   1.53e-06     2.32   0.025     4.75e-07    6.62e-06
   _SstaXttreb15 |   .0000203   1.21e-06    16.70   0.000     .0000178    .0000227
   _SstaXttreb16 |   .0000121   1.97e-06     6.17   0.000     8.19e-06    .0000161
   _SstaXttreb18 |   2.58e-06   5.53e-07     4.67   0.000     1.47e-06    3.69e-06
   _SstaXttreb19 |   7.61e-07   2.28e-06     0.33   0.740    -3.83e-06    5.35e-06
   _SstaXttreb20 |   2.71e-06   5.96e-07     4.54   0.000     1.51e-06    3.91e-06
   _SstaXttreb21 |   .0000134   4.04e-07    33.14   0.000     .0000126    .0000142
   _SstaXttreb22 |   .0000176   8.56e-07    20.53   0.000     .0000159    .0000193
   _SstaXttreb23 |   9.52e-06   7.99e-07    11.93   0.000     7.92e-06    .0000111
   _SstaXttreb24 |   8.89e-06   5.27e-07    16.87   0.000     7.83e-06    9.95e-06
   _SstaXttreb25 |   .0000157   8.31e-07    18.87   0.000      .000014    .0000174
   _SstaXttreb26 |   6.48e-06   2.01e-07    32.30   0.000     6.08e-06    6.88e-06
   _SstaXttreb27 |   1.91e-06   5.94e-07     3.22   0.002     7.16e-07    3.10e-06
   _SstaXttreb28 |   .0000173   1.62e-06    10.67   0.000     .0000141    .0000206
   _SstaXttreb29 |    .000026   6.40e-07    40.67   0.000     .0000247    .0000273
   _SstaXttreb30 |   1.84e-06   8.59e-07     2.14   0.037     1.11e-07    3.56e-06
   _SstaXttreb31 |    .000012   8.55e-07    14.03   0.000     .0000103    .0000137
   _SstaXttreb32 |   .0000236   9.58e-07    24.60   0.000     .0000216    .0000255
   _SstaXttreb33 |   .0000176   7.27e-07    24.20   0.000     .0000161     .000019
   _SstaXttreb34 |   .0000122   2.76e-07    44.12   0.000     .0000116    .0000127
   _SstaXttreb35 |   .0000157   8.46e-07    18.54   0.000      .000014    .0000174
   _SstaXttreb36 |   8.87e-06   4.05e-07    21.91   0.000     8.06e-06    9.68e-06
   _SstaXttreb37 |   .0000268   4.83e-07    55.44   0.000     .0000258    .0000277
   _SstaXttreb38 |    .000011   8.26e-07    13.27   0.000     9.30e-06    .0000126
   _SstaXttreb39 |   9.39e-06   8.22e-07    11.43   0.000     7.74e-06     .000011
   _SstaXttreb40 |   .0000182   5.62e-07    32.36   0.000     .0000171    .0000193
   _SstaXttreb41 |   .0000155   1.00e-06    15.50   0.000     .0000135    .0000175
   _SstaXttreb42 |   3.87e-06   6.05e-07     6.40   0.000     2.66e-06    5.09e-06
   _SstaXttreb44 |   6.34e-06   6.74e-07     9.41   0.000     4.98e-06    7.69e-06
   _SstaXttreb45 |   .0000234   1.62e-06    14.41   0.000     .0000201    .0000266
   _SstaXttreb46 |   .0000143   9.66e-07    14.82   0.000     .0000124    .0000163
   _SstaXttreb47 |   .0000124   1.65e-06     7.47   0.000     9.03e-06    .0000157
   _SstaXttreb48 |   .0000159   1.90e-06     8.34   0.000      .000012    .0000197
   _SstaXttreb49 |   .0000144   1.34e-06    10.70   0.000     .0000117    .0000171
   _SstaXttreb50 |   2.33e-06   9.31e-07     2.50   0.016     4.56e-07    4.20e-06
   _SstaXttreb51 |   .0000243   4.60e-07    52.86   0.000     .0000234    .0000252
   _SstaXttreb53 |   .0000122   9.99e-07    12.22   0.000     .0000102    .0000142
   _SstaXttreb54 |   1.91e-06   5.29e-07     3.62   0.001     8.51e-07    2.98e-06
   _SstaXttreb55 |  -6.21e-06   1.17e-06    -5.30   0.000    -8.56e-06   -3.85e-06
   _SstaXttreb56 |   .0000196   4.94e-07    39.60   0.000     .0000186    .0000206
           _cons |  -.0609161   .0137101    -4.44   0.000    -.0884675   -.0333647
----------------------------------------------------------------------------------

. estimates store empdhi5 ;

. estimates table empdhi1 empdhi2 empdhi3 empdhi4 empdhi5, keep($outvars) b(%7.3f) se(%7.3f) stats(N) ;

----------------------------------------------------------------
    Variable | empdhi1   empdhi2   empdhi3   empdhi4   empdhi5  
-------------+--------------------------------------------------
    blackpro |   0.017     0.005     0.016     0.016     0.016  
             |   0.013     0.010     0.010     0.010     0.011  
     hisppro |  -0.016    -0.032    -0.010    -0.008    -0.008  
             |   0.011     0.009     0.010     0.010     0.010  
   femalepro |   0.005     0.005    -0.018    -0.016    -0.016  
             |   0.013     0.008     0.008     0.008     0.008  
    youngpro |  -0.004    -0.011    -0.009    -0.010    -0.010  
             |   0.008     0.007     0.007     0.007     0.007  
 lowskillpro |  -0.011    -0.028     0.010     0.008     0.008  
             |   0.015     0.005     0.006     0.006     0.006  
         pro |   0.000     0.012    -0.002    -0.008    -0.004  
             |   0.009     0.010     0.009     0.009     0.009  
       black |   0.039     0.053     0.035     0.046     0.046  
             |   0.007     0.000     0.008     0.009     0.009  
        hisp |   0.005     0.072     0.113     0.119     0.120  
             |   0.009     0.000     0.008     0.005     0.005  
      female |  -0.146    -0.162    -0.191    -0.184    -0.183  
             |   0.009     0.000     0.006     0.005     0.005  
    lowskill |   0.058     0.078     0.138     0.138     0.137  
             |   0.008     0.000     0.004     0.005     0.005  
         age |   0.023     0.021     0.021     0.021     0.021  
             |   0.001     0.001     0.001     0.001     0.001  
        age2 |  -0.000    -0.000    -0.000    -0.000    -0.000  
             |   0.000     0.000     0.000     0.000     0.000  
-------------+--------------------------------------------------
           N | 2075295   2075295   2075295   2075295   2075295  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empdhi1 empdhi2 empdhi3 empdhi4 empdhi5, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |  empdhi1      empdhi2      empdhi3      empdhi4      empdhi5    
-------------+-----------------------------------------------------------------
    blackpro |   0.017        0.005        0.016        0.016        0.016     
     hisppro |  -0.016       -0.032***    -0.010       -0.008       -0.008     
   femalepro |   0.005        0.005       -0.018*      -0.016       -0.016     
    youngpro |  -0.004       -0.011       -0.009       -0.010       -0.010     
 lowskillpro |  -0.011       -0.028***     0.010        0.008        0.008     
         pro |   0.000        0.012       -0.002       -0.008       -0.004     
       black |   0.039***     0.053***     0.035***     0.046***     0.046***  
        hisp |   0.005        0.072***     0.113***     0.119***     0.120***  
      female |  -0.146***    -0.162***    -0.191***    -0.184***    -0.183***  
    lowskill |   0.058***     0.078***     0.138***     0.138***     0.137***  
         age |   0.023***     0.021***     0.021***     0.021***     0.021***  
        age2 |  -0.000***    -0.000***    -0.000***    -0.000***    -0.000***  
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. log close ;
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A4\specifications.log
  log type:  text
 closed on:   6 Mar 2020, 19:58:16
-------------------------------------------------------------------------------------------------------------------------------------------------------------
