-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A5\basic_exclusive1990.log
  log type:  text
 opened on:   6 Mar 2020, 20:15:00

. /*****
> 
> Uses pro- and anti-drug testing state legislation by year from IDFW documentation
> to generate D-in-D style estimates of drug testing impacts by demographic group.
> 
> Demographic groups defined in mutually exclusive way. Excludes Hispanics from sample.
> 
> Estimates baseline specs with cubics in time plus their interactions with demographics
> instead of year dummies.
> 
> Use only years 1990-2010.
> 
> *****/
> 
> set mem 6g ;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set matsize 800 ;

. set more off ;

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_March_CPS/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_March_CPS

. use Output/marcps.dta ;

. cd ../Tables/Appendix_Tables/Appx_table_A5/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A5

. *use marcps_test.dta ;
. drop if year < 1990 ;
(837,175 observations deleted)

. summ year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |  1,923,538    2000.822    6.074007       1990       2010

. /** Construct variables for estimation **/
> 
> * Pro and anti dummies, by state-year ;
. gen pro=0 ;

. replace pro=1 if (year>=yrpro & yrpro~=0) ;
(282,533 real changes made)

. gen anti=0 ;

. replace anti=1 if (year>=yranti & yranti~=0) ;
(119,778 real changes made)

. /*
> bysort pro: tab1 yrpro yranti ;
> bysort pro: summ year ;
> bysort anti: tab1 yrpro yranti ;
> bysort anti: summ year ;
> bysort year: summ pro anti ;
> */
> 
> * Reduce education groups to 2 ;
. gen lowskill=1 if edgrp4==1 | edgrp4==2 ;
(1,027,273 missing values generated)

. replace lowskill=0 if edgrp4==3 | edgrp4==4 ;
(1,027,273 real changes made)

. gen edgrp2=. ;
(1,923,538 missing values generated)

. replace edgrp2=1 if lowskill==1 ;
(896,265 real changes made)

. replace edgrp2=2 if lowskill==0 ;
(1,027,273 real changes made)

. gen young=(age<=25) ;

. summ young lowskill ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       young |  1,923,538    .1927791    .3944812          0          1
    lowskill |  1,923,538    .4659461    .4988391          0          1

. gen raceeth=. ;
(1,923,538 missing values generated)

. replace raceeth=1 if black==0 & hisp==0 ;
(1,440,279 real changes made)

.  *non-Hispanic Whites ;
. replace raceeth=2 if black==1 ;
(195,000 real changes made)

.  * Blacks ;
. drop if raceeth==. ;
(288,259 observations deleted)

. gen age2=age*age ;

. /* Now create 8 mutually exclusive groups on skill-race-gender */
> 
> gen group8=. ;
(1,635,279 missing values generated)

. replace group8=1 if edgrp2==1 & raceeth==2 & female==0 ;
(48,412 real changes made)

. replace group8=2 if edgrp2==2 & raceeth==2 & female==0 ;
(35,786 real changes made)

. replace group8=3 if edgrp2==1 & raceeth==2 & female==1 ;
(57,755 real changes made)

. replace group8=4 if edgrp2==2 & raceeth==2 & female==1 ;
(53,047 real changes made)

. replace group8=5 if edgrp2==1 & raceeth==1 & female==0 ;
(297,602 real changes made)

. replace group8=6 if edgrp2==2 & raceeth==1 & female==0 ;
(403,505 real changes made)

. replace group8=7 if edgrp2==1 & raceeth==1 & female==1 ;
(295,048 real changes made)

. replace group8=8 if edgrp2==2 & raceeth==1 & female==1 ;
(444,124 real changes made)

. tab1 group8 ;

-> tabulation of group8  

     group8 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     48,412        2.96        2.96
          2 |     35,786        2.19        5.15
          3 |     57,755        3.53        8.68
          4 |     53,047        3.24       11.92
          5 |    297,602       18.20       30.12
          6 |    403,505       24.67       54.80
          7 |    295,048       18.04       72.84
          8 |    444,124       27.16      100.00
------------+-----------------------------------
      Total |  1,635,279      100.00

. char group8[omit] 6 ;

.  * Omit high skilled white men. ;
. xi, prefix(_P) i.group8*pro ;
i.group8          _Pgroup8_1-8        (naturally coded; _Pgroup8_6 omitted)
i.group8*pro      _PgroXpro_#         (coded as above)

. xi, prefix(_A) i.group8*anti ;
i.group8          _Agroup8_1-8        (naturally coded; _Agroup8_6 omitted)
i.group8*anti     _AgroXanti_#        (coded as above)

. drop _Agroup8* ;

. * Time cubics and their double interactions ;
. gen ttrend=year - 1980 ;

. sum ttrend ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ttrend |  1,635,279    20.72444    6.082702         10         30

. gen ttrend2=ttrend^2 ;

. gen ttrend3=ttrend^3 ;

. * State dummies and their interactions with demographics plus linear state trends ;
. char statefip[omit] 17 ;

.  * omit IL - set this so not omitting a pro or anti state ;
. xi, prefix(_S) i.statefip*i.group8 i.statefip*ttrend i.statefip*ttrend2 i.statefip*ttrend3 ;
i.statefip        _Sstatefip_1-56     (naturally coded; _Sstatefip_17 omitted)
i.group8          _Sgroup8_1-8        (naturally coded; _Sgroup8_6 omitted)
i.sta~p*i.gro~8   _SstaXgro_#_#       (coded as above)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)
i.stat~p*ttre~2   _SstaXttrea#        (coded as above)
i.stat~p*ttre~3   _SstaXttreb#        (coded as above)

. drop _Sgroup8* ;

. xi, prefix(_T) i.group8*ttrend i.group8*ttrend2 i.group8*ttrend3 ;
i.group8          _Tgroup8_1-8        (naturally coded; _Tgroup8_6 omitted)
i.group8*ttrend   _TgroXttren_#       (coded as above)
i.group8*ttre~2   _TgroXttrena#       (coded as above)
i.group8*ttre~3   _TgroXttrenb#       (coded as above)

. drop _Tgroup8* ;

. /** Outcome variables **/
> 
> gen empdhi=1 if empd==1 & inlist(ind1,1,4,5,3,11)==1 ;
(1,311,883 missing values generated)

. replace empdhi=0 if empd==1 & inlist(ind1,1,4,5,3,11)~=1 ;
(939,683 real changes made)

. summ empdhi ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      empdhi |  1,263,079    .2560378    .4364431          0          1

. gen empdmid=1 if firmsizer==2 | firmsizer==3 ;
(1,268,769 missing values generated)

. replace empdmid=0 if firmsizer==1 | firmsizer==4 ;
(1,014,014 real changes made)

. gen empdlg=1 if firmsizer==4 ;
(1,019,784 missing values generated)

. replace empdlg=0 if firmsizer==1 | firmsizer==2 | firmsizer==3 ;
(765,029 real changes made)

. gen ph=. ;
(1,635,279 missing values generated)

. replace ph=1 if pensionr==1 | inclughr==1 ;
(954,198 real changes made)

. replace ph=0 if pensionr==0 & inclughr==0 ;
(426,326 real changes made)

. replace ph=. if pensionr==. | inclughr==. ;
(0 real changes made)

. summ empdmid empdlg ph ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     empdmid |  1,380,524    .2654861    .4415919          0          1
      empdlg |  1,380,524    .4458416    .4970584          0          1
          ph |  1,380,524    .6911854    .4620047          0          1

. gen lrhw=log(rhwage) ;
(335,005 missing values generated)

. /** Estimations **/
> 
> /** Main specification with DTI interactions **/
> 
> summ year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |  1,635,279    2000.724    6.082702       1990       2010

. global controls _P* pro age age2
>   eg* minwage unemploymentrate incarcr
>   tt* _S* _T* ;

. unab pvars: _P* ;

.     global outvars `pvars' pro age age2 ;

. summ $outvars year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  _Pgroup8_1 |  1,635,279    .0296047    .1694943          0          1
  _Pgroup8_2 |  1,635,279    .0218837    .1463039          0          1
  _Pgroup8_3 |  1,635,279    .0353181    .1845827          0          1
  _Pgroup8_4 |  1,635,279    .0324391    .1771633          0          1
  _Pgroup8_5 |  1,635,279    .1819885    .3858352          0          1
-------------+---------------------------------------------------------
  _Pgroup8_7 |  1,635,279    .1804267    .3845426          0          1
  _Pgroup8_8 |  1,635,279    .2715891    .4447793          0          1
 _PgroXpro_1 |  1,635,279    .0072862    .0850478          0          1
 _PgroXpro_2 |  1,635,279    .0047136    .0684935          0          1
 _PgroXpro_3 |  1,635,279    .0083448    .0909677          0          1
-------------+---------------------------------------------------------
 _PgroXpro_4 |  1,635,279    .0076048    .0868734          0          1
 _PgroXpro_5 |  1,635,279    .0260836    .1593841          0          1
 _PgroXpro_7 |  1,635,279    .0252501    .1568839          0          1
 _PgroXpro_8 |  1,635,279    .0388307    .1931913          0          1
         pro |  1,635,279    .1520303    .3590504          0          1
-------------+---------------------------------------------------------
         age |  1,635,279    36.87833    10.49295         18         55
        age2 |  1,635,279    1470.114     770.146        324       3025
        year |  1,635,279    2000.724    6.082702       1990       2010

. summ empd empdhi inclughr pensionr lrhw if pro==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |  1,386,212    .7747661    .4177365          0          1
      empdhi |  1,073,990    .2567705    .4368519          0          1
    inclughr |  1,175,010    .5321461    .4989658          0          1
    pensionr |  1,175,010    .5696632    .4951235          0          1
        lrhw |  1,105,551    2.524803    .7722387  -8.419633   10.81632

. reg empd $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 2,707,114,352)

Linear regression                               Number of obs     =  1,600,738
                                                F(38, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0786
                                                Root MSE          =     .40693

                                  (Std. Err. adjusted for 50 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
            empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
      _Pgroup8_1 |   .1404447   .1392842     1.01   0.318    -.1394574    .4203469
      _Pgroup8_2 |   .0421501   .1254633     0.34   0.738    -.2099779     .294278
      _Pgroup8_3 |  -.3444258    .119505    -2.88   0.006    -.5845801   -.1042716
      _Pgroup8_4 |  -.1239235   .1032788    -1.20   0.236    -.3314699     .083623
      _Pgroup8_5 |   .0900915   .0692896     1.30   0.200    -.0491512    .2293342
      _Pgroup8_7 |  -.2770305   .0541461    -5.12   0.000    -.3858412   -.1682197
      _Pgroup8_8 |  -.3678185   .0533034    -6.90   0.000    -.4749357   -.2607012
     _PgroXpro_1 |  -.0043805   .0184193    -0.24   0.813    -.0413954    .0326345
     _PgroXpro_2 |   .0049166    .012102     0.41   0.686    -.0194032    .0292365
     _PgroXpro_3 |   .0073397   .0165434     0.44   0.659    -.0259055     .040585
     _PgroXpro_4 |  -.0282055   .0142176    -1.98   0.053    -.0567768    .0003657
     _PgroXpro_5 |   .0014683   .0074046     0.20   0.844    -.0134119    .0163484
     _PgroXpro_7 |  -.0114327   .0118517    -0.96   0.339    -.0352497    .0123843
     _PgroXpro_8 |   .0038889   .0077761     0.50   0.619    -.0117378    .0195157
             pro |   .0072476   .0072321     1.00   0.321    -.0072859     .021781
             age |   .0397184   .0010925    36.35   0.000     .0375229    .0419139
            age2 |  -.0004917   .0000131   -37.64   0.000    -.0005179   -.0004654
           eg200 |   .0053867   .0052753     1.02   0.312    -.0052144    .0159878
           eg300 |   -.023594   .0139659    -1.69   0.097    -.0516595    .0044715
           eg400 |  -.0782182   .0242946    -3.22   0.002      -.12704   -.0293963
           eg500 |  -.0068823   .0106128    -0.65   0.520    -.0282094    .0144449
           eg900 |   .1282609   .0522096     2.46   0.018     .0233419      .23318
         minwage |   .0058499   .0019845     2.95   0.005     .0018619     .009838
unemploymentrate |  -.0120191   .0008447   -14.23   0.000    -.0137166   -.0103217
         incarcr |  -3.320554   1.710705    -1.94   0.058    -6.758343     .117236
          ttrend |   .0171642   .0062897     2.73   0.009     .0045246    .0298038
         ttrend2 |  -.0010199   .0003131    -3.26   0.002     -.001649   -.0003907
         ttrend3 |   .0000165   5.29e-06     3.12   0.003     5.90e-06    .0000272
    _Sstatefip_1 |  -.0570138   .0267506    -2.13   0.038    -.1107711   -.0032565
    _Sstatefip_2 |   .0589244   .0506914     1.16   0.251    -.0429438    .1607926
    _Sstatefip_4 |   -.075664   .0259339    -2.92   0.005    -.1277802   -.0235478
    _Sstatefip_5 |   .1307657   .0344796     3.79   0.000     .0614763     .200055
    _Sstatefip_6 |  -.1140283   .0341683    -3.34   0.002     -.182692   -.0453646
    _Sstatefip_8 |   .1530141   .0281534     5.44   0.000     .0964377    .2095906
    _Sstatefip_9 |   .1998333   .0290117     6.89   0.000      .141532    .2581345
   _Sstatefip_10 |    .000655   .0208967     0.03   0.975    -.0413385    .0426485
   _Sstatefip_12 |   .1579336   .0243498     6.49   0.000     .1090009    .2068662
   _Sstatefip_13 |   .1304699   .0216373     6.03   0.000     .0869882    .1739516
   _Sstatefip_15 |  -.1405397   .0506273    -2.78   0.008    -.2422791   -.0388003
   _Sstatefip_16 |   .1107416   .0354138     3.13   0.003     .0395748    .1819084
   _Sstatefip_18 |  -.0046447    .023282    -0.20   0.843    -.0514316    .0421422
   _Sstatefip_19 |  -.0778793   .0211907    -3.68   0.001    -.1204636    -.035295
   _Sstatefip_20 |    .050048   .0196895     2.54   0.014     .0104805    .0896156
   _Sstatefip_21 |   .4808066   .0223846    21.48   0.000      .435823    .5257902
   _Sstatefip_22 |  -.1553504   .0198018    -7.85   0.000    -.1951436   -.1155573
   _Sstatefip_23 |  -.0432172   .0280402    -1.54   0.130     -.099566    .0131316
   _Sstatefip_24 |   .2851973   .0152399    18.71   0.000     .2545715     .315823
   _Sstatefip_25 |   .0743155    .024399     3.05   0.004     .0252839     .123347
   _Sstatefip_26 |   .0624337    .027487     2.27   0.028     .0071965    .1176709
   _Sstatefip_27 |  -.0188925   .0184911    -1.02   0.312    -.0560517    .0182668
   _Sstatefip_28 |   .4002743   .0384319    10.42   0.000     .3230426     .477506
   _Sstatefip_29 |   .3092755   .0240193    12.88   0.000     .2610069    .3575441
   _Sstatefip_30 |   .2105882   .0211184     9.97   0.000     .1681493    .2530272
   _Sstatefip_31 |   .1108261    .018927     5.86   0.000     .0727909    .1488614
   _Sstatefip_32 |    .254297   .0294459     8.64   0.000     .1951233    .3134706
   _Sstatefip_33 |   .4790172   .0232413    20.61   0.000      .432312    .5257224
   _Sstatefip_34 |  -.0412403   .0206506    -2.00   0.051    -.0827393    .0002587
   _Sstatefip_35 |   .3493794   .0272514    12.82   0.000     .2946157    .4041432
   _Sstatefip_36 |   .0457679   .0160938     2.84   0.006     .0134262    .0781096
   _Sstatefip_37 |  -.0586939   .0138969    -4.22   0.000    -.0866208    -.030767
   _Sstatefip_38 |    .035118     .02634     1.33   0.189    -.0178142    .0880502
   _Sstatefip_39 |   .2771334   .0229951    12.05   0.000      .230923    .3233437
   _Sstatefip_40 |   .1865381   .0151182    12.34   0.000     .1561568    .2169193
   _Sstatefip_41 |  -.1590143   .0364932    -4.36   0.000    -.2323502   -.0856784
   _Sstatefip_42 |   .0589709   .0149607     3.94   0.000     .0289062    .0890355
   _Sstatefip_44 |  -.1263121    .025759    -4.90   0.000    -.1780767   -.0745474
   _Sstatefip_45 |   .1850733   .0309796     5.97   0.000     .1228175    .2473292
   _Sstatefip_46 |   .0328038   .0246712     1.33   0.190    -.0167748    .0823823
   _Sstatefip_47 |  -.1578136   .0308369    -5.12   0.000    -.2197826   -.0958445
   _Sstatefip_48 |  -.1104141   .0552621    -2.00   0.051    -.2214674    .0006392
   _Sstatefip_49 |  -.1317068     .03025    -4.35   0.000    -.1924965    -.070917
   _Sstatefip_50 |   .1670104   .0311485     5.36   0.000     .1044151    .2296056
   _Sstatefip_51 |   .1658922   .0203424     8.15   0.000     .1250125    .2067718
   _Sstatefip_53 |   .1998369   .0309498     6.46   0.000      .137641    .2620328
   _Sstatefip_54 |   .4992809   .0196534    25.40   0.000     .4597858    .5387759
   _Sstatefip_55 |   .0768911   .0179363     4.29   0.000     .0408466    .1129355
   _Sstatefip_56 |   .2147598   .0290275     7.40   0.000     .1564268    .2730928
   _SstaXgro_1_1 |   .0725329   .0130034     5.58   0.000     .0464016    .0986643
   _SstaXgro_1_2 |   .0178151   .0091632     1.94   0.058    -.0005991    .0362293
   _SstaXgro_1_3 |   .0537032   .0118471     4.53   0.000     .0298956    .0775108
   _SstaXgro_1_4 |   .0304112    .011106     2.74   0.009     .0080929    .0527295
   _SstaXgro_1_5 |   -.002055   .0054707    -0.38   0.709    -.0130487    .0089388
   _SstaXgro_1_7 |  -.0809194   .0083646    -9.67   0.000    -.0977286   -.0641102
   _SstaXgro_1_8 |  -.0231643   .0058279    -3.97   0.000     -.034876   -.0114527
   _SstaXgro_2_1 |   .2845561   .0069303    41.06   0.000      .270629    .2984831
   _SstaXgro_2_2 |   .1394613   .0054311    25.68   0.000      .128547    .1503755
   _SstaXgro_2_3 |   .2535504   .0064474    39.33   0.000     .2405939    .2665069
   _SstaXgro_2_4 |   .0247326   .0067429     3.67   0.001     .0111822     .038283
   _SstaXgro_2_5 |  -.0541517   .0034472   -15.71   0.000    -.0610792   -.0472243
   _SstaXgro_2_7 |  -.0236658   .0050071    -4.73   0.000    -.0337279   -.0136036
   _SstaXgro_2_8 |   .0043368   .0033693     1.29   0.204    -.0024341    .0111077
   _SstaXgro_4_1 |   .1234612   .0150027     8.23   0.000     .0933123    .1536102
   _SstaXgro_4_2 |   .1015367   .0095784    10.60   0.000     .0822882    .1207852
   _SstaXgro_4_3 |   .1098082   .0139514     7.87   0.000     .0817718    .1378445
   _SstaXgro_4_4 |   .0526261   .0120793     4.36   0.000     .0283519    .0769004
   _SstaXgro_4_5 |   .0035797   .0060921     0.59   0.560    -.0086629    .0158223
   _SstaXgro_4_7 |  -.0243526    .009285    -2.62   0.012    -.0430115   -.0056937
   _SstaXgro_4_8 |  -.0429445   .0062843    -6.83   0.000    -.0555733   -.0303158
   _SstaXgro_5_1 |   .1129647   .0078601    14.37   0.000     .0971693    .1287601
   _SstaXgro_5_2 |   .0271632   .0055429     4.90   0.000     .0160243    .0383021
   _SstaXgro_5_3 |   .0742124   .0072377    10.25   0.000     .0596678     .088757
   _SstaXgro_5_4 |   .0263026   .0071693     3.67   0.001     .0118953    .0407099
   _SstaXgro_5_5 |   -.007041   .0034057    -2.07   0.044    -.0138851    -.000197
   _SstaXgro_5_7 |  -.0366413   .0051288    -7.14   0.000    -.0469479   -.0263347
   _SstaXgro_5_8 |  -.0058371   .0036394    -1.60   0.115    -.0131507    .0014766
   _SstaXgro_6_1 |   .0844974   .0004906   172.24   0.000     .0835116    .0854833
   _SstaXgro_6_2 |   .0577308   .0001427   404.64   0.000     .0574441    .0580175
   _SstaXgro_6_3 |   .0314556   .0005352    58.77   0.000       .03038    .0325312
   _SstaXgro_6_4 |   .0023371   .0001787    13.08   0.000      .001978    .0026962
   _SstaXgro_6_5 |  -.0294885    .000464   -63.55   0.000    -.0304209   -.0285561
   _SstaXgro_6_7 |  -.0599373   .0003057  -196.05   0.000    -.0605517   -.0593229
   _SstaXgro_6_8 |  -.0110869   .0000525  -211.17   0.000    -.0111924   -.0109814
   _SstaXgro_8_1 |   .1767978   .0005226   338.32   0.000     .1757476    .1778479
   _SstaXgro_8_2 |    .062582      .0006   104.30   0.000     .0613762    .0637877
   _SstaXgro_8_3 |   .0693401   .0007017    98.82   0.000       .06793    .0707502
   _SstaXgro_8_4 |   .0053336   .0003714    14.36   0.000     .0045873    .0060799
   _SstaXgro_8_5 |   .0255521   .0004165    61.35   0.000     .0247151     .026389
   _SstaXgro_8_7 |  -.0003313    .000433    -0.77   0.448    -.0012015    .0005389
   _SstaXgro_8_8 |  -.0093553   .0001355   -69.04   0.000    -.0096276    -.009083
   _SstaXgro_9_1 |   .1596349   .0006086   262.31   0.000     .1584119    .1608578
   _SstaXgro_9_2 |   .0473986   .0002605   181.97   0.000     .0468752    .0479221
   _SstaXgro_9_3 |   .1600357   .0006875   232.78   0.000     .1586541    .1614173
   _SstaXgro_9_4 |   .0634872    .000515   123.28   0.000     .0624523    .0645221
   _SstaXgro_9_5 |   .0128407   .0001315    97.63   0.000     .0125764     .013105
   _SstaXgro_9_7 |   .0367513   .0001098   334.83   0.000     .0365307    .0369719
   _SstaXgro_9_8 |   .0080254   .0000969    82.81   0.000     .0078307    .0082202
  _SstaXgro_10_1 |   .1970534   .0021191    92.99   0.000      .192795    .2013118
  _SstaXgro_10_2 |   .0938334   .0025759    36.43   0.000     .0886569    .0990099
  _SstaXgro_10_3 |   .1987983   .0017918   110.95   0.000     .1951975     .202399
  _SstaXgro_10_4 |   .0219978   .0014924    14.74   0.000     .0189987     .024997
  _SstaXgro_10_5 |   .0068584    .001037     6.61   0.000     .0047744    .0089424
  _SstaXgro_10_7 |   .0182939   .0009269    19.74   0.000     .0164312    .0201566
  _SstaXgro_10_8 |  -.0049732    .000853    -5.83   0.000    -.0066873   -.0032591
  _SstaXgro_12_1 |    .190792    .009946    19.18   0.000     .1708046    .2107793
  _SstaXgro_12_2 |   .0698805   .0069739    10.02   0.000     .0558659    .0838952
  _SstaXgro_12_3 |   .1005794   .0087399    11.51   0.000      .083016    .1181428
  _SstaXgro_12_4 |   .0469976   .0088733     5.30   0.000      .029166    .0648292
  _SstaXgro_12_5 |   .0082375   .0042097     1.96   0.056    -.0002222    .0166972
  _SstaXgro_12_7 |  -.0052074   .0063372    -0.82   0.415    -.0179425    .0075277
  _SstaXgro_12_8 |  -.0124839   .0044562    -2.80   0.007    -.0214389   -.0035289
  _SstaXgro_13_1 |   .1490026   .0116941    12.74   0.000     .1255024    .1725028
  _SstaXgro_13_2 |    .046235   .0081236     5.69   0.000       .02991    .0625599
  _SstaXgro_13_3 |   .0972744   .0103407     9.41   0.000      .076494    .1180548
  _SstaXgro_13_4 |    .047727   .0100704     4.74   0.000     .0274898    .0679643
  _SstaXgro_13_5 |   .0067765   .0050123     1.35   0.183    -.0032961     .016849
  _SstaXgro_13_7 |  -.0472088   .0077039    -6.13   0.000    -.0626903   -.0317273
  _SstaXgro_13_8 |  -.0434282   .0052642    -8.25   0.000     -.054007   -.0328493
  _SstaXgro_15_1 |   .3297334   .0019972   165.10   0.000     .3257198     .333747
  _SstaXgro_15_2 |   .1369219   .0006476   211.43   0.000     .1356204    .1382233
  _SstaXgro_15_3 |   .1391406   .0009376   148.40   0.000     .1372564    .1410247
  _SstaXgro_15_4 |  -.0748856   .0006169  -121.39   0.000    -.0761252   -.0736459
  _SstaXgro_15_5 |  -.0109292   .0003677   -29.72   0.000    -.0116682   -.0101902
  _SstaXgro_15_7 |  -.0064029   .0004238   -15.11   0.000    -.0072545   -.0055514
  _SstaXgro_15_8 |   .0271604   .0000998   272.26   0.000     .0269599    .0273609
  _SstaXgro_16_1 |   .2313618   .0125723    18.40   0.000     .2060968    .2566269
  _SstaXgro_16_2 |   .0184055   .0077809     2.37   0.022     .0027693    .0340418
  _SstaXgro_16_3 |  -.0535508   .0106547    -5.03   0.000    -.0749623   -.0321394
  _SstaXgro_16_4 |   .0405433   .0114353     3.55   0.001     .0175633    .0635233
  _SstaXgro_16_5 |   .0065524   .0047799     1.37   0.177    -.0030532     .016158
  _SstaXgro_16_7 |   .0260487   .0071872     3.62   0.001     .0116056    .0404918
  _SstaXgro_16_8 |   -.018501   .0050449    -3.67   0.001    -.0286391    -.008363
  _SstaXgro_18_1 |   .0597769   .0004719   126.66   0.000     .0588285    .0607253
  _SstaXgro_18_2 |   .0739208   .0010208    72.42   0.000     .0718695    .0759722
  _SstaXgro_18_3 |   .0879822   .0006995   125.79   0.000     .0865766    .0893878
  _SstaXgro_18_4 |   .0089679   .0004031    22.25   0.000     .0081579     .009778
  _SstaXgro_18_5 |    .000813   .0001241     6.55   0.000     .0005635    .0010624
  _SstaXgro_18_7 |  -.0214825   .0001316  -163.29   0.000    -.0217469   -.0212181
  _SstaXgro_18_8 |  -.0060518   .0000909   -66.57   0.000    -.0062345   -.0058691
  _SstaXgro_19_1 |    .082392   .0136136     6.05   0.000     .0550344    .1097495
  _SstaXgro_19_2 |   .0367089   .0091504     4.01   0.000     .0183205    .0550973
  _SstaXgro_19_3 |   .0804602   .0129297     6.22   0.000     .0544769    .1064435
  _SstaXgro_19_4 |   -.017639   .0111764    -1.58   0.121    -.0400988    .0048208
  _SstaXgro_19_5 |   .0163778   .0053703     3.05   0.004     .0055857    .0271699
  _SstaXgro_19_7 |   .0598559   .0082691     7.24   0.000     .0432386    .0764732
  _SstaXgro_19_8 |   .0269407   .0057683     4.67   0.000     .0153488    .0385326
  _SstaXgro_20_1 |   .1125283   .0004294   262.04   0.000     .1116654    .1133913
  _SstaXgro_20_2 |   .0844806   .0006765   124.89   0.000     .0831212      .08584
  _SstaXgro_20_3 |   .0784211   .0001019   769.33   0.000     .0782162    .0786259
  _SstaXgro_20_4 |    -.05729   .0006283   -91.19   0.000    -.0585526   -.0560275
  _SstaXgro_20_5 |    .006911   .0002471    27.97   0.000     .0064145    .0074075
  _SstaXgro_20_7 |   .0067035   .0002342    28.63   0.000      .006233    .0071741
  _SstaXgro_20_8 |   .0043818   .0000527    83.10   0.000     .0042759    .0044878
  _SstaXgro_21_1 |   .1508082   .0009734   154.93   0.000      .148852    .1527643
  _SstaXgro_21_2 |   .0414525   .0007146    58.01   0.000     .0400164    .0428886
  _SstaXgro_21_3 |   .0910886   .0006747   135.00   0.000     .0897327    .0924445
  _SstaXgro_21_4 |   .0040811    .000633     6.45   0.000     .0028091    .0053531
  _SstaXgro_21_5 |  -.0579731   .0002254  -257.25   0.000     -.058426   -.0575202
  _SstaXgro_21_7 |  -.0950932   .0002281  -416.91   0.000    -.0955515   -.0946348
  _SstaXgro_21_8 |    .008485   .0000791   107.31   0.000     .0083261    .0086439
  _SstaXgro_22_1 |   .0858196   .0070468    12.18   0.000     .0716586    .0999806
  _SstaXgro_22_2 |   -.007543   .0046349    -1.63   0.110    -.0168573    .0017713
  _SstaXgro_22_3 |   .0180532   .0058444     3.09   0.003     .0063083     .029798
  _SstaXgro_22_4 |    .000317   .0060173     0.05   0.958    -.0117751    .0124092
  _SstaXgro_22_5 |  -.0189118   .0027089    -6.98   0.000    -.0243556    -.013468
  _SstaXgro_22_7 |  -.1073649      .0041   -26.19   0.000    -.1156042   -.0991256
  _SstaXgro_22_8 |  -.0364115   .0029079   -12.52   0.000    -.0422551    -.030568
  _SstaXgro_23_1 |   .3138464   .0022787   137.73   0.000     .3092672    .3184256
  _SstaXgro_23_2 |   .1471356   .0019373    75.95   0.000     .1432424    .1510288
  _SstaXgro_23_3 |   .1894418   .0015307   123.76   0.000     .1863657    .1925178
  _SstaXgro_23_4 |  -.1071401   .0021864   -49.00   0.000    -.1115337   -.1027464
  _SstaXgro_23_5 |  -.0280599   .0008893   -31.55   0.000    -.0298469   -.0262728
  _SstaXgro_23_7 |   .0120802   .0006624    18.24   0.000     .0107491    .0134113
  _SstaXgro_23_8 |   .0463735   .0006274    73.91   0.000     .0451126    .0476343
  _SstaXgro_24_1 |   .1426702   .0007758   183.89   0.000     .1411111    .1442292
  _SstaXgro_24_2 |   .0626015    .000657    95.29   0.000     .0612813    .0639217
  _SstaXgro_24_3 |   .1451281   .0002154   673.92   0.000     .1446954    .1455609
  _SstaXgro_24_4 |   .0601316   .0002394   251.13   0.000     .0596504    .0606128
  _SstaXgro_24_5 |  -.0009687   .0002207    -4.39   0.000    -.0014122   -.0005253
  _SstaXgro_24_7 |  -.0125018   .0001658   -75.39   0.000     -.012835   -.0121686
  _SstaXgro_24_8 |    -.01259   .0000746  -168.71   0.000      -.01274   -.0124401
  _SstaXgro_25_1 |   .1485915   .0011077   134.15   0.000     .1463655    .1508174
  _SstaXgro_25_2 |   .0233889   .0008085    28.93   0.000     .0217642    .0250136
  _SstaXgro_25_3 |   .0556554   .0008117    68.57   0.000     .0540242    .0572866
  _SstaXgro_25_4 |   .0180715   .0006643    27.20   0.000     .0167365    .0194066
  _SstaXgro_25_5 |   -.028063   .0001169  -240.05   0.000     -.028298   -.0278281
  _SstaXgro_25_7 |   .0119441   .0001203    99.30   0.000     .0117024    .0121858
  _SstaXgro_25_8 |    .025735    .000082   313.85   0.000     .0255702    .0258998
  _SstaXgro_26_1 |   .0360784   .0003619    99.69   0.000     .0353512    .0368057
  _SstaXgro_26_2 |  -.0022958   .0003076    -7.46   0.000     -.002914   -.0016776
  _SstaXgro_26_3 |   .0086055   .0002358    36.50   0.000     .0081317    .0090792
  _SstaXgro_26_4 |  -.0188663   .0001089  -173.22   0.000    -.0190852   -.0186475
  _SstaXgro_26_5 |  -.0292462   .0000983  -297.56   0.000    -.0294437   -.0290487
  _SstaXgro_26_7 |  -.0295396   .0001258  -234.83   0.000    -.0297924   -.0292868
  _SstaXgro_26_8 |   .0013954   .0000672    20.77   0.000     .0012604    .0015304
  _SstaXgro_27_1 |   .1474764    .001222   120.68   0.000     .1450206    .1499321
  _SstaXgro_27_2 |   .0443196   .0004213   105.19   0.000     .0434729    .0451662
  _SstaXgro_27_3 |   .0072282   .0016523     4.37   0.000     .0039077    .0105488
  _SstaXgro_27_4 |  -.0412879   .0004788   -86.24   0.000      -.04225   -.0403257
  _SstaXgro_27_5 |   -.004174   .0002482   -16.82   0.000    -.0046727   -.0036753
  _SstaXgro_27_7 |   .0613834   .0002344   261.89   0.000     .0609124    .0618544
  _SstaXgro_27_8 |    .037625   .0001949   193.06   0.000     .0372333    .0380166
  _SstaXgro_28_1 |   .0935662   .0107083     8.74   0.000      .072047    .1150854
  _SstaXgro_28_2 |   .0170485   .0072421     2.35   0.023      .002495     .031602
  _SstaXgro_28_3 |   .0366529   .0090848     4.03   0.000     .0183963    .0549094
  _SstaXgro_28_4 |  -.0085384   .0089206    -0.96   0.343     -.026465    .0093882
  _SstaXgro_28_5 |  -.0060574   .0043964    -1.38   0.175    -.0148922    .0027775
  _SstaXgro_28_7 |   -.100467   .0066695   -15.06   0.000    -.1138698   -.0870642
  _SstaXgro_28_8 |  -.0381025   .0046599    -8.18   0.000     -.047467    -.028738
  _SstaXgro_29_1 |   .1114538   .0006845   162.82   0.000     .1100783    .1128294
  _SstaXgro_29_2 |   .0671638   .0003871   173.49   0.000     .0663858    .0679418
  _SstaXgro_29_3 |   .1218337   .0005992   203.32   0.000     .1206295    .1230378
  _SstaXgro_29_4 |   .0255175   .0004296    59.39   0.000     .0246541    .0263809
  _SstaXgro_29_5 |  -.0036702   .0001269   -28.92   0.000    -.0039252   -.0034152
  _SstaXgro_29_7 |  -.0008332   .0001568    -5.31   0.000    -.0011483   -.0005181
  _SstaXgro_29_8 |    .025593   .0000632   405.22   0.000     .0254661    .0257199
  _SstaXgro_30_1 |   .1352179   .0021698    62.32   0.000     .1308575    .1395784
  _SstaXgro_30_2 |     .20446   .0024342    84.00   0.000     .1995683    .2093516
  _SstaXgro_30_3 |   .1803148   .0016651   108.29   0.000     .1769686     .183661
  _SstaXgro_30_4 |  -.0476097   .0010543   -45.16   0.000    -.0497284   -.0454909
  _SstaXgro_30_5 |  -.0051547   .0003882   -13.28   0.000    -.0059349   -.0043746
  _SstaXgro_30_7 |   .0255121   .0005351    47.68   0.000     .0244368    .0265873
  _SstaXgro_30_8 |   .0513902   .0001022   502.73   0.000     .0511848    .0515956
  _SstaXgro_31_1 |   .0914968   .0005583   163.89   0.000     .0903749    .0926187
  _SstaXgro_31_2 |   .0571631   .0010229    55.88   0.000     .0551075    .0592187
  _SstaXgro_31_3 |   .0706218   .0006655   106.12   0.000     .0692844    .0719591
  _SstaXgro_31_4 |    .002713    .000634     4.28   0.000      .001439    .0039871
  _SstaXgro_31_5 |   .0193083   .0000975   198.04   0.000     .0191124    .0195042
  _SstaXgro_31_7 |   .0489793   .0001017   481.70   0.000     .0487749    .0491836
  _SstaXgro_31_8 |   .0276844    .000043   644.33   0.000      .027598    .0277707
  _SstaXgro_32_1 |   .2157545   .0012138   177.75   0.000     .2133153    .2181937
  _SstaXgro_32_2 |   .0554816   .0014425    38.46   0.000     .0525828    .0583804
  _SstaXgro_32_3 |   .0920221   .0014519    63.38   0.000     .0891044    .0949397
  _SstaXgro_32_4 |  -.0275156   .0008226   -33.45   0.000    -.0291687   -.0258625
  _SstaXgro_32_5 |   .0134333   .0004886    27.49   0.000     .0124514    .0144152
  _SstaXgro_32_7 |   -.002417   .0005637    -4.29   0.000    -.0035499   -.0012841
  _SstaXgro_32_8 |  -.0269669   .0002221  -121.44   0.000    -.0274131   -.0265206
  _SstaXgro_33_1 |   .0670239   .0009312    71.97   0.000     .0651525    .0688953
  _SstaXgro_33_2 |   .1101377   .0012716    86.61   0.000     .1075823    .1126931
  _SstaXgro_33_3 |   .0373113   .0019101    19.53   0.000     .0334729    .0411498
  _SstaXgro_33_4 |  -.1014938   .0018051   -56.23   0.000    -.1051212   -.0978664
  _SstaXgro_33_5 |   .0154648   .0004339    35.65   0.000      .014593    .0163367
  _SstaXgro_33_7 |   .0283208   .0003751    75.49   0.000      .027567    .0290747
  _SstaXgro_33_8 |   .0045336   .0000952    47.62   0.000     .0043423    .0047249
  _SstaXgro_34_1 |   .1361949   .0005133   265.34   0.000     .1351635    .1372264
  _SstaXgro_34_2 |   .0543542   .0004347   125.04   0.000     .0534807    .0552278
  _SstaXgro_34_3 |    .132853   .0002906   457.13   0.000     .1322689     .133437
  _SstaXgro_34_4 |   .0060493   .0004773    12.68   0.000     .0050902    .0070084
  _SstaXgro_34_5 |   .0158078   .0001307   120.94   0.000     .0155451    .0160705
  _SstaXgro_34_7 |  -.0197804   .0000825  -239.73   0.000    -.0199462   -.0196146
  _SstaXgro_34_8 |  -.0293619   .0000755  -389.13   0.000    -.0295136   -.0292103
  _SstaXgro_35_1 |   .0750283   .0017568    42.71   0.000     .0714978    .0785587
  _SstaXgro_35_2 |    .051819   .0008623    60.09   0.000     .0500861     .053552
  _SstaXgro_35_3 |   .1112171   .0015939    69.78   0.000      .108014    .1144202
  _SstaXgro_35_4 |  -.0076148   .0003298   -23.09   0.000    -.0082776    -.006952
  _SstaXgro_35_5 |  -.0455352   .0006726   -67.70   0.000    -.0468869   -.0441835
  _SstaXgro_35_7 |   -.059765   .0006424   -93.04   0.000    -.0610559   -.0584741
  _SstaXgro_35_8 |  -.0029838   .0000687   -43.46   0.000    -.0031218   -.0028459
  _SstaXgro_36_1 |   .0846207   .0003228   262.19   0.000     .0839721    .0852693
  _SstaXgro_36_2 |   .0177318   .0006625    26.76   0.000     .0164005    .0190632
  _SstaXgro_36_3 |   .0598045   .0003469   172.38   0.000     .0591073    .0605017
  _SstaXgro_36_4 |  -.0106112   .0002615   -40.58   0.000    -.0111367   -.0100857
  _SstaXgro_36_5 |  -.0092608   .0002226   -41.61   0.000    -.0097081   -.0088136
  _SstaXgro_36_7 |  -.0494328   .0002224  -222.29   0.000    -.0498797   -.0489859
  _SstaXgro_36_8 |   .0021313   .0000596    35.78   0.000     .0020116     .002251
  _SstaXgro_37_1 |   .1755931   .0004936   355.75   0.000     .1746012     .176585
  _SstaXgro_37_2 |   .0470028   .0005683    82.71   0.000     .0458607    .0481448
  _SstaXgro_37_3 |    .107392   .0005049   212.72   0.000     .1063775    .1084066
  _SstaXgro_37_4 |   .0170381   .0004993    34.12   0.000     .0160346    .0180416
  _SstaXgro_37_5 |  -.0017391   .0001776    -9.79   0.000    -.0020959   -.0013822
  _SstaXgro_37_7 |  -.0377499   .0002058  -183.40   0.000    -.0381636   -.0373363
  _SstaXgro_37_8 |  -.0227416   .0001244  -182.74   0.000    -.0229917   -.0224915
  _SstaXgro_38_1 |   .2837964    .002975    95.39   0.000     .2778178    .2897749
  _SstaXgro_38_2 |    .170298   .0025887    65.78   0.000     .1650957    .1755002
  _SstaXgro_38_3 |   .0785014   .0018552    42.31   0.000     .0747733    .0822296
  _SstaXgro_38_4 |  -.0634109   .0012582   -50.40   0.000    -.0659393   -.0608825
  _SstaXgro_38_5 |  -.0000155   .0001294    -0.12   0.905    -.0002756    .0002445
  _SstaXgro_38_7 |   .0647175     .00028   231.14   0.000     .0641548    .0652801
  _SstaXgro_38_8 |   .0568404   .0000356  1598.43   0.000      .056769    .0569119
  _SstaXgro_39_1 |   .1043542   .0086592    12.05   0.000     .0869529    .1217555
  _SstaXgro_39_2 |   .0119621   .0062021     1.93   0.060    -.0005014    .0244257
  _SstaXgro_39_3 |   .0458158    .007797     5.88   0.000     .0301472    .0614845
  _SstaXgro_39_4 |   .0094964   .0073616     1.29   0.203    -.0052974    .0242902
  _SstaXgro_39_5 |  -.0164139   .0036132    -4.54   0.000    -.0236748    -.009153
  _SstaXgro_39_7 |  -.0320949   .0054622    -5.88   0.000    -.0430716   -.0211183
  _SstaXgro_39_8 |   .0038403   .0038596     0.99   0.325     -.003916    .0115965
  _SstaXgro_40_1 |   .0858467   .0002209   388.56   0.000     .0854027    .0862907
  _SstaXgro_40_2 |   .0160031   .0007158    22.36   0.000     .0145647    .0174415
  _SstaXgro_40_3 |   .0444792   .0004764    93.36   0.000     .0435218    .0454366
  _SstaXgro_40_4 |  -.0125944    .000369   -34.13   0.000     -.013336   -.0118528
  _SstaXgro_40_5 |  -.0128708   .0002821   -45.63   0.000    -.0134377   -.0123039
  _SstaXgro_40_7 |  -.0571677   .0003343  -170.99   0.000    -.0578396   -.0564958
  _SstaXgro_40_8 |  -.0239683    .000084  -285.45   0.000    -.0241371   -.0237996
  _SstaXgro_41_1 |   .1222224   .0019625    62.28   0.000     .1182786    .1261662
  _SstaXgro_41_2 |   .0385879   .0007978    48.37   0.000     .0369847    .0401912
  _SstaXgro_41_3 |    .109981   .0010511   104.64   0.000     .1078687    .1120932
  _SstaXgro_41_4 |  -.1305373   .0004114  -317.30   0.000    -.1313641   -.1297106
  _SstaXgro_41_5 |  -.0070459   .0006654   -10.59   0.000    -.0083831   -.0057087
  _SstaXgro_41_7 |  -.0178361   .0005761   -30.96   0.000    -.0189939   -.0166783
  _SstaXgro_41_8 |   .0060405   .0000657    91.98   0.000     .0059085    .0061724
  _SstaXgro_42_1 |   .0395118   .0003353   117.83   0.000     .0388379    .0401857
  _SstaXgro_42_2 |   .0251048   .0002148   116.85   0.000     .0246731    .0255366
  _SstaXgro_42_3 |   .0510929   .0004535   112.66   0.000     .0501815    .0520043
  _SstaXgro_42_4 |   .0047623   .0004032    11.81   0.000     .0039521    .0055725
  _SstaXgro_42_5 |   .0083679   .0001356    61.69   0.000     .0080953    .0086405
  _SstaXgro_42_7 |  -.0105153   .0002226   -47.23   0.000    -.0109627   -.0100679
  _SstaXgro_42_8 |  -.0005822   .0001064    -5.47   0.000    -.0007961   -.0003683
  _SstaXgro_44_1 |    .179954   .0009963   180.62   0.000     .1779519    .1819561
  _SstaXgro_44_2 |   .0597024   .0005363   111.33   0.000     .0586247    .0607801
  _SstaXgro_44_3 |   .1176851   .0007361   159.88   0.000     .1162058    .1191643
  _SstaXgro_44_4 |  -.0225862   .0010621   -21.27   0.000    -.0247206   -.0204518
  _SstaXgro_44_5 |  -.0462726   .0003313  -139.66   0.000    -.0469384   -.0456068
  _SstaXgro_44_7 |   .0031468   .0003914     8.04   0.000     .0023603    .0039333
  _SstaXgro_44_8 |   .0315992   .0002662   118.72   0.000     .0310643    .0321341
  _SstaXgro_45_1 |   .1377718   .0182711     7.54   0.000     .1010547    .1744889
  _SstaXgro_45_2 |   .0394479   .0119092     3.31   0.002     .0155154    .0633803
  _SstaXgro_45_3 |   .0922345   .0164497     5.61   0.000     .0591776    .1252914
  _SstaXgro_45_4 |   .0584239   .0140424     4.16   0.000     .0302047    .0866432
  _SstaXgro_45_5 |   .0117316   .0074105     1.58   0.120    -.0031604    .0266236
  _SstaXgro_45_7 |  -.0280978   .0118115    -2.38   0.021    -.0518339   -.0043617
  _SstaXgro_45_8 |  -.0161545    .007722    -2.09   0.042    -.0316725   -.0006366
  _SstaXgro_46_1 |     .31619   .0018259   173.17   0.000     .3125207    .3198594
  _SstaXgro_46_2 |    .092881   .0008718   106.54   0.000     .0911292    .0946329
  _SstaXgro_46_3 |    .204244   .0022228    91.88   0.000      .199777     .208711
  _SstaXgro_46_4 |   .0645719   .0018543    34.82   0.000     .0608456    .0682983
  _SstaXgro_46_5 |   .0116746   .0002092    55.81   0.000     .0112542     .012095
  _SstaXgro_46_7 |   .0559045   .0003167   176.54   0.000     .0552681    .0565408
  _SstaXgro_46_8 |   .0466057   .0000874   533.54   0.000     .0464302    .0467813
  _SstaXgro_47_1 |    .109584   .0107219    10.22   0.000     .0880376    .1311305
  _SstaXgro_47_2 |   .0870312   .0074279    11.72   0.000     .0721043    .1019581
  _SstaXgro_47_3 |   .1280952   .0091045    14.07   0.000     .1097991    .1463913
  _SstaXgro_47_4 |   .0472816    .008818     5.36   0.000     .0295612     .065002
  _SstaXgro_47_5 |  -.0258794   .0045846    -5.64   0.000    -.0350925   -.0166664
  _SstaXgro_47_7 |  -.0626911   .0068985    -9.09   0.000    -.0765541   -.0488281
  _SstaXgro_47_8 |  -.0243616   .0049011    -4.97   0.000    -.0342107   -.0145124
  _SstaXgro_48_1 |   .1285637   .0005131   250.59   0.000     .1275327    .1295947
  _SstaXgro_48_2 |   .0577554   .0004943   116.85   0.000     .0567621    .0587487
  _SstaXgro_48_3 |   .1164427   .0004619   252.09   0.000     .1155144    .1173709
  _SstaXgro_48_4 |    .013386   .0004525    29.58   0.000     .0124767    .0142953
  _SstaXgro_48_5 |   .0166405   .0003882    42.87   0.000     .0158604    .0174206
  _SstaXgro_48_7 |  -.0308279   .0003757   -82.06   0.000    -.0315829    -.030073
  _SstaXgro_48_8 |  -.0350547   .0000772  -454.20   0.000    -.0352098   -.0348996
  _SstaXgro_49_1 |   .2768435   .0119481    23.17   0.000      .252833    .3008541
  _SstaXgro_49_2 |   .0657756   .0075157     8.75   0.000     .0506721     .080879
  _SstaXgro_49_3 |   .1904249   .0103321    18.43   0.000     .1696618     .211188
  _SstaXgro_49_4 |   .0151333   .0091582     1.65   0.105    -.0032709    .0335375
  _SstaXgro_49_5 |   .0235779    .004216     5.59   0.000     .0151055    .0320503
  _SstaXgro_49_7 |  -.0012958     .00624    -0.21   0.836    -.0138356     .011244
  _SstaXgro_49_8 |  -.0796518   .0042171   -18.89   0.000    -.0881264   -.0711772
  _SstaXgro_50_1 |   .1522189   .0051494    29.56   0.000     .1418709    .1625669
  _SstaXgro_50_2 |   .1482912   .0023612    62.80   0.000     .1435462    .1530362
  _SstaXgro_50_3 |   -.044302   .0051022    -8.68   0.000    -.0545553   -.0340487
  _SstaXgro_50_4 |  -.1012545   .0008646  -117.11   0.000     -.102992   -.0995171
  _SstaXgro_50_5 |   .0007274   .0002781     2.62   0.012     .0001685    .0012863
  _SstaXgro_50_7 |     .04637    .000385   120.45   0.000     .0455964    .0471436
  _SstaXgro_50_8 |   .0482839    .000254   190.07   0.000     .0477734    .0487944
  _SstaXgro_51_1 |   .2046502   .0002547   803.59   0.000     .2041384     .205162
  _SstaXgro_51_2 |   .0881829   .0003445   255.98   0.000     .0874906    .0888752
  _SstaXgro_51_3 |   .1598581   .0003872   412.84   0.000       .15908    .1606363
  _SstaXgro_51_4 |   .0374552   .0004659    80.40   0.000      .036519    .0383914
  _SstaXgro_51_5 |   .0129621    .000246    52.68   0.000     .0124676    .0134565
  _SstaXgro_51_7 |  -.0239507   .0001446  -165.66   0.000    -.0242413   -.0236602
  _SstaXgro_51_8 |  -.0190353   .0000852  -223.44   0.000    -.0192065   -.0188641
  _SstaXgro_53_1 |   .0959455   .0011383    84.29   0.000      .093658    .0982329
  _SstaXgro_53_2 |   .0488079   .0007699    63.39   0.000     .0472606    .0503551
  _SstaXgro_53_3 |   .1357521   .0018264    74.33   0.000     .1320819    .1394224
  _SstaXgro_53_4 |   .0251414   .0005185    48.49   0.000     .0240995    .0261834
  _SstaXgro_53_5 |  -.0116105   .0006458   -17.98   0.000    -.0129084   -.0103127
  _SstaXgro_53_7 |  -.0259961   .0007635   -34.05   0.000    -.0275305   -.0244617
  _SstaXgro_53_8 |  -.0136745   .0000563  -243.00   0.000    -.0137876   -.0135614
  _SstaXgro_54_1 |   .0554957     .00065    85.38   0.000     .0541895    .0568019
  _SstaXgro_54_2 |   .0528289   .0015545    33.99   0.000     .0497051    .0559527
  _SstaXgro_54_3 |    .075315   .0005296   142.22   0.000     .0742508    .0763792
  _SstaXgro_54_4 |  -.0241584   .0009141   -26.43   0.000    -.0259954   -.0223213
  _SstaXgro_54_5 |  -.0872406   .0003237  -269.48   0.000    -.0878912   -.0865901
  _SstaXgro_54_7 |  -.1413677   .0001894  -746.52   0.000    -.1417482   -.1409871
  _SstaXgro_54_8 |   .0268481   .0000828   324.16   0.000     .0266816    .0270145
  _SstaXgro_55_1 |   .0364429   .0008808    41.37   0.000     .0346729     .038213
  _SstaXgro_55_2 |  -.0043293   .0001783   -24.28   0.000    -.0046876    -.003971
  _SstaXgro_55_3 |   .0696818   .0005656   123.21   0.000     .0685453    .0708184
  _SstaXgro_55_4 |  -.0306786   .0005459   -56.20   0.000    -.0317757   -.0295816
  _SstaXgro_55_5 |   .0235768   .0001028   229.45   0.000     .0233703    .0237833
  _SstaXgro_55_7 |   .0808649   .0001739   464.88   0.000     .0805153    .0812145
  _SstaXgro_55_8 |   .0475023   .0000567   837.07   0.000     .0473883    .0476164
  _SstaXgro_56_1 |   .1995199   .0008322   239.74   0.000     .1978475    .2011923
  _SstaXgro_56_2 |   .1326731   .0009768   135.83   0.000     .1307102     .134636
  _SstaXgro_56_3 |   .1686911   .0022394    75.33   0.000     .1641908    .1731914
  _SstaXgro_56_4 |   .0123327    .000788    15.65   0.000      .010749    .0139163
  _SstaXgro_56_5 |   .0082193   .0004563    18.01   0.000     .0073024    .0091363
  _SstaXgro_56_7 |  -.0173912   .0004731   -36.76   0.000    -.0183421   -.0164404
  _SstaXgro_56_8 |  -.0088886   .0002236   -39.74   0.000     -.009338   -.0084392
    _SstaXttre_1 |   .0112679   .0038127     2.96   0.005     .0036061    .0189297
    _SstaXttre_2 |  -.0130415   .0082877    -1.57   0.122    -.0296961    .0036132
    _SstaXttre_4 |   .0157536     .00388     4.06   0.000     .0079565    .0235508
    _SstaXttre_5 |  -.0202263   .0056785    -3.56   0.001    -.0316377   -.0088148
    _SstaXttre_6 |   .0239568   .0061361     3.90   0.000     .0116259    .0362878
    _SstaXttre_8 |  -.0307403   .0051687    -5.95   0.000    -.0411272   -.0203534
    _SstaXttre_9 |   -.030785   .0049645    -6.20   0.000    -.0407616   -.0208084
   _SstaXttre_10 |   .0008063   .0033118     0.24   0.809     -.005849    .0074616
   _SstaXttre_12 |  -.0176662   .0041926    -4.21   0.000    -.0260916   -.0092408
   _SstaXttre_13 |  -.0187392   .0036014    -5.20   0.000    -.0259765   -.0115018
   _SstaXttre_15 |   .0155537   .0079324     1.96   0.056    -.0003872    .0314945
   _SstaXttre_16 |  -.0280399   .0061674    -4.55   0.000    -.0404337   -.0156461
   _SstaXttre_18 |   .0031935    .004008     0.80   0.429    -.0048608    .0112479
   _SstaXttre_19 |   .0061038   .0039393     1.55   0.128    -.0018124    .0140201
   _SstaXttre_20 |  -.0118246     .00366    -3.23   0.002    -.0191796   -.0044697
   _SstaXttre_21 |  -.0803087   .0037373   -21.49   0.000     -.087819   -.0727984
   _SstaXttre_22 |   .0243122   .0031599     7.69   0.000     .0179622    .0306622
   _SstaXttre_23 |   .0001714   .0052801     0.03   0.974    -.0104394    .0107822
   _SstaXttre_24 |   -.041892     .00208   -20.14   0.000     -.046072    -.037712
   _SstaXttre_25 |  -.0116038   .0039801    -2.92   0.005    -.0196021   -.0036056
   _SstaXttre_26 |  -.0104758   .0038204    -2.74   0.009    -.0181532   -.0027983
   _SstaXttre_27 |   .0007189   .0038142     0.19   0.851     -.006946    .0083838
   _SstaXttre_28 |  -.0606992   .0069143    -8.78   0.000    -.0745941   -.0468043
   _SstaXttre_29 |  -.0595093    .004332   -13.74   0.000    -.0682148   -.0508037
   _SstaXttre_30 |   -.039931   .0038984   -10.24   0.000     -.047765   -.0320969
   _SstaXttre_31 |  -.0252793   .0036974    -6.84   0.000    -.0327095   -.0178492
   _SstaXttre_32 |  -.0374063   .0045598    -8.20   0.000    -.0465695   -.0282432
   _SstaXttre_33 |  -.0819289   .0037454   -21.87   0.000    -.0894556   -.0744022
   _SstaXttre_34 |   .0083576   .0033251     2.51   0.015     .0016755    .0150397
   _SstaXttre_35 |  -.0711792   .0047423   -15.01   0.000    -.0807092   -.0616492
   _SstaXttre_36 |  -.0103678    .002833    -3.66   0.001    -.0160609   -.0046746
   _SstaXttre_37 |   .0149556    .002271     6.59   0.000     .0103918    .0195195
   _SstaXttre_38 |  -.0192026    .005491    -3.50   0.001    -.0302373   -.0081679
   _SstaXttre_39 |  -.0466252   .0042412   -10.99   0.000    -.0551482   -.0381022
   _SstaXttre_40 |  -.0364086   .0027831   -13.08   0.000    -.0420014   -.0308157
   _SstaXttre_41 |   .0186375   .0063028     2.96   0.005     .0059716    .0313033
   _SstaXttre_42 |  -.0152104   .0022531    -6.75   0.000    -.0197382   -.0106826
   _SstaXttre_44 |   .0232715   .0045885     5.07   0.000     .0140505    .0324924
   _SstaXttre_45 |  -.0243799   .0040576    -6.01   0.000    -.0325338   -.0162259
   _SstaXttre_46 |   -.019439    .004654    -4.18   0.000    -.0287915   -.0100865
   _SstaXttre_47 |   .0252359   .0057813     4.37   0.000     .0136179    .0368539
   _SstaXttre_48 |   .0204448    .008359     2.45   0.018     .0036467    .0372428
   _SstaXttre_49 |   .0172653   .0054726     3.15   0.003     .0062678    .0282628
   _SstaXttre_50 |  -.0331582   .0055757    -5.95   0.000    -.0443629   -.0219535
   _SstaXttre_51 |  -.0223205   .0033658    -6.63   0.000    -.0290844   -.0155567
   _SstaXttre_53 |  -.0380764    .005422    -7.02   0.000    -.0489724   -.0271805
   _SstaXttre_54 |  -.0894148   .0040562   -22.04   0.000     -.097566   -.0812636
   _SstaXttre_55 |  -.0205192    .004123    -4.98   0.000    -.0288047   -.0122337
   _SstaXttre_56 |  -.0415027   .0048655    -8.53   0.000    -.0512803   -.0317251
    _SstaXttrea1 |     -.0006   .0001925    -3.12   0.003    -.0009869    -.000213
    _SstaXttrea2 |   .0006744   .0004549     1.48   0.145    -.0002397    .0015885
    _SstaXttrea4 |  -.0008525   .0001762    -4.84   0.000    -.0012066   -.0004984
    _SstaXttrea5 |   .0010064   .0003049     3.30   0.002     .0003937    .0016192
    _SstaXttrea6 |  -.0016275   .0003241    -5.02   0.000    -.0022787   -.0009762
    _SstaXttrea8 |   .0017279   .0002811     6.15   0.000      .001163    .0022929
    _SstaXttrea9 |   .0012742   .0002797     4.56   0.000     .0007121    .0018363
   _SstaXttrea10 |  -.0000784   .0002207    -0.36   0.724     -.000522    .0003651
   _SstaXttrea12 |   .0004769    .000239     2.00   0.052    -3.45e-06    .0009573
   _SstaXttrea13 |   .0008387   .0001912     4.39   0.000     .0004545    .0012229
   _SstaXttrea15 |  -.0007493   .0004011    -1.87   0.068    -.0015553    .0000568
   _SstaXttrea16 |   .0017244   .0003388     5.09   0.000     .0010436    .0024052
   _SstaXttrea18 |  -.0003142   .0001996    -1.57   0.122    -.0007154    .0000869
   _SstaXttrea19 |  -.0001491   .0002101    -0.71   0.481    -.0005714    .0002731
   _SstaXttrea20 |   .0007382   .0002036     3.63   0.001      .000329    .0011474
   _SstaXttrea21 |   .0041039   .0001958    20.96   0.000     .0037105    .0044973
   _SstaXttrea22 |   -.001043   .0001862    -5.60   0.000    -.0014172   -.0006688
   _SstaXttrea23 |  -.0001896   .0002803    -0.68   0.502    -.0007528    .0003737
   _SstaXttrea24 |   .0020567   .0001013    20.31   0.000     .0018532    .0022602
   _SstaXttrea25 |   .0002692   .0002162     1.25   0.219    -.0001653    .0007037
   _SstaXttrea26 |   .0005333   .0001927     2.77   0.008      .000146    .0009205
   _SstaXttrea27 |  -.0000787    .000185    -0.43   0.672    -.0004506    .0002931
   _SstaXttrea28 |   .0030434   .0004305     7.07   0.000     .0021782    .0039086
   _SstaXttrea29 |   .0033946   .0002532    13.41   0.000     .0028858    .0039034
   _SstaXttrea30 |   .0018539   .0002124     8.73   0.000     .0014271    .0022806
   _SstaXttrea31 |   .0015172   .0001941     7.82   0.000     .0011271    .0019073
   _SstaXttrea32 |   .0017075   .0002413     7.08   0.000     .0012226    .0021924
   _SstaXttrea33 |   .0041031   .0001774    23.13   0.000     .0037466    .0044595
   _SstaXttrea34 |  -.0006429    .000166    -3.87   0.000    -.0009765   -.0003093
   _SstaXttrea35 |   .0041321   .0002428    17.02   0.000     .0036441    .0046202
   _SstaXttrea36 |   .0003837   .0001422     2.70   0.010     .0000979    .0006695
   _SstaXttrea37 |  -.0009325   .0001104    -8.45   0.000    -.0011544   -.0007106
   _SstaXttrea38 |   .0012359   .0002962     4.17   0.000     .0006406    .0018312
   _SstaXttrea39 |   .0023909   .0002374    10.07   0.000     .0019137     .002868
   _SstaXttrea40 |   .0020425   .0001622    12.60   0.000     .0017166    .0023684
   _SstaXttrea41 |  -.0008206   .0003268    -2.51   0.015    -.0014774   -.0001638
   _SstaXttrea42 |   .0007685   .0001094     7.03   0.000     .0005488    .0009883
   _SstaXttrea44 |  -.0014901   .0002587    -5.76   0.000    -.0020099   -.0009703
   _SstaXttrea45 |   .0010085   .0002059     4.90   0.000     .0005947    .0014223
   _SstaXttrea46 |   .0014237   .0002534     5.62   0.000     .0009146    .0019329
   _SstaXttrea47 |  -.0013713   .0003274    -4.19   0.000    -.0020293   -.0007133
   _SstaXttrea48 |  -.0009819   .0003234    -3.04   0.004    -.0016318    -.000332
   _SstaXttrea49 |  -.0006068   .0002906    -2.09   0.042    -.0011907   -.0000229
   _SstaXttrea50 |   .0015244   .0002899     5.26   0.000     .0009418     .002107
   _SstaXttrea51 |   .0008801   .0001724     5.11   0.000     .0005337    .0012265
   _SstaXttrea53 |   .0019373   .0002917     6.64   0.000     .0013511    .0025234
   _SstaXttrea54 |   .0045748   .0002171    21.07   0.000     .0041385    .0050111
   _SstaXttrea55 |   .0012181   .0002494     4.88   0.000     .0007168    .0017194
   _SstaXttrea56 |   .0022698   .0002502     9.07   0.000     .0017669    .0027726
    _SstaXttreb1 |   9.61e-06   2.99e-06     3.21   0.002     3.59e-06    .0000156
    _SstaXttreb2 |  -9.52e-06   7.72e-06    -1.23   0.223     -.000025    5.99e-06
    _SstaXttreb4 |   .0000135   2.56e-06     5.27   0.000     8.36e-06    .0000187
    _SstaXttreb5 |  -.0000161   4.94e-06    -3.26   0.002     -.000026   -6.15e-06
    _SstaXttreb6 |   .0000327   5.41e-06     6.05   0.000     .0000219    .0000436
    _SstaXttreb8 |  -.0000286   4.60e-06    -6.21   0.000    -.0000378   -.0000193
    _SstaXttreb9 |  -.0000154   4.94e-06    -3.12   0.003    -.0000254   -5.49e-06
   _SstaXttreb10 |   2.28e-06   4.23e-06     0.54   0.592    -6.21e-06    .0000108
   _SstaXttreb12 |  -1.49e-06   4.13e-06    -0.36   0.719    -9.79e-06    6.80e-06
   _SstaXttreb13 |  -.0000111   3.16e-06    -3.51   0.001    -.0000175   -4.75e-06
   _SstaXttreb15 |   .0000129   6.43e-06     2.01   0.050    -3.23e-10    .0000258
   _SstaXttreb16 |  -.0000306   5.56e-06    -5.51   0.000    -.0000418   -.0000195
   _SstaXttreb18 |   7.58e-06   2.95e-06     2.56   0.013     1.64e-06    .0000135
   _SstaXttreb19 |   1.20e-06   3.55e-06     0.34   0.737    -5.93e-06    8.33e-06
   _SstaXttreb20 |   -.000013   3.56e-06    -3.66   0.001    -.0000202   -5.86e-06
   _SstaXttreb21 |  -.0000658   3.01e-06   -21.84   0.000    -.0000718   -.0000597
   _SstaXttreb22 |   .0000154   3.19e-06     4.81   0.000     8.95e-06    .0000218
   _SstaXttreb23 |   7.19e-06   4.86e-06     1.48   0.146    -2.58e-06     .000017
   _SstaXttreb24 |  -.0000326   1.56e-06   -20.93   0.000    -.0000358   -.0000295
   _SstaXttreb25 |  -4.34e-07   3.72e-06    -0.12   0.907    -7.90e-06    7.03e-06
   _SstaXttreb26 |  -7.66e-06   3.05e-06    -2.51   0.015    -.0000138   -1.53e-06
   _SstaXttreb27 |   2.62e-06   2.87e-06     0.91   0.366    -3.15e-06    8.38e-06
   _SstaXttreb28 |  -.0000471   7.66e-06    -6.15   0.000    -.0000624   -.0000317
   _SstaXttreb29 |  -.0000588   4.37e-06   -13.44   0.000    -.0000676     -.00005
   _SstaXttreb30 |   -.000026   3.52e-06    -7.36   0.000     -.000033   -.0000189
   _SstaXttreb31 |  -.0000267   3.27e-06    -8.15   0.000    -.0000332   -.0000201
   _SstaXttreb32 |  -.0000232   4.08e-06    -5.68   0.000    -.0000314    -.000015
   _SstaXttreb33 |  -.0000644   2.70e-06   -23.83   0.000    -.0000698   -.0000589
   _SstaXttreb34 |   .0000136   2.59e-06     5.25   0.000     8.40e-06    .0000188
   _SstaXttreb35 |  -.0000743   3.82e-06   -19.42   0.000    -.0000819   -.0000666
   _SstaXttreb36 |  -3.84e-06   2.13e-06    -1.80   0.078    -8.12e-06    4.46e-07
   _SstaXttreb37 |   .0000177   1.74e-06    10.19   0.000     .0000142    .0000212
   _SstaXttreb38 |  -.0000211   5.05e-06    -4.18   0.000    -.0000313    -.000011
   _SstaXttreb39 |  -.0000377   4.01e-06    -9.40   0.000    -.0000458   -.0000297
   _SstaXttreb40 |  -.0000335   2.95e-06   -11.38   0.000    -.0000395   -.0000276
   _SstaXttreb41 |   .0000116   5.28e-06     2.21   0.032     1.04e-06    .0000222
   _SstaXttreb42 |  -.0000106   1.70e-06    -6.25   0.000     -.000014   -7.19e-06
   _SstaXttreb44 |   .0000297   4.56e-06     6.52   0.000     .0000206    .0000389
   _SstaXttreb45 |  -.0000124   3.27e-06    -3.79   0.000     -.000019   -5.83e-06
   _SstaXttreb46 |  -.0000269   4.20e-06    -6.41   0.000    -.0000353   -.0000185
   _SstaXttreb47 |   .0000242   5.51e-06     4.40   0.000     .0000132    .0000353
   _SstaXttreb48 |   .0000154   4.01e-06     3.85   0.000     7.37e-06    .0000235
   _SstaXttreb49 |   5.31e-06   4.73e-06     1.12   0.267    -4.19e-06    .0000148
   _SstaXttreb50 |   -.000021   4.73e-06    -4.44   0.000    -.0000305   -.0000115
   _SstaXttreb51 |  -.0000103   2.77e-06    -3.73   0.001    -.0000159   -4.76e-06
   _SstaXttreb53 |  -.0000303   4.90e-06    -6.18   0.000    -.0000401   -.0000204
   _SstaXttreb54 |  -.0000735   3.42e-06   -21.50   0.000    -.0000804   -.0000666
   _SstaXttreb55 |  -.0000206   4.40e-06    -4.68   0.000    -.0000294   -.0000118
   _SstaXttreb56 |  -.0000367   4.00e-06    -9.19   0.000    -.0000448   -.0000287
   _TgroXttren_1 |  -.0857305   .0227721    -3.76   0.000    -.1314926   -.0399683
   _TgroXttren_2 |   -.030183   .0205389    -1.47   0.148    -.0714575    .0110915
   _TgroXttren_3 |  -.0245554   .0194187    -1.26   0.212    -.0635787     .014468
   _TgroXttren_4 |  -.0064114   .0164201    -0.39   0.698    -.0394088     .026586
   _TgroXttren_5 |  -.0253677   .0118892    -2.13   0.038      -.04926   -.0014754
   _TgroXttren_7 |   .0077656    .008845     0.88   0.384    -.0100092    .0255404
   _TgroXttren_8 |   .0443768   .0084037     5.28   0.000     .0274889    .0612647
   _TgroXttrena1 |   .0046754   .0011667     4.01   0.000     .0023308    .0070201
   _TgroXttrena2 |    .001659   .0010565     1.57   0.123    -.0004642    .0037821
   _TgroXttrena3 |   .0019861    .000986     2.01   0.049     4.69e-06    .0039675
   _TgroXttrena4 |   .0006011   .0008305     0.72   0.473    -.0010678    .0022701
   _TgroXttrena5 |   .0014418   .0006375     2.26   0.028     .0001607    .0027228
   _TgroXttrena7 |   -.000088   .0004556    -0.19   0.848    -.0010036    .0008276
   _TgroXttrena8 |  -.0023186   .0004233    -5.48   0.000    -.0031694   -.0014679
   _TgroXttrenb1 |  -.0000811    .000019    -4.27   0.000    -.0001193   -.0000429
   _TgroXttrenb2 |  -.0000289   .0000172    -1.68   0.099    -.0000634    5.65e-06
   _TgroXttrenb3 |  -.0000404   .0000158    -2.56   0.014    -.0000721   -8.69e-06
   _TgroXttrenb4 |  -.0000128   .0000134    -0.95   0.345    -.0000398    .0000142
   _TgroXttrenb5 |  -.0000279   .0000108    -2.58   0.013    -.0000496   -6.20e-06
   _TgroXttrenb7 |  -2.97e-06   7.46e-06    -0.40   0.692     -.000018     .000012
   _TgroXttrenb8 |   .0000387   6.87e-06     5.63   0.000     .0000249    .0000525
           _cons |   .1328052   .0423785     3.13   0.003     .0476425    .2179679
----------------------------------------------------------------------------------

. estimates store empd ;

. quietly reg empdhi $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdhi ;

. quietly reg empdlg $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdlg ;

. * note group health coverage and pension are conditional on being asked the question ;
. quietly reg ph $controls [pw=wtsupp], cluster(statefip) ;

. estimates store ph ;

. quietly reg lrhw $controls [pw=wtsupp] if hwagesamp==1, cluster(statefip) ;

. estimates store lrhw ;

. ****** ESTIMATES WITH PRO TESTING DUMMY ONLY ******* ;
. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) se(%7.3f) ;

----------------------------------------------------------------
    Variable |  empd     empdhi    empdlg      ph       lrhw    
-------------+--------------------------------------------------
  _Pgroup8_1 |   0.140     0.074    -0.229     0.139    -0.583  
             |   0.139     0.113     0.118     0.145     0.148  
  _Pgroup8_2 |   0.042    -0.034     0.195    -0.003     0.009  
             |   0.125     0.173     0.192     0.138     0.177  
  _Pgroup8_3 |  -0.344     0.166     0.173    -0.197    -0.607  
             |   0.120     0.134     0.123     0.131     0.189  
  _Pgroup8_4 |  -0.124     0.327     0.416     0.020    -0.064  
             |   0.103     0.109     0.106     0.118     0.149  
  _Pgroup8_5 |   0.090     0.079    -0.136    -0.008    -0.197  
             |   0.069     0.073     0.069     0.068     0.067  
  _Pgroup8_7 |  -0.277     0.120    -0.119    -0.194    -0.599  
             |   0.054     0.082     0.060     0.069     0.076  
  _Pgroup8_8 |  -0.368    -0.073    -0.193    -0.269    -0.349  
             |   0.053     0.057     0.064     0.063     0.073  
 _PgroXpro_1 |  -0.004     0.010     0.042     0.022     0.010  
             |   0.018     0.019     0.012     0.012     0.015  
 _PgroXpro_2 |   0.005    -0.017     0.019     0.017    -0.003  
             |   0.012     0.029     0.015     0.013     0.015  
 _PgroXpro_3 |   0.007    -0.007     0.003     0.041    -0.003  
             |   0.017     0.022     0.012     0.010     0.016  
 _PgroXpro_4 |  -0.028    -0.004    -0.006     0.003    -0.008  
             |   0.014     0.016     0.011     0.013     0.016  
 _PgroXpro_5 |   0.001     0.014     0.010     0.018     0.009  
             |   0.007     0.010     0.004     0.005     0.008  
 _PgroXpro_7 |  -0.011    -0.006     0.001     0.005    -0.006  
             |   0.012     0.009     0.008     0.011     0.010  
 _PgroXpro_8 |   0.004    -0.005    -0.011    -0.001    -0.003  
             |   0.008     0.010     0.006     0.006     0.009  
         pro |   0.007    -0.010     0.001    -0.009    -0.001  
             |   0.007     0.012     0.009     0.012     0.008  
         age |   0.040     0.023    -0.003     0.047     0.090  
             |   0.001     0.001     0.001     0.001     0.002  
        age2 |  -0.000    -0.000     0.000    -0.001    -0.001  
             |   0.000     0.000     0.000     0.000     0.000  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |    empd        empdhi       empdlg         ph          lrhw     
-------------+-----------------------------------------------------------------
  _Pgroup8_1 |   0.140        0.074       -0.229        0.139       -0.583***  
  _Pgroup8_2 |   0.042       -0.034        0.195       -0.003        0.009     
  _Pgroup8_3 |  -0.344**      0.166        0.173       -0.197       -0.607**   
  _Pgroup8_4 |  -0.124        0.327**      0.416***     0.020       -0.064     
  _Pgroup8_5 |   0.090        0.079       -0.136       -0.008       -0.197**   
  _Pgroup8_7 |  -0.277***     0.120       -0.119       -0.194**     -0.599***  
  _Pgroup8_8 |  -0.368***    -0.073       -0.193**     -0.269***    -0.349***  
 _PgroXpro_1 |  -0.004        0.010        0.042***     0.022        0.010     
 _PgroXpro_2 |   0.005       -0.017        0.019        0.017       -0.003     
 _PgroXpro_3 |   0.007       -0.007        0.003        0.041***    -0.003     
 _PgroXpro_4 |  -0.028       -0.004       -0.006        0.003       -0.008     
 _PgroXpro_5 |   0.001        0.014        0.010*       0.018***     0.009     
 _PgroXpro_7 |  -0.011       -0.006        0.001        0.005       -0.006     
 _PgroXpro_8 |   0.004       -0.005       -0.011       -0.001       -0.003     
         pro |   0.007       -0.010        0.001       -0.009       -0.001     
         age |   0.040***     0.023***    -0.003***     0.047***     0.090***  
        age2 |  -0.000***    -0.000***     0.000***    -0.001***    -0.001***  
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. macro drop all ;

. estimates clear ;

. global controls _P* _A* pro anti age age2
>   eg* minwage unemploymentrate incarcr
>   tt* _S* _T* ;

. unab avars: _A* ;

.     global outvars `pvars' `avars' pro anti age age2 ;

. summ $outvars year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  _Pgroup8_1 |  1,635,279    .0296047    .1694943          0          1
  _Pgroup8_2 |  1,635,279    .0218837    .1463039          0          1
  _Pgroup8_3 |  1,635,279    .0353181    .1845827          0          1
  _Pgroup8_4 |  1,635,279    .0324391    .1771633          0          1
  _Pgroup8_5 |  1,635,279    .1819885    .3858352          0          1
-------------+---------------------------------------------------------
  _Pgroup8_7 |  1,635,279    .1804267    .3845426          0          1
  _Pgroup8_8 |  1,635,279    .2715891    .4447793          0          1
 _PgroXpro_1 |  1,635,279    .0072862    .0850478          0          1
 _PgroXpro_2 |  1,635,279    .0047136    .0684935          0          1
 _PgroXpro_3 |  1,635,279    .0083448    .0909677          0          1
-------------+---------------------------------------------------------
 _PgroXpro_4 |  1,635,279    .0076048    .0868734          0          1
 _PgroXpro_5 |  1,635,279    .0260836    .1593841          0          1
 _PgroXpro_7 |  1,635,279    .0252501    .1568839          0          1
 _PgroXpro_8 |  1,635,279    .0388307    .1931913          0          1
_AgroXanti_1 |  1,635,279    .0009375    .0306035          0          1
-------------+---------------------------------------------------------
_AgroXanti_2 |  1,635,279    .0008182    .0285927          0          1
_AgroXanti_3 |  1,635,279    .0009974    .0315656          0          1
_AgroXanti_4 |  1,635,279    .0011007     .033159          0          1
_AgroXanti_5 |  1,635,279    .0129079    .1128773          0          1
_AgroXanti_7 |  1,635,279    .0116121    .1071319          0          1
-------------+---------------------------------------------------------
_AgroXanti_8 |  1,635,279    .0216037    .1453855          0          1
         pro |  1,635,279    .1520303    .3590504          0          1
        anti |  1,635,279    .0682599    .2521915          0          1
         age |  1,635,279    36.87833    10.49295         18         55
        age2 |  1,635,279    1470.114     770.146        324       3025
-------------+---------------------------------------------------------
        year |  1,635,279    2000.724    6.082702       1990       2010

. summ empd empdhi inclughr pensionr lrhw if pro==0 & anti==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |  1,274,643    .7733577    .4186594          0          1
      empdhi |    985,755    .2591952    .4381932          0          1
    inclughr |  1,078,577    .5344496     .498812          0          1
    pensionr |  1,078,577    .5685741    .4952755          0          1
        lrhw |  1,015,072    2.520483    .7719139  -8.419633   10.49622

.   reg empd $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 2,707,114,352)

Linear regression                               Number of obs     =  1,600,738
                                                F(44, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0786
                                                Root MSE          =     .40693

                                  (Std. Err. adjusted for 50 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
            empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
      _Pgroup8_1 |   .1402322   .1391554     1.01   0.319    -.1394111    .4198756
      _Pgroup8_2 |   .0419511   .1253934     0.33   0.739    -.2100364    .2939385
      _Pgroup8_3 |  -.3443735   .1197314    -2.88   0.006    -.5849827   -.1037642
      _Pgroup8_4 |  -.1232201   .1031441    -1.19   0.238    -.3304959    .0840557
      _Pgroup8_5 |   .0900412   .0692637     1.30   0.200    -.0491495    .2292319
      _Pgroup8_7 |  -.2767445   .0536429    -5.16   0.000    -.3845439   -.1689451
      _Pgroup8_8 |  -.3672341   .0535925    -6.85   0.000    -.4749323   -.2595359
     _PgroXpro_1 |  -.0045158   .0185198    -0.24   0.808    -.0417327    .0327011
     _PgroXpro_2 |   .0048557   .0121979     0.40   0.692    -.0196569    .0293683
     _PgroXpro_3 |   .0080225   .0165933     0.48   0.631     -.025323     .041368
     _PgroXpro_4 |  -.0278423   .0142529    -1.95   0.056    -.0564847       .0008
     _PgroXpro_5 |   .0015952   .0074436     0.21   0.831    -.0133634    .0165537
     _PgroXpro_7 |  -.0124584   .0118725    -1.05   0.299     -.036317    .0114002
     _PgroXpro_8 |   .0042098   .0078313     0.54   0.593    -.0115278    .0199474
    _AgroXanti_1 |  -.0057167   .0407432    -0.14   0.889    -.0875933    .0761599
    _AgroXanti_2 |  -.0024626   .0269514    -0.09   0.928    -.0566234    .0516982
    _AgroXanti_3 |   .0355309   .0213994     1.66   0.103    -.0074727    .0785346
    _AgroXanti_4 |   .0215703   .0410843     0.53   0.602    -.0609918    .1041323
    _AgroXanti_5 |   .0021439   .0058015     0.37   0.713    -.0095146    .0138024
    _AgroXanti_7 |  -.0199356   .0055598    -3.59   0.001    -.0311084   -.0087628
    _AgroXanti_8 |   .0070077   .0118695     0.59   0.558     -.016845    .0308604
             pro |   .0072813   .0072416     1.01   0.320    -.0072712    .0218338
            anti |   .0113807   .0113492     1.00   0.321    -.0114263    .0341878
             age |   .0397173   .0010927    36.35   0.000     .0375214    .0419133
            age2 |  -.0004916   .0000131   -37.64   0.000    -.0005179   -.0004654
           eg200 |   .0054999   .0052455     1.05   0.300    -.0050413    .0160411
           eg300 |  -.0232578   .0140274    -1.66   0.104    -.0514469    .0049312
           eg400 |  -.0784329   .0243376    -3.22   0.002    -.1273412   -.0295247
           eg500 |  -.0066408   .0106156    -0.63   0.534    -.0279736    .0146919
           eg900 |   .1294087   .0522251     2.48   0.017     .0244585    .2343589
         minwage |   .0058739   .0019817     2.96   0.005     .0018915    .0098563
unemploymentrate |  -.0120002   .0008465   -14.18   0.000    -.0137013   -.0102992
         incarcr |    -3.3493   1.711148    -1.96   0.056    -6.787981     .089381
          ttrend |   .0171352   .0062926     2.72   0.009     .0044898    .0297805
         ttrend2 |  -.0010179   .0003134    -3.25   0.002    -.0016477   -.0003881
         ttrend3 |   .0000165   5.30e-06     3.11   0.003     5.84e-06    .0000271
    _Sstatefip_1 |  -.0569206   .0267022    -2.13   0.038    -.1105807   -.0032605
    _Sstatefip_2 |   .0583057   .0507849     1.15   0.257    -.0437504    .1603619
    _Sstatefip_4 |  -.0757746   .0260058    -2.91   0.005    -.1280353    -.023514
    _Sstatefip_5 |   .1308572   .0344647     3.80   0.000     .0615977    .2001167
    _Sstatefip_6 |  -.1139503   .0341463    -3.34   0.002      -.18257   -.0453307
    _Sstatefip_8 |   .1530727    .028197     5.43   0.000     .0964088    .2097367
    _Sstatefip_9 |   .2209284   .0331947     6.66   0.000     .1542211    .2876358
   _Sstatefip_10 |   .0006571   .0208568     0.03   0.975    -.0412562    .0425705
   _Sstatefip_12 |   .1578435   .0243735     6.48   0.000     .1088631    .2068238
   _Sstatefip_13 |   .1303559   .0216593     6.02   0.000     .0868299    .1738819
   _Sstatefip_15 |  -.1408767    .050714    -2.78   0.008    -.2427903   -.0389631
   _Sstatefip_16 |   .1111057   .0354612     3.13   0.003     .0398437    .1823677
   _Sstatefip_18 |  -.0044044   .0232972    -0.19   0.851    -.0512218     .042413
   _Sstatefip_19 |  -.0783538   .0211491    -3.70   0.001    -.1208544   -.0358531
   _Sstatefip_20 |   .0505073   .0197503     2.56   0.014     .0108177    .0901969
   _Sstatefip_21 |   .4814845    .022419    21.48   0.000     .4364318    .5265373
   _Sstatefip_22 |  -.1551509   .0197122    -7.87   0.000    -.1947641   -.1155377
   _Sstatefip_23 |  -.1044035   .0609596    -1.71   0.093    -.2269064    .0180994
   _Sstatefip_24 |   .2857494   .0152077    18.79   0.000     .2551885    .3163104
   _Sstatefip_25 |   .0747291   .0244436     3.06   0.004     .0256078    .1238504
   _Sstatefip_26 |   .0627602   .0274823     2.28   0.027     .0075323     .117988
   _Sstatefip_27 |   .0445997   .0665452     0.67   0.506    -.0891278    .1783272
   _Sstatefip_28 |   .4004479   .0383054    10.45   0.000     .3234704    .4774254
   _Sstatefip_29 |   .3098452   .0240788    12.87   0.000      .261457    .3582334
   _Sstatefip_30 |   .1894753   .0246461     7.69   0.000     .1399471    .2390035
   _Sstatefip_31 |   .1112343    .019003     5.85   0.000     .0730464    .1494223
   _Sstatefip_32 |   .2550842   .0295835     8.62   0.000     .1956339    .3145344
   _Sstatefip_33 |   .4797315   .0233807    20.52   0.000     .4327462    .5267169
   _Sstatefip_34 |  -.0407322   .0207574    -1.96   0.055    -.0824457    .0009813
   _Sstatefip_35 |   .3499189   .0273473    12.80   0.000     .2949625    .4048754
   _Sstatefip_36 |   .0458879   .0161138     2.85   0.006      .013506    .0782697
   _Sstatefip_37 |  -.0583916   .0138868    -4.20   0.000    -.0862981    -.030485
   _Sstatefip_38 |     .03555   .0264864     1.34   0.186    -.0176764    .0887763
   _Sstatefip_39 |   .2770819   .0229701    12.06   0.000     .2309218    .3232419
   _Sstatefip_40 |   .1420635   .0375665     3.78   0.000     .0665708    .2175562
   _Sstatefip_41 |  -.1584908   .0365735    -4.33   0.000    -.2319881   -.0849936
   _Sstatefip_42 |   .0594325   .0150397     3.95   0.000     .0292091    .0896558
   _Sstatefip_44 |  -.1800662   .0421305    -4.27   0.000    -.2647306   -.0954018
   _Sstatefip_45 |   .1854175   .0309004     6.00   0.000     .1233209     .247514
   _Sstatefip_46 |   .0330429   .0246943     1.34   0.187    -.0165822     .082668
   _Sstatefip_47 |  -.1571095   .0308208    -5.10   0.000    -.2190463   -.0951728
   _Sstatefip_48 |  -.1111438   .0552708    -2.01   0.050    -.2222146   -.0000731
   _Sstatefip_49 |  -.1317631   .0302166    -4.36   0.000    -.1924856   -.0710406
   _Sstatefip_50 |   .1140063    .051508     2.21   0.032     .0104972    .2175155
   _Sstatefip_51 |   .1659095   .0203769     8.14   0.000     .1249606    .2068583
   _Sstatefip_53 |   .1994612   .0308985     6.46   0.000     .1373683     .261554
   _Sstatefip_54 |   .4993519    .019684    25.37   0.000     .4597954    .5389083
   _Sstatefip_55 |   .0771406   .0179908     4.29   0.000     .0409868    .1132945
   _Sstatefip_56 |   .2150992    .029104     7.39   0.000     .1566125    .2735859
   _SstaXgro_1_1 |   .0726259    .013072     5.56   0.000     .0463568     .098895
   _SstaXgro_1_2 |   .0178593   .0092347     1.93   0.059    -.0006986    .0364172
   _SstaXgro_1_3 |   .0532553   .0118779     4.48   0.000     .0293858    .0771249
   _SstaXgro_1_4 |   .0301298   .0111371     2.71   0.009     .0077489    .0525106
   _SstaXgro_1_5 |   -.002141   .0054954    -0.39   0.699    -.0131845    .0089025
   _SstaXgro_1_7 |  -.0802625   .0083813    -9.58   0.000    -.0971053   -.0634197
   _SstaXgro_1_8 |  -.0234056   .0058684    -3.99   0.000    -.0351985   -.0116127
   _SstaXgro_2_1 |   .2846087   .0069822    40.76   0.000     .2705774      .29864
   _SstaXgro_2_2 |   .1394897   .0054853    25.43   0.000     .1284666    .1505129
   _SstaXgro_2_3 |   .2532777   .0064748    39.12   0.000      .240266    .2662893
   _SstaXgro_2_4 |   .0245453   .0067731     3.62   0.001     .0109343    .0381563
   _SstaXgro_2_5 |   -.054205   .0034716   -15.61   0.000    -.0611815   -.0472286
   _SstaXgro_2_7 |  -.0232894   .0050145    -4.64   0.000    -.0333665   -.0132123
   _SstaXgro_2_8 |   .0041791   .0033977     1.23   0.225    -.0026489    .0110071
   _SstaXgro_4_1 |   .1235488   .0150601     8.20   0.000     .0932845    .1538132
   _SstaXgro_4_2 |   .1015816   .0096427    10.53   0.000     .0822039    .1209592
   _SstaXgro_4_3 |   .1093758   .0139788     7.82   0.000     .0812843    .1374672
   _SstaXgro_4_4 |   .0523462   .0121081     4.32   0.000      .028014    .0766784
   _SstaXgro_4_5 |   .0034891   .0061242     0.57   0.571    -.0088181    .0157962
   _SstaXgro_4_7 |  -.0236577   .0092978    -2.54   0.014    -.0423424    -.004973
   _SstaXgro_4_8 |  -.0431948   .0063245    -6.83   0.000    -.0559043   -.0304854
   _SstaXgro_5_1 |   .1130138   .0078973    14.31   0.000     .0971436     .128884
   _SstaXgro_5_2 |   .0271935   .0055819     4.87   0.000     .0159763    .0384108
   _SstaXgro_5_3 |   .0739821   .0072523    10.20   0.000      .059408    .0885562
   _SstaXgro_5_4 |   .0261317   .0071873     3.64   0.001     .0116882    .0405752
   _SstaXgro_5_5 |  -.0070949   .0034207    -2.07   0.043    -.0139691   -.0002207
   _SstaXgro_5_7 |  -.0362732   .0051381    -7.06   0.000    -.0465986   -.0259478
   _SstaXgro_5_8 |  -.0059867   .0036639    -1.63   0.109    -.0133495    .0013762
   _SstaXgro_6_1 |   .0844939   .0004912   172.03   0.000     .0835068    .0854809
   _SstaXgro_6_2 |     .05773   .0001427   404.69   0.000     .0574434    .0580167
   _SstaXgro_6_3 |    .031486   .0005359    58.75   0.000      .030409     .032563
   _SstaXgro_6_4 |   .0023426   .0001773    13.21   0.000     .0019862     .002699
   _SstaXgro_6_5 |  -.0294931   .0004664   -63.24   0.000    -.0304303   -.0285559
   _SstaXgro_6_7 |  -.0599213   .0003055  -196.17   0.000    -.0605351   -.0593074
   _SstaXgro_6_8 |  -.0110899   .0000531  -208.92   0.000    -.0111966   -.0109832
   _SstaXgro_8_1 |   .1767988   .0005228   338.16   0.000     .1757481    .1778494
   _SstaXgro_8_2 |   .0625791    .000605   103.44   0.000     .0613634    .0637948
   _SstaXgro_8_3 |    .069335   .0007023    98.73   0.000     .0679237    .0707463
   _SstaXgro_8_4 |   .0053242    .000372    14.31   0.000     .0045766    .0060718
   _SstaXgro_8_5 |   .0255557    .000414    61.73   0.000     .0247238    .0263876
   _SstaXgro_8_7 |   -.000396   .0004395    -0.90   0.372    -.0012792    .0004871
   _SstaXgro_8_8 |  -.0093472   .0001404   -66.55   0.000    -.0096295    -.009065
   _SstaXgro_9_1 |   .1637821   .0307247     5.33   0.000     .1020384    .2255258
   _SstaXgro_9_2 |   .0495028   .0197309     2.51   0.015     .0098521    .0891534
   _SstaXgro_9_3 |   .1323459   .0164868     8.03   0.000     .0992144    .1654773
   _SstaXgro_9_4 |   .0458443   .0332379     1.38   0.174    -.0209497    .1126383
   _SstaXgro_9_5 |   .0114904   .0041316     2.78   0.008     .0031877     .019793
   _SstaXgro_9_7 |   .0493345    .003765    13.10   0.000     .0417684    .0569005
   _SstaXgro_9_8 |   .0028978   .0086595     0.33   0.739    -.0145042    .0202998
  _SstaXgro_10_1 |   .1970928   .0021622    91.15   0.000     .1927477    .2014378
  _SstaXgro_10_2 |   .0938547   .0026179    35.85   0.000     .0885939    .0991155
  _SstaXgro_10_3 |   .1986331   .0018242   108.89   0.000     .1949672     .202299
  _SstaXgro_10_4 |   .0219117   .0015043    14.57   0.000     .0188887    .0249348
  _SstaXgro_10_5 |   .0068166   .0010756     6.34   0.000      .004655    .0089781
  _SstaXgro_10_7 |   .0185418   .0009476    19.57   0.000     .0166375    .0204461
  _SstaXgro_10_8 |  -.0050726   .0008973    -5.65   0.000    -.0068758   -.0032693
  _SstaXgro_12_1 |   .1908575   .0099937    19.10   0.000     .1707745    .2109406
  _SstaXgro_12_2 |   .0699138    .007024     9.95   0.000     .0557986     .084029
  _SstaXgro_12_3 |   .1002676   .0087635    11.44   0.000     .0826566    .1178786
  _SstaXgro_12_4 |   .0467906   .0088955     5.26   0.000     .0289144    .0646668
  _SstaXgro_12_5 |   .0081751   .0042307     1.93   0.059    -.0003269     .016677
  _SstaXgro_12_7 |  -.0047468   .0063475    -0.75   0.458    -.0175025    .0080089
  _SstaXgro_12_8 |  -.0126662    .004486    -2.82   0.007    -.0216812   -.0036512
  _SstaXgro_13_1 |   .1490828   .0117518    12.69   0.000     .1254667    .1726988
  _SstaXgro_13_2 |   .0462748   .0081831     5.65   0.000     .0298303    .0627194
  _SstaXgro_13_3 |   .0968905   .0103687     9.34   0.000     .0760539    .1177271
  _SstaXgro_13_4 |   .0474909   .0100938     4.70   0.000     .0272065    .0677752
  _SstaXgro_13_5 |    .006703   .0050356     1.33   0.189    -.0034163    .0168224
  _SstaXgro_13_7 |  -.0466502   .0077147    -6.05   0.000    -.0621535   -.0311469
  _SstaXgro_13_8 |  -.0436358    .005298    -8.24   0.000    -.0542825   -.0329891
  _SstaXgro_15_1 |   .3297408   .0020205   163.20   0.000     .3256805     .333801
  _SstaXgro_15_2 |   .1369253   .0006481   211.26   0.000     .1356228    .1382278
  _SstaXgro_15_3 |   .1391005   .0009354   148.71   0.000     .1372207    .1409802
  _SstaXgro_15_4 |  -.0748803   .0006184  -121.09   0.000     -.076123   -.0736377
  _SstaXgro_15_5 |  -.0109276   .0003677   -29.72   0.000    -.0116664   -.0101887
  _SstaXgro_15_7 |  -.0064368   .0004267   -15.09   0.000    -.0072942   -.0055793
  _SstaXgro_15_8 |    .027156   .0001017   266.93   0.000     .0269516    .0273604
  _SstaXgro_16_1 |   .2314296   .0126128    18.35   0.000     .2060832    .2567761
  _SstaXgro_16_2 |   .0184522   .0078322     2.36   0.023     .0027128    .0341916
  _SstaXgro_16_3 |  -.0538447   .0106783    -5.04   0.000    -.0753035   -.0323858
  _SstaXgro_16_4 |   .0403529    .011445     3.53   0.001     .0173533    .0633524
  _SstaXgro_16_5 |   .0064833    .004803     1.35   0.183    -.0031688    .0161353
  _SstaXgro_16_7 |    .026553   .0071966     3.69   0.001     .0120909    .0410151
  _SstaXgro_16_8 |  -.0186947   .0050761    -3.68   0.001    -.0288955   -.0084939
  _SstaXgro_18_1 |   .0597614   .0004764   125.46   0.000     .0588041    .0607186
  _SstaXgro_18_2 |   .0739261   .0010386    71.18   0.000      .071839    .0760132
  _SstaXgro_18_3 |   .0879305   .0007013   125.39   0.000     .0865213    .0893397
  _SstaXgro_18_4 |   .0089938   .0004022    22.36   0.000     .0081855     .009802
  _SstaXgro_18_5 |   .0007984   .0001264     6.32   0.000     .0005444    .0010523
  _SstaXgro_18_7 |  -.0215213   .0001336  -161.07   0.000    -.0217898   -.0212528
  _SstaXgro_18_8 |  -.0060434   .0000955   -63.27   0.000    -.0062354   -.0058515
  _SstaXgro_19_1 |   .0824771   .0136671     6.03   0.000      .055012    .1099422
  _SstaXgro_19_2 |   .0367539   .0092228     3.99   0.000     .0182201    .0552877
  _SstaXgro_19_3 |   .0800183   .0129624     6.17   0.000     .0539695    .1060672
  _SstaXgro_19_4 |  -.0179181   .0112105    -1.60   0.116    -.0404465    .0046102
  _SstaXgro_19_5 |   .0162891   .0053959     3.02   0.004     .0054455    .0271326
  _SstaXgro_19_7 |   .0605298   .0082853     7.31   0.000     .0438799    .0771798
  _SstaXgro_19_8 |   .0267011   .0058079     4.60   0.000     .0150296    .0383725
  _SstaXgro_20_1 |   .1125261   .0004301   261.62   0.000     .1116617    .1133904
  _SstaXgro_20_2 |   .0844846   .0006872   122.94   0.000     .0831036    .0858656
  _SstaXgro_20_3 |   .0784256   .0001034   758.36   0.000     .0782178    .0786334
  _SstaXgro_20_4 |  -.0573001   .0006323   -90.62   0.000    -.0585707   -.0560294
  _SstaXgro_20_5 |   .0069048   .0002487    27.76   0.000      .006405    .0074045
  _SstaXgro_20_7 |   .0066941   .0002351    28.48   0.000     .0062218    .0071665
  _SstaXgro_20_8 |   .0043814   .0000531    82.58   0.000     .0042748    .0044881
  _SstaXgro_21_1 |   .1507958   .0009934   151.80   0.000     .1487994    .1527921
  _SstaXgro_21_2 |   .0414562    .000726    57.10   0.000     .0399972    .0429151
  _SstaXgro_21_3 |   .0911556    .000688   132.49   0.000     .0897729    .0925382
  _SstaXgro_21_4 |   .0041416   .0006361     6.51   0.000     .0028634    .0054197
  _SstaXgro_21_5 |  -.0579841    .000226  -256.59   0.000    -.0584382     -.05753
  _SstaXgro_21_7 |  -.0951369   .0002243  -424.21   0.000    -.0955876   -.0946863
  _SstaXgro_21_8 |   .0084939   .0000815   104.17   0.000       .00833    .0086577
  _SstaXgro_22_1 |   .0858651   .0070784    12.13   0.000     .0716405    .1000898
  _SstaXgro_22_2 |  -.0075207   .0046696    -1.61   0.114    -.0169046    .0018633
  _SstaXgro_22_3 |    .017847   .0058594     3.05   0.004     .0060721    .0296219
  _SstaXgro_22_4 |   .0001665   .0060352     0.03   0.978    -.0119616    .0122946
  _SstaXgro_22_5 |  -.0189596    .002726    -6.96   0.000    -.0244377   -.0134816
  _SstaXgro_22_7 |  -.1070336   .0041098   -26.04   0.000    -.1152925   -.0987746
  _SstaXgro_22_8 |  -.0365504   .0029344   -12.46   0.000    -.0424472   -.0306535
  _SstaXgro_23_1 |   .3162833   .0215246    14.69   0.000     .2730281    .3595386
  _SstaXgro_23_2 |   .1485504   .0159245     9.33   0.000      .116549    .1805518
  _SstaXgro_23_3 |   .1678153    .012922    12.99   0.000     .1418476     .193783
  _SstaXgro_23_4 |  -.1248198   .0321962    -3.88   0.000    -.1895204   -.0601191
  _SstaXgro_23_5 |   -.028801   .0026281   -10.96   0.000    -.0340825   -.0235196
  _SstaXgro_23_7 |   .0192027   .0024982     7.69   0.000     .0141823    .0242232
  _SstaXgro_23_8 |    .043283   .0051938     8.33   0.000     .0328457    .0537202
  _SstaXgro_24_1 |   .1426717   .0007751   184.07   0.000     .1411141    .1442292
  _SstaXgro_24_2 |   .0625946    .000667    93.84   0.000     .0612542     .063935
  _SstaXgro_24_3 |    .145149   .0002184   664.60   0.000     .1447101    .1455879
  _SstaXgro_24_4 |   .0601454   .0002419   248.63   0.000     .0596592    .0606315
  _SstaXgro_24_5 |  -.0009719   .0002235    -4.35   0.000     -.001421   -.0005228
  _SstaXgro_24_7 |  -.0124829   .0001647   -75.80   0.000    -.0128138   -.0121519
  _SstaXgro_24_8 |  -.0125933   .0000743  -169.47   0.000    -.0127426    -.012444
  _SstaXgro_25_1 |   .1485784   .0011178   132.92   0.000      .146332    .1508247
  _SstaXgro_25_2 |   .0233877   .0008195    28.54   0.000     .0217408    .0250346
  _SstaXgro_25_3 |   .0557397   .0008264    67.45   0.000     .0540791    .0574004
  _SstaXgro_25_4 |    .018118   .0006614    27.39   0.000     .0167888    .0194473
  _SstaXgro_25_5 |  -.0280654   .0001174  -239.01   0.000    -.0283013   -.0278294
  _SstaXgro_25_7 |    .011952   .0001215    98.36   0.000     .0117078    .0121962
  _SstaXgro_25_8 |     .02573   .0000831   309.72   0.000     .0255631     .025897
  _SstaXgro_26_1 |   .0360708   .0003687    97.82   0.000     .0353298    .0368118
  _SstaXgro_26_2 |  -.0022956   .0003072    -7.47   0.000     -.002913   -.0016782
  _SstaXgro_26_3 |   .0086212   .0002375    36.29   0.000     .0081439    .0090986
  _SstaXgro_26_4 |  -.0188605   .0001095  -172.18   0.000    -.0190806   -.0186403
  _SstaXgro_26_5 |  -.0292491   .0000979  -298.88   0.000    -.0294458   -.0290525
  _SstaXgro_26_7 |  -.0295612   .0001224  -241.43   0.000    -.0298073   -.0293152
  _SstaXgro_26_8 |   .0014001   .0000674    20.77   0.000     .0012646    .0015355
  _SstaXgro_27_1 |   .1524812   .0359769     4.24   0.000     .0801829    .2247794
  _SstaXgro_27_2 |   .0464046   .0248759     1.87   0.068    -.0035853    .0963946
  _SstaXgro_27_3 |  -.0199624    .016477    -1.21   0.232    -.0530742    .0131494
  _SstaXgro_27_4 |  -.0611589   .0375146    -1.63   0.109    -.1365473    .0142295
  _SstaXgro_27_5 |  -.0057013   .0049772    -1.15   0.258    -.0157033    .0043008
  _SstaXgro_27_7 |   .0772231   .0046191    16.72   0.000     .0679406    .0865056
  _SstaXgro_27_8 |   .0313799   .0105448     2.98   0.005     .0101893    .0525705
  _SstaXgro_28_1 |     .09364   .0107607     8.70   0.000     .0720155    .1152644
  _SstaXgro_28_2 |   .0170842   .0072968     2.34   0.023     .0024207    .0317478
  _SstaXgro_28_3 |   .0363102   .0091112     3.99   0.000     .0180006    .0546198
  _SstaXgro_28_4 |  -.0087663    .008949    -0.98   0.332      -.02675    .0092175
  _SstaXgro_28_5 |  -.0061261   .0044202    -1.39   0.172    -.0150089    .0027567
  _SstaXgro_28_7 |  -.0999431   .0066821   -14.96   0.000    -.1133712    -.086515
  _SstaXgro_28_8 |  -.0383002   .0046948    -8.16   0.000    -.0477346   -.0288657
  _SstaXgro_29_1 |   .1114443    .000694   160.57   0.000     .1100495     .112839
  _SstaXgro_29_2 |   .0671655   .0003878   173.22   0.000     .0663863    .0679447
  _SstaXgro_29_3 |   .1218448   .0006003   202.98   0.000     .1206385    .1230511
  _SstaXgro_29_4 |   .0255315   .0004248    60.11   0.000     .0246779    .0263851
  _SstaXgro_29_5 |  -.0036709   .0001285   -28.56   0.000    -.0039292   -.0034126
  _SstaXgro_29_7 |  -.0008765   .0001587    -5.52   0.000    -.0011955   -.0005575
  _SstaXgro_29_8 |   .0255914    .000064   399.64   0.000     .0254627      .02572
  _SstaXgro_30_1 |   .1364196   .0055869    24.42   0.000     .1251923     .147647
  _SstaXgro_30_2 |   .2053214   .0150837    13.61   0.000     .1750095    .2356333
  _SstaXgro_30_3 |   .1713973   .0059972    28.58   0.000     .1593454    .1834492
  _SstaXgro_30_4 |  -.0563859   .0165598    -3.40   0.001     -.089664   -.0231078
  _SstaXgro_30_5 |  -.0057883   .0018288    -3.17   0.003    -.0094635   -.0021131
  _SstaXgro_30_7 |   .0307895   .0016715    18.42   0.000     .0274304    .0341486
  _SstaXgro_30_8 |   .0490942    .003688    13.31   0.000     .0416828    .0565056
  _SstaXgro_31_1 |   .0914895   .0005625   162.65   0.000     .0903591    .0926199
  _SstaXgro_31_2 |   .0571619   .0010384    55.05   0.000     .0550751    .0592487
  _SstaXgro_31_3 |   .0706078   .0006663   105.98   0.000     .0692689    .0719467
  _SstaXgro_31_4 |   .0027627   .0006504     4.25   0.000     .0014558    .0040696
  _SstaXgro_31_5 |   .0193072   .0000986   195.80   0.000      .019109    .0195054
  _SstaXgro_31_7 |   .0489787   .0001034   473.87   0.000      .048771    .0491864
  _SstaXgro_31_8 |   .0276827   .0000433   638.87   0.000     .0275956    .0277698
  _SstaXgro_32_1 |   .2157374   .0012341   174.82   0.000     .2132574    .2182174
  _SstaXgro_32_2 |   .0554782    .001465    37.87   0.000     .0525342    .0584222
  _SstaXgro_32_3 |   .0921613   .0014682    62.77   0.000     .0892109    .0951117
  _SstaXgro_32_4 |  -.0274537   .0008216   -33.41   0.000    -.0291049   -.0258026
  _SstaXgro_32_5 |   .0134415   .0004862    27.65   0.000     .0124645    .0144186
  _SstaXgro_32_7 |  -.0025419   .0005759    -4.41   0.000    -.0036992   -.0013846
  _SstaXgro_32_8 |   -.026942   .0002294  -117.46   0.000     -.027403   -.0264811
  _SstaXgro_33_1 |   .0670119   .0009318    71.91   0.000     .0651394    .0688845
  _SstaXgro_33_2 |   .1101433   .0012941    85.11   0.000     .1075426    .1127439
  _SstaXgro_33_3 |   .0373836   .0019265    19.40   0.000     .0335122     .041255
  _SstaXgro_33_4 |  -.1014016   .0017892   -56.67   0.000    -.1049971    -.097806
  _SstaXgro_33_5 |   .0154672   .0004332    35.71   0.000     .0145967    .0163377
  _SstaXgro_33_7 |   .0283027    .000377    75.07   0.000      .027545    .0290604
  _SstaXgro_33_8 |   .0045444   .0000941    48.30   0.000     .0043553    .0047335
  _SstaXgro_34_1 |   .1361926   .0005138   265.08   0.000     .1351601    .1372251
  _SstaXgro_34_2 |   .0543544   .0004416   123.09   0.000      .053467    .0552417
  _SstaXgro_34_3 |   .1328797   .0002956   449.52   0.000     .1322857    .1334738
  _SstaXgro_34_4 |   .0060586   .0004755    12.74   0.000     .0051031    .0070142
  _SstaXgro_34_5 |    .015803   .0001345   117.45   0.000     .0155326    .0160733
  _SstaXgro_34_7 |  -.0197637   .0000842  -234.70   0.000    -.0199329   -.0195944
  _SstaXgro_34_8 |  -.0293654   .0000764  -384.26   0.000     -.029519   -.0292118
  _SstaXgro_35_1 |     .07501   .0017784    42.18   0.000     .0714362    .0785839
  _SstaXgro_35_2 |    .051822   .0008765    59.12   0.000     .0500606    .0535835
  _SstaXgro_35_3 |   .1113299   .0015921    69.92   0.000     .1081304    .1145295
  _SstaXgro_35_4 |  -.0076093   .0003312   -22.97   0.000    -.0082749   -.0069437
  _SstaXgro_35_5 |  -.0455324   .0006734   -67.62   0.000    -.0468856   -.0441791
  _SstaXgro_35_7 |  -.0598027    .000647   -92.42   0.000     -.061103   -.0585024
  _SstaXgro_35_8 |  -.0029858   .0000708   -42.20   0.000     -.003128   -.0028436
  _SstaXgro_36_1 |   .0846161   .0003264   259.21   0.000     .0839601    .0852721
  _SstaXgro_36_2 |    .017728   .0006741    26.30   0.000     .0163734    .0190827
  _SstaXgro_36_3 |    .059837   .0003538   169.11   0.000      .059126    .0605481
  _SstaXgro_36_4 |  -.0106027   .0002596   -40.84   0.000    -.0111244   -.0100809
  _SstaXgro_36_5 |  -.0092598   .0002225   -41.61   0.000     -.009707   -.0088126
  _SstaXgro_36_7 |   -.049442   .0002208  -223.87   0.000    -.0498858   -.0489982
  _SstaXgro_36_8 |    .002123   .0000615    34.50   0.000     .0019993    .0022467
  _SstaXgro_37_1 |   .1755855   .0005017   349.97   0.000     .1745773    .1765938
  _SstaXgro_37_2 |   .0469985   .0005783    81.27   0.000     .0458363    .0481606
  _SstaXgro_37_3 |   .1074375   .0005136   209.20   0.000     .1064054    .1084696
  _SstaXgro_37_4 |   .0170662   .0004945    34.51   0.000     .0160726    .0180599
  _SstaXgro_37_5 |  -.0017384   .0001773    -9.81   0.000    -.0020947   -.0013821
  _SstaXgro_37_7 |  -.0377913   .0002114  -178.76   0.000    -.0382161   -.0373664
  _SstaXgro_37_8 |  -.0227307   .0001305  -174.22   0.000    -.0229929   -.0224685
  _SstaXgro_38_1 |   .2837722   .0029924    94.83   0.000     .2777589    .2897856
  _SstaXgro_38_2 |   .1702898   .0026164    65.09   0.000      .165032    .1755477
  _SstaXgro_38_3 |   .0785325    .001852    42.40   0.000     .0748108    .0822542
  _SstaXgro_38_4 |  -.0633608   .0012575   -50.39   0.000    -.0658879   -.0608337
  _SstaXgro_38_5 |  -.0000149   .0001296    -0.11   0.909    -.0002754    .0002456
  _SstaXgro_38_7 |   .0647053   .0002822   229.31   0.000     .0641382    .0652723
  _SstaXgro_38_8 |   .0568364   .0000363  1567.39   0.000     .0567636    .0569093
  _SstaXgro_39_1 |    .104413   .0087027    12.00   0.000     .0869243    .1219016
  _SstaXgro_39_2 |   .0119932   .0062527     1.92   0.061     -.000572    .0245584
  _SstaXgro_39_3 |   .0455334    .007815     5.83   0.000     .0298286    .0612383
  _SstaXgro_39_4 |   .0093092   .0073799     1.26   0.213    -.0055214    .0241397
  _SstaXgro_39_5 |  -.0164742   .0036305    -4.54   0.000      -.02377   -.0091784
  _SstaXgro_39_7 |  -.0316828   .0054736    -5.79   0.000    -.0426823   -.0206832
  _SstaXgro_39_8 |   .0036736   .0038881     0.94   0.349    -.0041398     .011487
  _SstaXgro_40_1 |   .0888919   .0220506     4.03   0.000     .0445796    .1332042
  _SstaXgro_40_2 |   .0172617    .018168     0.95   0.347    -.0192483    .0537717
  _SstaXgro_40_3 |   .0261593   .0110006     2.38   0.021     .0040528    .0482658
  _SstaXgro_40_4 |  -.0260415   .0261546    -1.00   0.324    -.0786011    .0265182
  _SstaXgro_40_5 |  -.0140588   .0034374    -4.09   0.000    -.0209665   -.0071512
  _SstaXgro_40_7 |   -.046627   .0031407   -14.85   0.000    -.0529384   -.0403155
  _SstaXgro_40_8 |  -.0283432   .0072161    -3.93   0.000    -.0428444   -.0138419
  _SstaXgro_41_1 |    .122203   .0019942    61.28   0.000     .1181956    .1262104
  _SstaXgro_41_2 |    .038586   .0007957    48.50   0.000     .0369871     .040185
  _SstaXgro_41_3 |   .1100436    .001052   104.60   0.000     .1079295    .1121578
  _SstaXgro_41_4 |  -.1305122   .0004115  -317.18   0.000    -.1313391   -.1296853
  _SstaXgro_41_5 |  -.0070446   .0006637   -10.61   0.000    -.0083783   -.0057109
  _SstaXgro_41_7 |  -.0178765   .0005788   -30.88   0.000    -.0190397   -.0167134
  _SstaXgro_41_8 |   .0060512   .0000691    87.52   0.000     .0059123    .0061902
  _SstaXgro_42_1 |   .0395046   .0003423   115.41   0.000     .0388167    .0401924
  _SstaXgro_42_2 |   .0251059   .0002151   116.71   0.000     .0246736    .0255382
  _SstaXgro_42_3 |   .0511449   .0004658   109.81   0.000     .0502089    .0520809
  _SstaXgro_42_4 |   .0047911    .000403    11.89   0.000     .0039813    .0056009
  _SstaXgro_42_5 |   .0083583   .0001347    62.04   0.000     .0080876    .0086291
  _SstaXgro_42_7 |  -.0105262   .0002218   -47.46   0.000    -.0109719   -.0100805
  _SstaXgro_42_8 |  -.0005794   .0001062    -5.46   0.000    -.0007928    -.000366
  _SstaXgro_44_1 |   .1825841   .0191101     9.55   0.000     .1441811    .2209872
  _SstaXgro_44_2 |   .0606809   .0130736     4.64   0.000     .0344085    .0869532
  _SstaXgro_44_3 |   .1033466   .0086137    12.00   0.000     .0860368    .1206564
  _SstaXgro_44_4 |  -.0350262   .0237262    -1.48   0.146    -.0827059    .0126535
  _SstaXgro_44_5 |  -.0470363   .0021742   -21.63   0.000    -.0514054   -.0426672
  _SstaXgro_44_7 |   .0091852   .0020979     4.38   0.000     .0049694    .0134011
  _SstaXgro_44_8 |   .0286606   .0046743     6.13   0.000     .0192672     .038054
  _SstaXgro_45_1 |   .1379053   .0183684     7.51   0.000     .1009927     .174818
  _SstaXgro_45_2 |   .0395049   .0120003     3.29   0.002     .0153894    .0636204
  _SstaXgro_45_3 |   .0915611    .016496     5.55   0.000     .0584112    .1247111
  _SstaXgro_45_4 |   .0580932   .0140746     4.13   0.000     .0298092    .0863771
  _SstaXgro_45_5 |   .0116069   .0074501     1.56   0.126    -.0033646    .0265784
  _SstaXgro_45_7 |  -.0271181   .0118306    -2.29   0.026    -.0508925   -.0033436
  _SstaXgro_45_8 |  -.0164671    .007775    -2.12   0.039    -.0320915   -.0008426
  _SstaXgro_46_1 |   .3161764   .0018234   173.40   0.000     .3125121    .3198407
  _SstaXgro_46_2 |   .0928764    .000873   106.39   0.000     .0911221    .0946307
  _SstaXgro_46_3 |   .2044351   .0022322    91.58   0.000     .1999493     .208921
  _SstaXgro_46_4 |   .0645507   .0018664    34.59   0.000        .0608    .0683013
  _SstaXgro_46_5 |   .0116688   .0002095    55.69   0.000     .0112478    .0120899
  _SstaXgro_46_7 |   .0558636   .0003194   174.92   0.000     .0552218    .0565054
  _SstaXgro_46_8 |   .0466162   .0000893   521.97   0.000     .0464367    .0467957
  _SstaXgro_47_1 |    .109655   .0107746    10.18   0.000     .0880026    .1313074
  _SstaXgro_47_2 |   .0870676   .0074833    11.63   0.000     .0720293    .1021059
  _SstaXgro_47_3 |   .1277425   .0091294    13.99   0.000     .1093963    .1460887
  _SstaXgro_47_4 |   .0470653   .0088414     5.32   0.000     .0292979    .0648328
  _SstaXgro_47_5 |  -.0259497   .0046034    -5.64   0.000    -.0352006   -.0166987
  _SstaXgro_47_7 |  -.0621834   .0069111    -9.00   0.000    -.0760718    -.048295
  _SstaXgro_47_8 |  -.0245577   .0049336    -4.98   0.000     -.034472   -.0146433
  _SstaXgro_48_1 |   .1285574   .0005147   249.75   0.000      .127523    .1295918
  _SstaXgro_48_2 |    .057753   .0005008   115.32   0.000     .0567466    .0587594
  _SstaXgro_48_3 |    .116459   .0004606   252.86   0.000     .1155335    .1173845
  _SstaXgro_48_4 |   .0133995   .0004499    29.78   0.000     .0124954    .0143035
  _SstaXgro_48_5 |   .0166408   .0003882    42.87   0.000     .0158607    .0174209
  _SstaXgro_48_7 |  -.0308517    .000378   -81.63   0.000    -.0316113   -.0300922
  _SstaXgro_48_8 |  -.0350575   .0000776  -451.73   0.000    -.0352134   -.0349015
  _SstaXgro_49_1 |   .2769018   .0119803    23.11   0.000     .2528265    .3009771
  _SstaXgro_49_2 |   .0658051   .0075798     8.68   0.000     .0505728    .0810373
  _SstaXgro_49_3 |    .190166   .0103354    18.40   0.000     .1693962    .2109358
  _SstaXgro_49_4 |   .0149781   .0091697     1.63   0.109     -.003449    .0334052
  _SstaXgro_49_5 |   .0235218   .0042382     5.55   0.000     .0150048    .0320389
  _SstaXgro_49_7 |  -.0008982   .0062464    -0.14   0.886    -.0134507    .0116544
  _SstaXgro_49_8 |  -.0798145   .0042426   -18.81   0.000    -.0883404   -.0712886
  _SstaXgro_50_1 |   .1567516   .0330335     4.75   0.000     .0903684    .2231348
  _SstaXgro_50_2 |   .1496594   .0172155     8.69   0.000     .1150636    .1842553
  _SstaXgro_50_3 |  -.0784887    .020774    -3.78   0.000    -.1202357   -.0367417
  _SstaXgro_50_4 |  -.1150778   .0242375    -4.75   0.000    -.1637849   -.0663707
  _SstaXgro_50_5 |  -.0000208   .0025792    -0.01   0.994    -.0052039    .0051624
  _SstaXgro_50_7 |   .0538652   .0023726    22.70   0.000     .0490973    .0586332
  _SstaXgro_50_8 |   .0448172   .0057046     7.86   0.000     .0333533     .056281
  _SstaXgro_51_1 |   .2046482   .0002545   804.23   0.000     .2041369    .2051596
  _SstaXgro_51_2 |   .0881817   .0003484   253.11   0.000     .0874816    .0888819
  _SstaXgro_51_3 |   .1598835   .0003904   409.50   0.000     .1590988    .1606681
  _SstaXgro_51_4 |   .0374736   .0004605    81.37   0.000     .0365481     .038399
  _SstaXgro_51_5 |   .0129618   .0002456    52.77   0.000     .0124682    .0134554
  _SstaXgro_51_7 |  -.0239688   .0001446  -165.71   0.000    -.0242595   -.0236781
  _SstaXgro_51_8 |  -.0190288   .0000856  -222.24   0.000    -.0192008   -.0188567
  _SstaXgro_53_1 |   .0959264   .0011581    82.83   0.000     .0935992    .0982536
  _SstaXgro_53_2 |    .048809   .0007744    63.03   0.000     .0472527    .0503652
  _SstaXgro_53_3 |   .1358629   .0018264    74.39   0.000     .1321926    .1395332
  _SstaXgro_53_4 |   .0251687   .0005214    48.27   0.000     .0241209    .0262164
  _SstaXgro_53_5 |   -.011609   .0006442   -18.02   0.000    -.0129036   -.0103144
  _SstaXgro_53_7 |  -.0260494   .0007685   -33.90   0.000    -.0275937   -.0245051
  _SstaXgro_53_8 |  -.0136723   .0000574  -238.12   0.000    -.0137877   -.0135569
  _SstaXgro_54_1 |   .0554765   .0006587    84.22   0.000     .0541528    .0568002
  _SstaXgro_54_2 |   .0528131   .0015784    33.46   0.000     .0496412     .055985
  _SstaXgro_54_3 |     .07524   .0005316   141.52   0.000     .0741716    .0763084
  _SstaXgro_54_4 |  -.0241691   .0009149   -26.42   0.000    -.0260077   -.0223306
  _SstaXgro_54_5 |  -.0872501    .000323  -270.16   0.000    -.0878991   -.0866011
  _SstaXgro_54_7 |  -.1414095   .0001839  -768.95   0.000    -.1417791   -.1410399
  _SstaXgro_54_8 |   .0268558   .0000832   322.63   0.000     .0266885     .027023
  _SstaXgro_55_1 |   .0364332   .0008806    41.37   0.000     .0346635    .0382028
  _SstaXgro_55_2 |  -.0043296   .0001779   -24.33   0.000    -.0046872    -.003972
  _SstaXgro_55_3 |   .0697243   .0005676   122.83   0.000     .0685836     .070865
  _SstaXgro_55_4 |  -.0306557   .0005402   -56.75   0.000    -.0317413   -.0295702
  _SstaXgro_55_5 |   .0235714    .000103   228.87   0.000     .0233644    .0237783
  _SstaXgro_55_7 |   .0808319   .0001757   460.01   0.000     .0804787     .081185
  _SstaXgro_55_8 |   .0475069   .0000587   810.00   0.000     .0473891    .0476248
  _SstaXgro_56_1 |   .1995086   .0008413   237.13   0.000     .1978178    .2011993
  _SstaXgro_56_2 |   .1326809   .0009818   135.14   0.000     .1307079    .1346539
  _SstaXgro_56_3 |   .1686441   .0022542    74.81   0.000      .164114    .1731741
  _SstaXgro_56_4 |   .0123531   .0007854    15.73   0.000     .0107747    .0139314
  _SstaXgro_56_5 |   .0082094   .0004606    17.82   0.000     .0072838     .009135
  _SstaXgro_56_7 |  -.0173707   .0004749   -36.58   0.000    -.0183251   -.0164164
  _SstaXgro_56_8 |  -.0089098    .000228   -39.07   0.000    -.0093681   -.0084515
    _SstaXttre_1 |   .0112554   .0038034     2.96   0.005     .0036121    .0188987
    _SstaXttre_2 |  -.0129149   .0083028    -1.56   0.126       -.0296    .0037702
    _SstaXttre_4 |   .0157827   .0038925     4.05   0.000     .0079605    .0236049
    _SstaXttre_5 |  -.0202266   .0056761    -3.56   0.001    -.0316331   -.0088201
    _SstaXttre_6 |   .0239514   .0061302     3.91   0.000     .0116323    .0362705
    _SstaXttre_8 |  -.0307587   .0051748    -5.94   0.000    -.0411579   -.0203595
    _SstaXttre_9 |  -.0326797   .0053282    -6.13   0.000    -.0433871   -.0219722
   _SstaXttre_10 |    .000844   .0033102     0.25   0.800     -.005808    .0074961
   _SstaXttre_12 |  -.0176455   .0041961    -4.21   0.000    -.0260779   -.0092131
   _SstaXttre_13 |  -.0187159   .0036055    -5.19   0.000    -.0259614   -.0114704
   _SstaXttre_15 |   .0156243    .007944     1.97   0.055    -.0003397    .0315884
   _SstaXttre_16 |  -.0281146    .006179    -4.55   0.000    -.0405317   -.0156974
   _SstaXttre_18 |   .0031904   .0040072     0.80   0.430    -.0048623    .0112431
   _SstaXttre_19 |   .0061692   .0039347     1.57   0.123     -.001738    .0140763
   _SstaXttre_20 |  -.0118864   .0036681    -3.24   0.002    -.0192577    -.004515
   _SstaXttre_21 |  -.0803823   .0037421   -21.48   0.000    -.0879024   -.0728623
   _SstaXttre_22 |   .0242743   .0031458     7.72   0.000     .0179525     .030596
   _SstaXttre_23 |    .011034   .0111992     0.99   0.329    -.0114716    .0335395
   _SstaXttre_24 |  -.0419726   .0020757   -20.22   0.000     -.046144   -.0378013
   _SstaXttre_25 |  -.0116631   .0039853    -2.93   0.005    -.0196719   -.0036543
   _SstaXttre_26 |  -.0105145   .0038206    -2.75   0.008    -.0181922   -.0028367
   _SstaXttre_27 |  -.0096575   .0111886    -0.86   0.392    -.0321419    .0128268
   _SstaXttre_28 |  -.0607562   .0068945    -8.81   0.000    -.0746113   -.0469011
   _SstaXttre_29 |  -.0595922   .0043407   -13.73   0.000    -.0683152   -.0508692
   _SstaXttre_30 |    -.03689   .0042726    -8.63   0.000    -.0454761   -.0283039
   _SstaXttre_31 |  -.0253201   .0037048    -6.83   0.000    -.0327651   -.0178751
   _SstaXttre_32 |  -.0375035   .0045814    -8.19   0.000    -.0467102   -.0282967
   _SstaXttre_33 |  -.0820173   .0037704   -21.75   0.000    -.0895942   -.0744404
   _SstaXttre_34 |   .0082851    .003342     2.48   0.017     .0015691     .015001
   _SstaXttre_35 |  -.0712678   .0047603   -14.97   0.000    -.0808339   -.0617016
   _SstaXttre_36 |  -.0103701   .0028347    -3.66   0.001    -.0160668   -.0046735
   _SstaXttre_37 |   .0149186   .0022689     6.58   0.000      .010359    .0194782
   _SstaXttre_38 |  -.0192773   .0055134    -3.50   0.001    -.0303568   -.0081978
   _SstaXttre_39 |  -.0465976   .0042374   -11.00   0.000    -.0551129   -.0380823
   _SstaXttre_40 |   -.027856   .0071598    -3.89   0.000    -.0422441    -.013468
   _SstaXttre_41 |   .0185674   .0063137     2.94   0.005     .0058795    .0312554
   _SstaXttre_42 |  -.0152582   .0022675    -6.73   0.000    -.0198149   -.0107015
   _SstaXttre_44 |   .0325627   .0074705     4.36   0.000     .0175502    .0475753
   _SstaXttre_45 |  -.0244167   .0040449    -6.04   0.000    -.0325452   -.0162882
   _SstaXttre_46 |  -.0194567   .0046559    -4.18   0.000    -.0288132   -.0101002
   _SstaXttre_47 |   .0251106   .0057806     4.34   0.000     .0134942    .0367271
   _SstaXttre_48 |    .020544   .0083603     2.46   0.018     .0037433    .0373446
   _SstaXttre_49 |   .0172715    .005471     3.16   0.003     .0062771     .028266
   _SstaXttre_50 |  -.0242067   .0089721    -2.70   0.010    -.0422368   -.0061766
   _SstaXttre_51 |  -.0223121   .0033702    -6.62   0.000    -.0290848   -.0155394
   _SstaXttre_53 |  -.0380046   .0054114    -7.02   0.000    -.0488791     -.02713
   _SstaXttre_54 |  -.0894164   .0040636   -22.00   0.000    -.0975825   -.0812504
   _SstaXttre_55 |  -.0205568   .0041313    -4.98   0.000    -.0288591   -.0122546
   _SstaXttre_56 |  -.0415363   .0048759    -8.52   0.000    -.0513348   -.0317377
    _SstaXttrea1 |  -.0005988   .0001921    -3.12   0.003    -.0009848   -.0002127
    _SstaXttrea2 |   .0006674   .0004556     1.46   0.149    -.0002482     .001583
    _SstaXttrea4 |  -.0008543   .0001768    -4.83   0.000    -.0012096    -.000499
    _SstaXttrea5 |    .001006   .0003048     3.30   0.002     .0003935    .0016185
    _SstaXttrea6 |  -.0016273   .0003237    -5.03   0.000    -.0022777   -.0009768
    _SstaXttrea8 |   .0017291   .0002814     6.14   0.000     .0011636    .0022946
    _SstaXttrea9 |   .0012647   .0002807     4.50   0.000     .0007005    .0018289
   _SstaXttrea10 |   -.000081   .0002208    -0.37   0.715    -.0005246    .0003627
   _SstaXttrea12 |   .0004758   .0002392     1.99   0.052    -4.84e-06    .0009564
   _SstaXttrea13 |   .0008377   .0001914     4.38   0.000      .000453    .0012223
   _SstaXttrea15 |  -.0007532   .0004016    -1.88   0.067    -.0015602    .0000539
   _SstaXttrea16 |   .0017285   .0003394     5.09   0.000     .0010464    .0024105
   _SstaXttrea18 |  -.0003153   .0001995    -1.58   0.121    -.0007162    .0000857
   _SstaXttrea19 |  -.0001524     .00021    -0.73   0.472    -.0005743    .0002696
   _SstaXttrea20 |   .0007409    .000204     3.63   0.001     .0003309    .0011509
   _SstaXttrea21 |   .0041065    .000196    20.95   0.000     .0037126    .0045003
   _SstaXttrea22 |  -.0010395   .0001855    -5.60   0.000    -.0014122   -.0006667
   _SstaXttrea23 |  -.0007891   .0006248    -1.26   0.213    -.0020447    .0004665
   _SstaXttrea24 |   .0020607   .0001011    20.39   0.000     .0018576    .0022639
   _SstaXttrea25 |   .0002713   .0002162     1.25   0.216    -.0001632    .0007058
   _SstaXttrea26 |   .0005353   .0001928     2.78   0.008     .0001479    .0009226
   _SstaXttrea27 |   .0003866   .0005128     0.75   0.455     -.000644    .0014172
   _SstaXttrea28 |   .0030481   .0004296     7.10   0.000     .0021849    .0039113
   _SstaXttrea29 |   .0033989   .0002536    13.40   0.000     .0028893    .0039084
   _SstaXttrea30 |   .0017341   .0002213     7.84   0.000     .0012894    .0021789
   _SstaXttrea31 |    .001518   .0001944     7.81   0.000     .0011274    .0019086
   _SstaXttrea32 |   .0017115   .0002424     7.06   0.000     .0012245    .0021986
   _SstaXttrea33 |   .0041059   .0001786    22.99   0.000      .003747    .0044648
   _SstaXttrea34 |  -.0006397   .0001668    -3.83   0.000     -.000975   -.0003044
   _SstaXttrea35 |   .0041363   .0002438    16.97   0.000     .0036465    .0046261
   _SstaXttrea36 |   .0003833   .0001423     2.69   0.010     .0000974    .0006692
   _SstaXttrea37 |   -.000931   .0001103    -8.44   0.000    -.0011527   -.0007094
   _SstaXttrea38 |   .0012395   .0002974     4.17   0.000     .0006418    .0018372
   _SstaXttrea39 |   .0023889   .0002373    10.07   0.000     .0019122    .0028657
   _SstaXttrea40 |   .0015334   .0004332     3.54   0.001     .0006628     .002404
   _SstaXttrea41 |  -.0008182   .0003272    -2.50   0.016    -.0014758   -.0001606
   _SstaXttrea42 |   .0007698   .0001101     6.99   0.000     .0005486    .0009911
   _SstaXttrea44 |   -.001978   .0004115    -4.81   0.000     -.002805   -.0011511
   _SstaXttrea45 |   .0010103   .0002054     4.92   0.000     .0005975    .0014231
   _SstaXttrea46 |    .001424   .0002535     5.62   0.000     .0009146    .0019334
   _SstaXttrea47 |  -.0013645   .0003274    -4.17   0.000    -.0020225   -.0007065
   _SstaXttrea48 |  -.0009851   .0003235    -3.05   0.004    -.0016351   -.0003351
   _SstaXttrea49 |  -.0006076   .0002905    -2.09   0.042    -.0011913   -.0000239
   _SstaXttrea50 |    .001061   .0004704     2.26   0.029     .0001158    .0020063
   _SstaXttrea51 |   .0008796   .0001725     5.10   0.000      .000533    .0012263
   _SstaXttrea53 |   .0019325    .000291     6.64   0.000     .0013478    .0025172
   _SstaXttrea54 |    .004574   .0002175    21.03   0.000      .004137    .0050111
   _SstaXttrea55 |   .0012198   .0002498     4.88   0.000     .0007178    .0017219
   _SstaXttrea56 |   .0022705   .0002506     9.06   0.000     .0017669    .0027742
    _SstaXttreb1 |   9.59e-06   2.99e-06     3.21   0.002     3.58e-06    .0000156
    _SstaXttreb2 |  -9.39e-06   7.73e-06    -1.21   0.230    -.0000249    6.14e-06
    _SstaXttreb4 |   .0000136   2.57e-06     5.27   0.000     8.38e-06    .0000187
    _SstaXttreb5 |  -.0000161   4.94e-06    -3.25   0.002     -.000026   -6.14e-06
    _SstaXttreb6 |   .0000327   5.40e-06     6.06   0.000     .0000219    .0000436
    _SstaXttreb8 |  -.0000286   4.61e-06    -6.21   0.000    -.0000379   -.0000193
    _SstaXttreb9 |  -.0000142   4.96e-06    -2.86   0.006    -.0000241   -4.20e-06
   _SstaXttreb10 |   2.34e-06   4.23e-06     0.55   0.583    -6.16e-06    .0000108
   _SstaXttreb12 |  -1.47e-06   4.13e-06    -0.36   0.723    -9.76e-06    6.82e-06
   _SstaXttreb13 |  -.0000111   3.16e-06    -3.50   0.001    -.0000174   -4.73e-06
   _SstaXttreb15 |    .000013   6.43e-06     2.02   0.049     5.40e-08    .0000259
   _SstaXttreb16 |  -.0000307   5.57e-06    -5.51   0.000    -.0000419   -.0000195
   _SstaXttreb18 |   7.61e-06   2.95e-06     2.58   0.013     1.67e-06    .0000135
   _SstaXttreb19 |   1.25e-06   3.55e-06     0.35   0.726    -5.88e-06    8.38e-06
   _SstaXttreb20 |  -.0000131   3.57e-06    -3.66   0.001    -.0000202   -5.89e-06
   _SstaXttreb21 |  -.0000658   3.02e-06   -21.81   0.000    -.0000719   -.0000598
   _SstaXttreb22 |   .0000153   3.18e-06     4.81   0.000     8.90e-06    .0000217
   _SstaXttreb23 |    .000017   .0000106     1.61   0.113    -4.20e-06    .0000383
   _SstaXttreb24 |  -.0000327   1.56e-06   -21.00   0.000    -.0000358   -.0000296
   _SstaXttreb25 |  -4.56e-07   3.71e-06    -0.12   0.903    -7.92e-06    7.01e-06
   _SstaXttreb26 |  -7.70e-06   3.06e-06    -2.52   0.015    -.0000138   -1.56e-06
   _SstaXttreb27 |  -4.16e-06   7.59e-06    -0.55   0.586    -.0000194    .0000111
   _SstaXttreb28 |  -.0000471   7.64e-06    -6.17   0.000    -.0000625   -.0000318
   _SstaXttreb29 |  -.0000588   4.38e-06   -13.43   0.000    -.0000676     -.00005
   _SstaXttreb30 |   -.000025   3.53e-06    -7.10   0.000    -.0000321    -.000018
   _SstaXttreb31 |  -.0000266   3.27e-06    -8.14   0.000    -.0000332   -.0000201
   _SstaXttreb32 |  -.0000232   4.10e-06    -5.67   0.000    -.0000315    -.000015
   _SstaXttreb33 |  -.0000644   2.72e-06   -23.68   0.000    -.0000698   -.0000589
   _SstaXttreb34 |   .0000136   2.60e-06     5.21   0.000     8.33e-06    .0000188
   _SstaXttreb35 |  -.0000743   3.84e-06   -19.37   0.000     -.000082   -.0000666
   _SstaXttreb36 |  -3.83e-06   2.13e-06    -1.79   0.079    -8.11e-06    4.59e-07
   _SstaXttreb37 |   .0000177   1.74e-06    10.19   0.000     .0000142    .0000212
   _SstaXttreb38 |  -.0000212   5.07e-06    -4.18   0.000    -.0000314    -.000011
   _SstaXttreb39 |  -.0000377   4.01e-06    -9.40   0.000    -.0000457   -.0000296
   _SstaXttreb40 |  -.0000248   7.64e-06    -3.24   0.002    -.0000401   -9.42e-06
   _SstaXttreb41 |   .0000116   5.28e-06     2.20   0.033     1.01e-06    .0000222
   _SstaXttreb42 |  -.0000106   1.71e-06    -6.21   0.000     -.000014   -7.18e-06
   _SstaXttreb44 |   .0000372   6.78e-06     5.49   0.000     .0000236    .0000508
   _SstaXttreb45 |  -.0000124   3.26e-06    -3.81   0.000     -.000019   -5.87e-06
   _SstaXttreb46 |  -.0000269   4.20e-06    -6.40   0.000    -.0000353   -.0000185
   _SstaXttreb47 |   .0000241   5.51e-06     4.38   0.000     .0000131    .0000352
   _SstaXttreb48 |   .0000154   4.01e-06     3.86   0.000     7.40e-06    .0000235
   _SstaXttreb49 |   5.33e-06   4.73e-06     1.13   0.265    -4.17e-06    .0000148
   _SstaXttreb50 |   -.000014   7.40e-06    -1.89   0.065    -.0000288    9.12e-07
   _SstaXttreb51 |  -.0000103   2.77e-06    -3.72   0.001    -.0000159   -4.74e-06
   _SstaXttreb53 |  -.0000302   4.89e-06    -6.17   0.000      -.00004   -.0000204
   _SstaXttreb54 |  -.0000735   3.43e-06   -21.45   0.000    -.0000804   -.0000666
   _SstaXttreb55 |  -.0000206   4.41e-06    -4.68   0.000    -.0000295   -.0000118
   _SstaXttreb56 |  -.0000367   4.00e-06    -9.18   0.000    -.0000448   -.0000287
   _TgroXttren_1 |  -.0857387   .0227765    -3.76   0.000    -.1315098   -.0399676
   _TgroXttren_2 |   -.030171   .0205332    -1.47   0.148    -.0714341    .0110921
   _TgroXttren_3 |  -.0243548   .0194676    -1.25   0.217    -.0634764    .0147669
   _TgroXttren_4 |   -.006398   .0164626    -0.39   0.699    -.0394809    .0266849
   _TgroXttren_5 |  -.0253217   .0119018    -2.13   0.038    -.0492394   -.0014041
   _TgroXttren_7 |   .0074307   .0087748     0.85   0.401     -.010203    .0250644
   _TgroXttren_8 |   .0443887   .0084166     5.27   0.000      .027475    .0613025
   _TgroXttrena1 |   .0046773    .001168     4.00   0.000     .0023301    .0070246
   _TgroXttrena2 |    .001659   .0010568     1.57   0.123    -.0004647    .0037828
   _TgroXttrena3 |   .0019686   .0009892     1.99   0.052    -.0000192    .0039565
   _TgroXttrena4 |   .0005963   .0008349     0.71   0.479    -.0010816    .0022741
   _TgroXttrena5 |   .0014381   .0006387     2.25   0.029     .0001546    .0027216
   _TgroXttrena7 |   -.000061   .0004526    -0.13   0.893    -.0009706    .0008485
   _TgroXttrena8 |  -.0023227    .000423    -5.49   0.000    -.0031729   -.0014726
   _TgroXttrenb1 |  -.0000811    .000019    -4.26   0.000    -.0001194   -.0000429
   _TgroXttrenb2 |  -.0000289   .0000172    -1.68   0.099    -.0000634    5.66e-06
   _TgroXttrenb3 |  -.0000401   .0000158    -2.53   0.015    -.0000719   -8.23e-06
   _TgroXttrenb4 |  -.0000127   .0000135    -0.94   0.353    -.0000398    .0000145
   _TgroXttrenb5 |  -.0000278   .0000108    -2.57   0.013    -.0000496   -6.08e-06
   _TgroXttrenb7 |  -3.49e-06   7.41e-06    -0.47   0.640    -.0000184    .0000114
   _TgroXttrenb8 |   .0000388   6.86e-06     5.65   0.000      .000025    .0000526
           _cons |   .1329108   .0424382     3.13   0.003     .0476279    .2181936
----------------------------------------------------------------------------------

. estimates store empd ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    0.00
            Prob > F =    0.9775

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.07
            Prob > F =    0.7877

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    1.20
            Prob > F =    0.2781

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    1.35
            Prob > F =    0.2514

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    0.00
            Prob > F =    0.9498

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    0.37
            Prob > F =    0.5432

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    0.04
            Prob > F =    0.8343

. quietly reg empdhi $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdhi ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    1.43
            Prob > F =    0.2370

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.01
            Prob > F =    0.9203

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    0.02
            Prob > F =    0.8758

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    0.20
            Prob > F =    0.6577

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    0.30
            Prob > F =    0.5874

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    1.52
            Prob > F =    0.2242

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    0.08
            Prob > F =    0.7807

. quietly reg empdlg $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdlg ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =   10.25
            Prob > F =    0.0024

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.08
            Prob > F =    0.7818

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    3.55
            Prob > F =    0.0654

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    0.00
            Prob > F =    0.9641

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    0.31
            Prob > F =    0.5791

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    0.12
            Prob > F =    0.7307

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    6.73
            Prob > F =    0.0125

. * note group health coverage and pension are conditional on being asked the question ;
. quietly reg ph $controls [pw=wtsupp], cluster(statefip) ;

. estimates store ph ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    0.14
            Prob > F =    0.7068

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.50
            Prob > F =    0.4836

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    2.04
            Prob > F =    0.1600

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    0.15
            Prob > F =    0.6958

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    0.03
            Prob > F =    0.8561

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    1.37
            Prob > F =    0.2472

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    0.26
            Prob > F =    0.6130

. quietly reg lrhw $controls [pw=wtsupp] if hwagesamp==1, cluster(statefip) ;

. estimates store lrhw ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    1.58
            Prob > F =    0.2147

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.63
            Prob > F =    0.4310

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    0.21
            Prob > F =    0.6485

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    8.00
            Prob > F =    0.0068

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    1.31
            Prob > F =    0.2580

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    0.03
            Prob > F =    0.8706

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    0.08
            Prob > F =    0.7812

. ******* ESTIMATES WITH PRO AND ANTI TESTING DUMMIES ******* ;
. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) se(%7.3f) stats(N) ;

----------------------------------------------------------------
    Variable |  empd     empdhi    empdlg      ph       lrhw    
-------------+--------------------------------------------------
  _Pgroup8_1 |   0.140     0.073    -0.230     0.141    -0.585  
             |   0.139     0.113     0.118     0.145     0.148  
  _Pgroup8_2 |   0.042    -0.034     0.195    -0.001     0.009  
             |   0.125     0.172     0.191     0.138     0.178  
  _Pgroup8_3 |  -0.344     0.167     0.174    -0.196    -0.607  
             |   0.120     0.134     0.123     0.131     0.189  
  _Pgroup8_4 |  -0.123     0.328     0.416     0.021    -0.064  
             |   0.103     0.109     0.106     0.118     0.148  
  _Pgroup8_5 |   0.090     0.079    -0.135    -0.007    -0.197  
             |   0.069     0.073     0.069     0.070     0.067  
  _Pgroup8_7 |  -0.277     0.121    -0.119    -0.193    -0.600  
             |   0.054     0.082     0.061     0.070     0.076  
  _Pgroup8_8 |  -0.367    -0.073    -0.192    -0.269    -0.350  
             |   0.054     0.057     0.064     0.063     0.074  
 _PgroXpro_1 |  -0.005     0.010     0.041     0.023     0.008  
             |   0.019     0.019     0.012     0.012     0.016  
 _PgroXpro_2 |   0.005    -0.017     0.019     0.019    -0.003  
             |   0.012     0.029     0.015     0.013     0.015  
 _PgroXpro_3 |   0.008    -0.007     0.004     0.041    -0.003  
             |   0.017     0.022     0.012     0.011     0.016  
 _PgroXpro_4 |  -0.028    -0.003    -0.006     0.004    -0.008  
             |   0.014     0.016     0.011     0.013     0.016  
 _PgroXpro_5 |   0.002     0.015     0.010     0.019     0.009  
             |   0.007     0.010     0.004     0.005     0.008  
 _PgroXpro_7 |  -0.012    -0.005     0.002     0.006    -0.006  
             |   0.012     0.009     0.008     0.011     0.010  
 _PgroXpro_8 |   0.004    -0.005    -0.010    -0.001    -0.003  
             |   0.008     0.010     0.006     0.006     0.009  
_AgroXanti_1 |  -0.006    -0.028    -0.082     0.037    -0.069  
             |   0.041     0.030     0.038     0.036     0.063  
_AgroXanti_2 |  -0.002    -0.025     0.007     0.065     0.030  
             |   0.027     0.072     0.043     0.066     0.040  
_AgroXanti_3 |   0.036    -0.016     0.034    -0.013    -0.021  
             |   0.021     0.058     0.015     0.038     0.038  
_AgroXanti_4 |   0.022     0.020    -0.004     0.022     0.038  
             |   0.041     0.050     0.045     0.043     0.011  
_AgroXanti_5 |   0.002     0.007     0.002     0.023    -0.006  
             |   0.006     0.012     0.014     0.023     0.012  
_AgroXanti_7 |  -0.020     0.023     0.007     0.027    -0.002  
             |   0.006     0.021     0.016     0.016     0.021  
_AgroXanti_8 |   0.007     0.001     0.010     0.008    -0.008  
             |   0.012     0.020     0.007     0.018     0.015  
         pro |   0.007    -0.010     0.001    -0.010    -0.001  
             |   0.007     0.012     0.009     0.012     0.008  
        anti |   0.011    -0.002     0.011    -0.026    -0.001  
             |   0.011     0.015     0.015     0.015     0.014  
         age |   0.040     0.023    -0.003     0.047     0.090  
             |   0.001     0.001     0.001     0.001     0.002  
        age2 |  -0.000    -0.000     0.000    -0.001    -0.001  
             |   0.000     0.000     0.000     0.000     0.000  
-------------+--------------------------------------------------
           N | 1600738   1236245   1351109   1351109   1188466  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |    empd        empdhi       empdlg         ph          lrhw     
-------------+-----------------------------------------------------------------
  _Pgroup8_1 |   0.140        0.073       -0.230        0.141       -0.585***  
  _Pgroup8_2 |   0.042       -0.034        0.195       -0.001        0.009     
  _Pgroup8_3 |  -0.344**      0.167        0.174       -0.196       -0.607**   
  _Pgroup8_4 |  -0.123        0.328**      0.416***     0.021       -0.064     
  _Pgroup8_5 |   0.090        0.079       -0.135       -0.007       -0.197**   
  _Pgroup8_7 |  -0.277***     0.121       -0.119       -0.193**     -0.600***  
  _Pgroup8_8 |  -0.367***    -0.073       -0.192**     -0.269***    -0.350***  
 _PgroXpro_1 |  -0.005        0.010        0.041**      0.023        0.008     
 _PgroXpro_2 |   0.005       -0.017        0.019        0.019       -0.003     
 _PgroXpro_3 |   0.008       -0.007        0.004        0.041***    -0.003     
 _PgroXpro_4 |  -0.028       -0.003       -0.006        0.004       -0.008     
 _PgroXpro_5 |   0.002        0.015        0.010*       0.019***     0.009     
 _PgroXpro_7 |  -0.012       -0.005        0.002        0.006       -0.006     
 _PgroXpro_8 |   0.004       -0.005       -0.010       -0.001       -0.003     
_AgroXanti_1 |  -0.006       -0.028       -0.082*       0.037       -0.069     
_AgroXanti_2 |  -0.002       -0.025        0.007        0.065        0.030     
_AgroXanti_3 |   0.036       -0.016        0.034*      -0.013       -0.021     
_AgroXanti_4 |   0.022        0.020       -0.004        0.022        0.038***  
_AgroXanti_5 |   0.002        0.007        0.002        0.023       -0.006     
_AgroXanti_7 |  -0.020***     0.023        0.007        0.027       -0.002     
_AgroXanti_8 |   0.007        0.001        0.010        0.008       -0.008     
         pro |   0.007       -0.010        0.001       -0.010       -0.001     
        anti |   0.011       -0.002        0.011       -0.026       -0.001     
         age |   0.040***     0.023***    -0.003***     0.047***     0.090***  
        age2 |  -0.000***    -0.000***     0.000***    -0.001***    -0.001***  
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. log close ;
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Appendix_Tables\Appx_table_A5\basic_exclusive1990.log
  log type:  text
 closed on:   6 Mar 2020, 20:22:28
-------------------------------------------------------------------------------------------------------------------------------------------------------------
