-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_1\Table1_1997-2006.log
  log type:  text
 opened on:   6 Mar 2020, 20:30:16

. 
. cd ..
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_NSDUH/.
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_NSDUH

. 
. *use "DRUGDATA_FINAL2.dta"
. use Output/DRUGDATA_FINAL2.dta
(NSDUH 2006, Dataset 0001)

. 
. cd ../Tables/Table_1/.
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_1

. 
. /* Share of establishments with a drug testing program by industry */
. 
. sum usdrgtst2 if employed==1 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |    155,770    .4626051    .4986013          0          1

. sum usdrgtst2 if employed==1 & industry == 1 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |        678     .859882    .3473657          0          1

. sum usdrgtst2 if employed==1 & industry == 2 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |      9,155    .7243037    .4468889          0          1

. sum usdrgtst2 if employed==1 & industry == 3 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     17,821    .6855395    .4643137          0          1

. sum usdrgtst2 if employed==1 & industry == 4 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     12,344    .4353532    .4958233          0          1

. sum usdrgtst2 if employed==1 & industry == 5 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |      4,604    .6014335    .4896563          0          1

. sum usdrgtst2 if employed==1 & industry == 6 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     19,614    .4257673    .4944714          0          1

. sum usdrgtst2 if employed==1 & industry == 7 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |      8,712    .3974977    .4894086          0          1

. sum usdrgtst2 if employed==1 & industry == 8 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     56,880    .3630098    .4808719          0          1

. sum usdrgtst2 if employed==1 & industry == 9 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |      2,748    .2227074    .4161392          0          1

. sum usdrgtst2 if employed==1 & industry == 10 & age2249==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |      6,181    .6117133    .4873998          0          1

. 
. /* Share of establishments with a drug testing program by establishment size */
. bysort locsize: sum usdrgtst2 if employed==1 & age2249==1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = Less than 10 people

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     41,876    .2132248      .40959          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = 10-24 people

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     28,493    .3836381      .48628          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = 25-99 people

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     35,740    .4933128    .4999623          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = 100-499 people

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     28,745    .6630718    .4726683          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = 500 people or more

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |     20,440    .7477495    .4343149          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = 89

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = DON'T KNOW

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |        388    .4793814    .5002197          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = 96

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |          3    .6666667    .5773503          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = REFUSED

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |         59    .4915254    .5042195          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = BLANK (NO ANSWER)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |         26    .3076923    .4706787          0          1

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = LEGITIMATE SKIP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |          0

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> locsize = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   usdrgtst2 |          0


. 
. 
end of do-file

. exit, clear
