-------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_6\basic_exclusive.log
  log type:  text
 opened on:   9 Mar 2020, 09:45:27

. /*****
> 
> Uses pro- and anti-drug testing state legislation by year from IDFW documentation
> to generate D-in-D style estimates of drug testing impacts by demographic group.
> 
> Demographic groups defined in mutually exclusive way. Excludes Hispanics from sample.
> 
> Estimates baseline specs with cubics in time plus their interactions with demographics
> instead of year dummies.Adds employment growth for high testing sector industries.
> Now omits DC.
> 
> *****/
> 
> set matsize 800 ;

. set more off ;

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_March_CPS/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_March_CPS

. use Output/marcps.dta ;

. cd ../Tables/Table_6./ ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_6

. *use "/afs/crc.nd.edu/user/a/awaggone/Private/Private/Drugs_2011/_june2012/marcps.dta" ;
. *use "/afs/crc.nd.edu/user/a/awaggone/Private/Private/Drugs_2011/_june2012/marcps_test.dta" ;
. /** Construct variables for estimation **/
> 
> * Pro and anti dummies, by state-year ;
. gen pro=0 ;

. replace pro=1 if (year>=yrpro & yrpro~=0) ;
(287,572 real changes made)

. gen anti=0 ;

. replace anti=1 if (year>=yranti & yranti~=0) ;
(119,778 real changes made)

. /*
> bysort pro: tab1 yrpro yranti ;
> bysort pro: summ year ;
> bysort anti: tab1 yrpro yranti ;
> bysort anti: summ year ;
> bysort year: summ pro anti ;
> */
> 
> * Reduce education groups to 2 ;
. gen lowskill=1 if edgrp4==1 | edgrp4==2 ;
(1,354,018 missing values generated)

. replace lowskill=0 if edgrp4==3 | edgrp4==4 ;
(1,354,018 real changes made)

. gen edgrp2=. ;
(2,760,713 missing values generated)

. replace edgrp2=1 if lowskill==1 ;
(1,406,695 real changes made)

. replace edgrp2=2 if lowskill==0 ;
(1,354,018 real changes made)

. gen young=(age<=25) ;

. summ young lowskill ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       young |  2,760,713    .2112277    .4081796          0          1
    lowskill |  2,760,713    .5095405    .4999091          0          1

. gen raceeth=. ;
(2,760,713 missing values generated)

. replace raceeth=1 if black==0 & hisp==0 ;
(2,121,175 real changes made)

.  *non-Hispanic Whites ;
. replace raceeth=2 if black==1 ;
(269,164 real changes made)

.  * Blacks ;
. drop if raceeth==. ;
(370,374 observations deleted)

. gen age2=age*age ;

. /* Now create 8 mutually exclusive groups on skill-race-gender */
> 
> gen group8=. ;
(2,390,339 missing values generated)

. replace group8=1 if edgrp2==1 & raceeth==2 & female==0 ;
(71,194 real changes made)

. replace group8=2 if edgrp2==2 & raceeth==2 & female==0 ;
(44,873 real changes made)

. replace group8=3 if edgrp2==1 & raceeth==2 & female==1 ;
(88,007 real changes made)

. replace group8=4 if edgrp2==2 & raceeth==2 & female==1 ;
(65,090 real changes made)

. replace group8=5 if edgrp2==1 & raceeth==1 & female==0 ;
(480,708 real changes made)

. replace group8=6 if edgrp2==2 & raceeth==1 & female==0 ;
(554,388 real changes made)

. replace group8=7 if edgrp2==1 & raceeth==1 & female==1 ;
(505,036 real changes made)

. replace group8=8 if edgrp2==2 & raceeth==1 & female==1 ;
(581,043 real changes made)

. tab1 group8 ;

-> tabulation of group8  

     group8 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     71,194        2.98        2.98
          2 |     44,873        1.88        4.86
          3 |     88,007        3.68        8.54
          4 |     65,090        2.72       11.26
          5 |    480,708       20.11       31.37
          6 |    554,388       23.19       54.56
          7 |    505,036       21.13       75.69
          8 |    581,043       24.31      100.00
------------+-----------------------------------
      Total |  2,390,339      100.00

. char group8[omit] 6 ;

.  * Omit high skilled white men. ;
. xi, prefix(_P) i.group8*pro ;
i.group8          _Pgroup8_1-8        (naturally coded; _Pgroup8_6 omitted)
i.group8*pro      _PgroXpro_#         (coded as above)

. xi, prefix(_A) i.group8*anti ;
i.group8          _Agroup8_1-8        (naturally coded; _Agroup8_6 omitted)
i.group8*anti     _AgroXanti_#        (coded as above)

. drop _Agroup8* ;

. * Time cubics and their double interactions ;
. gen ttrend=year - 1980 ;

. sum ttrend ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ttrend |  2,390,339    15.54816    9.271415          0         30

. gen ttrend2=ttrend^2 ;

. gen ttrend3=ttrend^3 ;

. * State dummies and their interactions with demographics plus linear state trends ;
. char statefip[omit] 17 ;

.  * omit IL - set this so not omitting a pro or anti state ;
. xi, prefix(_S) i.statefip*i.group8 i.statefip*ttrend i.statefip*ttrend2 i.statefip*ttrend3 ;
i.statefip        _Sstatefip_1-56     (naturally coded; _Sstatefip_17 omitted)
i.group8          _Sgroup8_1-8        (naturally coded; _Sgroup8_6 omitted)
i.sta~p*i.gro~8   _SstaXgro_#_#       (coded as above)
i.stat~p*ttrend   _SstaXttre_#        (coded as above)
i.stat~p*ttre~2   _SstaXttrea#        (coded as above)
i.stat~p*ttre~3   _SstaXttreb#        (coded as above)

. drop _Sgroup8* ;

. xi, prefix(_T) i.group8*ttrend i.group8*ttrend2 i.group8*ttrend3 ;
i.group8          _Tgroup8_1-8        (naturally coded; _Tgroup8_6 omitted)
i.group8*ttrend   _TgroXttren_#       (coded as above)
i.group8*ttre~2   _TgroXttrena#       (coded as above)
i.group8*ttre~3   _TgroXttrenb#       (coded as above)

. drop _Tgroup8* ;

. /** Outcome variables **/
> 
> gen empdhi=1 if empd==1 & inlist(ind1,1,4,5,3,11)==1 ;
(1,888,285 missing values generated)

. replace empdhi=0 if empd==1 & inlist(ind1,1,4,5,3,11)~=1 ;
(1,317,282 real changes made)

. summ empdhi ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      empdhi |  1,819,336    .2759545    .4469941          0          1

. gen empdmid=1 if firmsizer==2 | firmsizer==3 ;
(1,991,010 missing values generated)

. replace empdmid=0 if firmsizer==1 | firmsizer==4 ;
(1,101,351 real changes made)

. gen empdlg=1 if firmsizer==4 ;
(1,722,969 missing values generated)

. replace empdlg=0 if firmsizer==1 | firmsizer==2 | firmsizer==3 ;
(833,310 real changes made)

. gen ph=. ;
(2,390,339 missing values generated)

. replace ph=1 if pensionr==1 | inclughr==1 ;
(1,372,629 real changes made)

. replace ph=0 if pensionr==0 & inclughr==0 ;
(632,872 real changes made)

. replace ph=. if pensionr==. | inclughr==. ;
(0 real changes made)

. summ empdmid empdlg ph ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     empdmid |  1,500,680    .2660987    .4419166          0          1
      empdlg |  1,500,680    .4447117     .496934          0          1
          ph |  2,005,501     .684432    .4647418          0          1

. gen lrhw=log(rhwage) ;
(508,502 missing values generated)

. /** Estimations **/
> 
> /** Main specification with DTI interactions **/
> 
> summ year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |  2,390,339    1995.548    9.271415       1980       2010

. global controls _P* pro age age2
>   eg* minwage unemploymentrate incarcr
>   tt* _S* _T* ;

. unab pvars: _P* ;

.     global outvars `pvars' pro age age2 ;

. summ $outvars year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  _Pgroup8_1 |  2,390,339    .0297841    .1699911          0          1
  _Pgroup8_2 |  2,390,339    .0187727    .1357212          0          1
  _Pgroup8_3 |  2,390,339    .0368178    .1883142          0          1
  _Pgroup8_4 |  2,390,339    .0272304    .1627543          0          1
  _Pgroup8_5 |  2,390,339    .2011045    .4008261          0          1
-------------+---------------------------------------------------------
  _Pgroup8_7 |  2,390,339    .2112822    .4082182          0          1
  _Pgroup8_8 |  2,390,339    .2430797     .428943          0          1
 _PgroXpro_1 |  2,390,339    .0051641     .071676          0          1
 _PgroXpro_2 |  2,390,339     .003269    .0570816          0          1
 _PgroXpro_3 |  2,390,339    .0059569    .0769507          0          1
-------------+---------------------------------------------------------
 _PgroXpro_4 |  2,390,339    .0052725    .0724201          0          1
 _PgroXpro_5 |  2,390,339    .0183074    .1340608          0          1
 _PgroXpro_7 |  2,390,339    .0177519    .1320483          0          1
 _PgroXpro_8 |  2,390,339    .0268585    .1616699          0          1
         pro |  2,390,339    .1060992    .3079646          0          1
-------------+---------------------------------------------------------
         age |  2,390,339    36.07595    10.56432         18         55
        age2 |  2,390,339    1413.079    771.6311        324       3025
        year |  2,390,339    1995.548    9.271415       1980       2010

. summ empd empdhi inclughr pensionr lrhw if pro==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |  2,136,271    .7613304    .4262705          0          1
      empdhi |  1,626,408    .2785015    .4482617          0          1
    inclughr |  1,795,852    .5517732    .4973125          0          1
    pensionr |  1,795,850    .5471448    .4977725          0          1
        lrhw |  1,683,231    2.473637     .787586  -8.419633   10.81632

. reg empd $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 3,854,608,510)

Linear regression                               Number of obs     =  2,355,785
                                                F(38, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0862
                                                Root MSE          =     .41061

                                  (Std. Err. adjusted for 50 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
            empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
      _Pgroup8_1 |  -.2901231   .0083233   -34.86   0.000    -.3068494   -.2733968
      _Pgroup8_2 |  -.1584396   .0102467   -15.46   0.000    -.1790312   -.1378481
      _Pgroup8_3 |  -.4623572   .0102501   -45.11   0.000    -.4829555   -.4417589
      _Pgroup8_4 |  -.1980625   .0158948   -12.46   0.000    -.2300042   -.1661208
      _Pgroup8_5 |  -.0365742   .0046438    -7.88   0.000    -.0459063   -.0272422
      _Pgroup8_7 |  -.2894416   .0060896   -47.53   0.000     -.301679   -.2772042
      _Pgroup8_8 |  -.1924104   .0046645   -41.25   0.000    -.2017841   -.1830367
     _PgroXpro_1 |  -.0052657   .0136573    -0.39   0.701    -.0327111    .0221797
     _PgroXpro_2 |   -.003356   .0107017    -0.31   0.755    -.0248619      .01815
     _PgroXpro_3 |   .0145778   .0153708     0.95   0.348     -.016311    .0454666
     _PgroXpro_4 |  -.0182879   .0123865    -1.48   0.146    -.0431795    .0066038
     _PgroXpro_5 |   .0015592   .0071906     0.22   0.829    -.0128907    .0160092
     _PgroXpro_7 |  -.0096651   .0112321    -0.86   0.394    -.0322368    .0129066
     _PgroXpro_8 |   -.001555   .0066747    -0.23   0.817    -.0149684    .0118583
             pro |   .0118894   .0064924     1.83   0.073    -.0011576    .0249363
             age |   .0389783   .0009623    40.51   0.000     .0370445    .0409121
            age2 |  -.0004869   .0000119   -40.78   0.000    -.0005109    -.000463
           eg200 |   .0052413   .0037056     1.41   0.164    -.0022054     .012688
           eg300 |  -.0436354   .0088179    -4.95   0.000    -.0613556   -.0259153
           eg400 |  -.0575813   .0161194    -3.57   0.001    -.0899744   -.0251883
           eg500 |  -.0129617   .0107644    -1.20   0.234    -.0345935    .0086702
           eg900 |   .0721911    .045395     1.59   0.118    -.0190336    .1634158
         minwage |   .0043766    .001228     3.56   0.001     .0019088    .0068444
unemploymentrate |  -.0114206   .0006463   -17.67   0.000    -.0127195   -.0101218
         incarcr |  -.4374273   1.390942    -0.31   0.754     -3.23263    2.357776
          ttrend |  -.0015382    .000748    -2.06   0.045    -.0030414   -.0000351
         ttrend2 |  -.0000122   .0000548    -0.22   0.824    -.0001224    .0000979
         ttrend3 |  -4.90e-07   1.39e-06    -0.35   0.726    -3.28e-06    2.30e-06
    _Sstatefip_1 |   .0129991    .005917     2.20   0.033     .0011084    .0248898
    _Sstatefip_2 |  -.0196324    .005813    -3.38   0.001    -.0313141   -.0079508
    _Sstatefip_4 |  -.0013799   .0048002    -0.29   0.775    -.0110262    .0082665
    _Sstatefip_5 |   -.004876   .0029847    -1.63   0.109     -.010874     .001122
    _Sstatefip_6 |   .0105925   .0017959     5.90   0.000     .0069835    .0142014
    _Sstatefip_8 |   .0057802    .002246     2.57   0.013     .0012667    .0102937
    _Sstatefip_9 |  -.0104811   .0029401    -3.56   0.001    -.0163894   -.0045728
   _Sstatefip_10 |  -.0251007   .0054406    -4.61   0.000     -.036034   -.0141674
   _Sstatefip_12 |  -.0130036   .0058616    -2.22   0.031    -.0247831   -.0012242
   _Sstatefip_13 |   .0159413   .0059402     2.68   0.010     .0040041    .0278785
   _Sstatefip_15 |  -.0266277   .0028381    -9.38   0.000    -.0323311   -.0209243
   _Sstatefip_16 |  -.0508388   .0030236   -16.81   0.000     -.056915   -.0447626
   _Sstatefip_18 |  -.0014069   .0020483    -0.69   0.495    -.0055231    .0027093
   _Sstatefip_19 |  -.0478802   .0035553   -13.47   0.000    -.0550248   -.0407356
   _Sstatefip_20 |  -.0127887   .0027019    -4.73   0.000    -.0182184   -.0073591
   _Sstatefip_21 |   .0157995   .0009448    16.72   0.000      .013901    .0176981
   _Sstatefip_22 |   .0228016   .0055228     4.13   0.000      .011703    .0339001
   _Sstatefip_23 |   -.045699   .0016308   -28.02   0.000    -.0489763   -.0424217
   _Sstatefip_24 |  -.0016673   .0033744    -0.49   0.623    -.0084483    .0051138
   _Sstatefip_25 |  -.0184468   .0030153    -6.12   0.000    -.0245063   -.0123873
   _Sstatefip_26 |   .0116459   .0029888     3.90   0.000     .0056398     .017652
   _Sstatefip_27 |  -.0118519   .0023877    -4.96   0.000    -.0166501   -.0070537
   _Sstatefip_28 |   .0279089   .0054714     5.10   0.000     .0169137    .0389041
   _Sstatefip_29 |  -.0000982   .0014965    -0.07   0.948    -.0031056    .0029092
   _Sstatefip_30 |  -.0670211   .0019777   -33.89   0.000    -.0709954   -.0630467
   _Sstatefip_31 |  -.0392174   .0024357   -16.10   0.000    -.0441121   -.0343228
   _Sstatefip_32 |    .022729   .0043516     5.22   0.000     .0139842    .0314738
   _Sstatefip_33 |   -.006983   .0034023    -2.05   0.045    -.0138201   -.0001458
   _Sstatefip_34 |   -.014141   .0017112    -8.26   0.000    -.0175798   -.0107021
   _Sstatefip_35 |  -.0058146   .0019453    -2.99   0.004    -.0097238   -.0019054
   _Sstatefip_36 |  -.0184658   .0014531   -12.71   0.000    -.0213859   -.0155458
   _Sstatefip_37 |  -.0044679   .0053294    -0.84   0.406    -.0151779     .006242
   _Sstatefip_38 |  -.0694527   .0029129   -23.84   0.000    -.0753064    -.063599
   _Sstatefip_39 |  -.0002608   .0028963    -0.09   0.929    -.0060811    .0055595
   _Sstatefip_40 |   .0070163     .00303     2.32   0.025     .0009273    .0131053
   _Sstatefip_41 |  -.0319293    .001555   -20.53   0.000    -.0350543   -.0288043
   _Sstatefip_42 |  -.0246087   .0012014   -20.48   0.000     -.027023   -.0221943
   _Sstatefip_44 |   .0013183   .0016657     0.79   0.432     -.002029    .0046657
   _Sstatefip_45 |   .0034324   .0090435     0.38   0.706    -.0147411     .021606
   _Sstatefip_46 |  -.0523032   .0029157   -17.94   0.000    -.0581626   -.0464439
   _Sstatefip_47 |  -.0124414   .0042672    -2.92   0.005    -.0210166   -.0038662
   _Sstatefip_48 |   .0066793   .0046211     1.45   0.155    -.0026072    .0159658
   _Sstatefip_49 |  -.0356056   .0031884   -11.17   0.000     -.042013   -.0291983
   _Sstatefip_50 |  -.0376874   .0022305   -16.90   0.000    -.0421698   -.0332049
   _Sstatefip_51 |  -.0191924   .0027931    -6.87   0.000    -.0248053   -.0135795
   _Sstatefip_53 |  -.0115856   .0023143    -5.01   0.000    -.0162364   -.0069349
   _Sstatefip_54 |  -.0075574   .0019413    -3.89   0.000    -.0114587   -.0036562
   _Sstatefip_55 |  -.0268404   .0009782   -27.44   0.000    -.0288063   -.0248746
   _Sstatefip_56 |  -.0140233   .0032482    -4.32   0.000    -.0205509   -.0074958
   _SstaXgro_1_1 |   .0784168   .0070112    11.18   0.000     .0643273    .0925063
   _SstaXgro_1_2 |   .0368049   .0062349     5.90   0.000     .0242753    .0493344
   _SstaXgro_1_3 |   .0501516   .0077208     6.50   0.000     .0346361    .0656671
   _SstaXgro_1_4 |   .0280829   .0075197     3.73   0.000     .0129714    .0431943
   _SstaXgro_1_5 |  -.0015902   .0040175    -0.40   0.694    -.0096637    .0064832
   _SstaXgro_1_7 |  -.0737969   .0055764   -13.23   0.000    -.0850031   -.0625906
   _SstaXgro_1_8 |  -.0234607   .0038222    -6.14   0.000    -.0311417   -.0157797
   _SstaXgro_2_1 |   .2684487   .0034911    76.90   0.000     .2614331    .2754642
   _SstaXgro_2_2 |   .1398015   .0035444    39.44   0.000     .1326787    .1469243
   _SstaXgro_2_3 |    .238338   .0038908    61.26   0.000     .2305192    .2461568
   _SstaXgro_2_4 |   .0365006   .0045494     8.02   0.000     .0273583    .0456429
   _SstaXgro_2_5 |   -.062693    .002286   -27.43   0.000    -.0672868   -.0580992
   _SstaXgro_2_7 |  -.0111188   .0032521    -3.42   0.001    -.0176542   -.0045834
   _SstaXgro_2_8 |   .0051535   .0021799     2.36   0.022     .0007727    .0095342
   _SstaXgro_4_1 |   .1046748   .0084832    12.34   0.000     .0876272    .1217223
   _SstaXgro_4_2 |   .0939683   .0067669    13.89   0.000     .0803698    .1075668
   _SstaXgro_4_3 |   .1179627   .0099405    11.87   0.000     .0979865    .1379388
   _SstaXgro_4_4 |   .0533434   .0086621     6.16   0.000     .0359363    .0707506
   _SstaXgro_4_5 |  -.0009429   .0043747    -0.22   0.830    -.0097342    .0078483
   _SstaXgro_4_7 |  -.0152587   .0062929    -2.42   0.019    -.0279047   -.0026126
   _SstaXgro_4_8 |  -.0323264   .0041853    -7.72   0.000    -.0407371   -.0239157
   _SstaXgro_5_1 |   .0922857   .0040969    22.53   0.000     .0840527    .1005188
   _SstaXgro_5_2 |   .0120844   .0037048     3.26   0.002     .0046392    .0195295
   _SstaXgro_5_3 |    .058132   .0047292    12.29   0.000     .0486283    .0676356
   _SstaXgro_5_4 |   .0108505   .0047795     2.27   0.028     .0012458    .0204552
   _SstaXgro_5_5 |  -.0074006    .002463    -3.00   0.004    -.0123502    -.002451
   _SstaXgro_5_7 |  -.0281713   .0034379    -8.19   0.000    -.0350799   -.0212626
   _SstaXgro_5_8 |  -.0003121   .0023502    -0.13   0.895     -.005035    .0044108
   _SstaXgro_6_1 |    .079359   .0002516   315.36   0.000     .0788533    .0798647
   _SstaXgro_6_2 |   .0656284   .0002113   310.54   0.000     .0652037    .0660531
   _SstaXgro_6_3 |   .0536363   .0003653   146.82   0.000     .0529022    .0543705
   _SstaXgro_6_4 |   .0220139   .0003183    69.17   0.000     .0213743    .0226535
   _SstaXgro_6_5 |  -.0309895   .0004126   -75.10   0.000    -.0318187   -.0301603
   _SstaXgro_6_7 |  -.0412792   .0003175  -130.03   0.000    -.0419171   -.0406412
   _SstaXgro_6_8 |  -.0097958   .0000578  -169.35   0.000     -.009912   -.0096795
   _SstaXgro_8_1 |    .126092   .0004881   258.31   0.000     .1251111     .127073
   _SstaXgro_8_2 |   .0735363   .0004644   158.36   0.000     .0726032    .0744695
   _SstaXgro_8_3 |   .1231834   .0005535   222.57   0.000     .1220711    .1242956
   _SstaXgro_8_4 |   .0005368    .000454     1.18   0.243    -.0003754    .0014491
   _SstaXgro_8_5 |   .0180769   .0003951    45.76   0.000      .017283    .0188708
   _SstaXgro_8_7 |   .0144216    .000384    37.55   0.000     .0136498    .0151933
   _SstaXgro_8_8 |  -.0083823   .0001668   -50.25   0.000    -.0087175    -.008047
   _SstaXgro_9_1 |   .1730695   .0003931   440.22   0.000     .1722795    .1738596
   _SstaXgro_9_2 |    .060438   .0003379   178.84   0.000     .0597589    .0611171
   _SstaXgro_9_3 |   .1748405    .000293   596.75   0.000     .1742517    .1754293
   _SstaXgro_9_4 |   .0582235   .0005137   113.35   0.000     .0571912    .0592557
   _SstaXgro_9_5 |     .01783   .0001562   114.14   0.000      .017516    .0181439
   _SstaXgro_9_7 |   .0439196   .0001188   369.66   0.000     .0436809    .0441584
   _SstaXgro_9_8 |  -.0005535   .0000685    -8.08   0.000    -.0006912   -.0004158
  _SstaXgro_10_1 |   .1640399    .001316   124.65   0.000     .1613953    .1666845
  _SstaXgro_10_2 |   .0784496   .0018437    42.55   0.000     .0747445    .0821546
  _SstaXgro_10_3 |   .1829729   .0011803   155.02   0.000      .180601    .1853448
  _SstaXgro_10_4 |   .0375178    .001401    26.78   0.000     .0347024    .0403332
  _SstaXgro_10_5 |   .0153803   .0007409    20.76   0.000     .0138914    .0168693
  _SstaXgro_10_7 |   .0192186   .0007716    24.91   0.000     .0176679    .0207693
  _SstaXgro_10_8 |   -.012113   .0006608   -18.33   0.000    -.0134409   -.0107851
  _SstaXgro_12_1 |   .1820485   .0053356    34.12   0.000     .1713262    .1927708
  _SstaXgro_12_2 |   .0812538   .0047934    16.95   0.000     .0716212    .0908865
  _SstaXgro_12_3 |   .1183873   .0059199    20.00   0.000     .1064908    .1302838
  _SstaXgro_12_4 |   .0571854   .0060041     9.52   0.000     .0451197    .0692512
  _SstaXgro_12_5 |      .0145     .00307     4.72   0.000     .0083306    .0206694
  _SstaXgro_12_7 |   .0079948   .0043225     1.85   0.070    -.0006916    .0166813
  _SstaXgro_12_8 |  -.0093726   .0029646    -3.16   0.003    -.0153302   -.0034151
  _SstaXgro_13_1 |   .1520928   .0064264    23.67   0.000     .1391785    .1650071
  _SstaXgro_13_2 |   .0612215   .0056689    10.80   0.000     .0498293    .0726136
  _SstaXgro_13_3 |   .1021606    .007268    14.06   0.000     .0875549    .1167663
  _SstaXgro_13_4 |   .0476715   .0070124     6.80   0.000     .0335797    .0617634
  _SstaXgro_13_5 |    .011427   .0037204     3.07   0.003     .0039506    .0189034
  _SstaXgro_13_7 |  -.0292403    .005263    -5.56   0.000    -.0398167   -.0186639
  _SstaXgro_13_8 |  -.0330929    .003483    -9.50   0.000    -.0400923   -.0260935
  _SstaXgro_15_1 |   .3587031   .0011331   316.57   0.000      .356426    .3609801
  _SstaXgro_15_2 |   .1195006   .0006192   193.00   0.000     .1182563    .1207449
  _SstaXgro_15_3 |   .0860318   .0011223    76.66   0.000     .0837765    .0882871
  _SstaXgro_15_4 |  -.0783638    .001083   -72.36   0.000    -.0805402   -.0761873
  _SstaXgro_15_5 |  -.0063235   .0003558   -17.77   0.000    -.0070385   -.0056084
  _SstaXgro_15_7 |   .0012382   .0003226     3.84   0.000     .0005898    .0018865
  _SstaXgro_15_8 |   .0312902    .000082   381.55   0.000     .0311254     .031455
  _SstaXgro_16_1 |   .2027034   .0074669    27.15   0.000     .1876981    .2177087
  _SstaXgro_16_2 |  -.0267456   .0053646    -4.99   0.000    -.0375262    -.015965
  _SstaXgro_16_3 |  -.0030684   .0079934    -0.38   0.703    -.0191318    .0129949
  _SstaXgro_16_4 |  -.0291732   .0070587    -4.13   0.000    -.0433582   -.0149883
  _SstaXgro_16_5 |  -.0013549   .0033457    -0.40   0.687    -.0080783    .0053686
  _SstaXgro_16_7 |   .0295002    .004698     6.28   0.000     .0200592    .0389412
  _SstaXgro_16_8 |  -.0165423   .0032548    -5.08   0.000    -.0230831   -.0100014
  _SstaXgro_18_1 |    .037808   .0003738   101.15   0.000     .0370569    .0385591
  _SstaXgro_18_2 |  -.0017526   .0004293    -4.08   0.000    -.0026154   -.0008899
  _SstaXgro_18_3 |   .1030131   .0002771   371.77   0.000     .1024563    .1035699
  _SstaXgro_18_4 |  -.0022676   .0004006    -5.66   0.000    -.0030727   -.0014625
  _SstaXgro_18_5 |  -.0024292   .0001965   -12.36   0.000    -.0028241   -.0020343
  _SstaXgro_18_7 |  -.0126512   .0002417   -52.34   0.000    -.0131369   -.0121654
  _SstaXgro_18_8 |  -.0042345   .0001396   -30.34   0.000     -.004515    -.003954
  _SstaXgro_19_1 |   .0220611   .0074551     2.96   0.005     .0070794    .0370427
  _SstaXgro_19_2 |   .0199399    .006225     3.20   0.002     .0074303    .0324495
  _SstaXgro_19_3 |   .0540027   .0076232     7.08   0.000     .0386833    .0693221
  _SstaXgro_19_4 |  -.0533433   .0074647    -7.15   0.000    -.0683442   -.0383424
  _SstaXgro_19_5 |   .0168579   .0037412     4.51   0.000     .0093397    .0243761
  _SstaXgro_19_7 |   .0539502   .0052645    10.25   0.000     .0433708    .0645296
  _SstaXgro_19_8 |   .0256335   .0037212     6.89   0.000     .0181554    .0331116
  _SstaXgro_20_1 |    .095478   .0002715   351.61   0.000     .0949323    .0960237
  _SstaXgro_20_2 |    .049526   .0003056   162.08   0.000     .0489119      .05014
  _SstaXgro_20_3 |   .0912231   .0002363   386.02   0.000     .0907482     .091698
  _SstaXgro_20_4 |  -.0360649   .0005063   -71.23   0.000    -.0370823   -.0350474
  _SstaXgro_20_5 |   .0082849   .0001121    73.92   0.000     .0080597    .0085101
  _SstaXgro_20_7 |   .0204943   .0001669   122.76   0.000     .0201588    .0208298
  _SstaXgro_20_8 |  -.0042596   .0000571   -74.58   0.000    -.0043743   -.0041448
  _SstaXgro_21_1 |   .0878506   .0006554   134.05   0.000     .0865336    .0891676
  _SstaXgro_21_2 |   .0198397   .0008402    23.61   0.000     .0181512    .0215282
  _SstaXgro_21_3 |   .0957792   .0003792   252.56   0.000     .0950171    .0965413
  _SstaXgro_21_4 |   .0068499     .00056    12.23   0.000     .0057246    .0079752
  _SstaXgro_21_5 |  -.0520905   .0002374  -219.44   0.000    -.0525676   -.0516135
  _SstaXgro_21_7 |  -.0856794   .0002875  -297.98   0.000    -.0862572   -.0851015
  _SstaXgro_21_8 |   .0069629   .0000996    69.91   0.000     .0067628    .0071631
  _SstaXgro_22_1 |   .0618588   .0036193    17.09   0.000     .0545854    .0691322
  _SstaXgro_22_2 |  -.0024966   .0031043    -0.80   0.425    -.0087349    .0037416
  _SstaXgro_22_3 |   .0194166   .0038037     5.10   0.000     .0117727    .0270605
  _SstaXgro_22_4 |   .0103604   .0038816     2.67   0.010     .0025601    .0181608
  _SstaXgro_22_5 |  -.0125055   .0018976    -6.59   0.000    -.0163189   -.0086921
  _SstaXgro_22_7 |   -.101039   .0026531   -38.08   0.000    -.1063706   -.0957075
  _SstaXgro_22_8 |  -.0387833   .0018416   -21.06   0.000    -.0424842   -.0350825
  _SstaXgro_23_1 |   .3408508   .0018574   183.51   0.000     .3371181    .3445834
  _SstaXgro_23_2 |   .1686992   .0009956   169.44   0.000     .1666984       .1707
  _SstaXgro_23_3 |   .1836523   .0025239    72.77   0.000     .1785804    .1887242
  _SstaXgro_23_4 |  -.0717961   .0013085   -54.87   0.000    -.0744256   -.0691665
  _SstaXgro_23_5 |  -.0298847   .0005705   -52.39   0.000     -.031031   -.0287383
  _SstaXgro_23_7 |   .0110949   .0004218    26.30   0.000     .0102472    .0119426
  _SstaXgro_23_8 |   .0304093   .0004335    70.16   0.000     .0295383    .0312804
  _SstaXgro_24_1 |   .1330927   .0005234   254.27   0.000     .1320409    .1341446
  _SstaXgro_24_2 |   .0722667   .0006247   115.69   0.000     .0710113     .073522
  _SstaXgro_24_3 |   .1611168    .000266   605.81   0.000     .1605823    .1616512
  _SstaXgro_24_4 |   .0751325   .0003481   215.84   0.000      .074433     .075832
  _SstaXgro_24_5 |   .0012252   .0002167     5.65   0.000     .0007897    .0016606
  _SstaXgro_24_7 |  -.0006079   .0001729    -3.52   0.001    -.0009554   -.0002605
  _SstaXgro_24_8 |  -.0119132   .0000899  -132.47   0.000    -.0120939   -.0117325
  _SstaXgro_25_1 |   .1432242   .0010643   134.58   0.000     .1410855     .145363
  _SstaXgro_25_2 |   .0224459   .0009314    24.10   0.000     .0205741    .0243176
  _SstaXgro_25_3 |   .0790853   .0006635   119.19   0.000      .077752    .0804187
  _SstaXgro_25_4 |    .036436   .0006408    56.86   0.000     .0351483    .0377237
  _SstaXgro_25_5 |  -.0145571   .0000973  -149.54   0.000    -.0147527   -.0143615
  _SstaXgro_25_7 |   .0247317    .000126   196.36   0.000     .0244786    .0249848
  _SstaXgro_25_8 |   .0229155   .0000637   359.60   0.000     .0227875    .0230436
  _SstaXgro_26_1 |   .0006884   .0002211     3.11   0.003     .0002442    .0011327
  _SstaXgro_26_2 |   .0042042   .0003035    13.85   0.000     .0035944    .0048141
  _SstaXgro_26_3 |   .0078876   .0001689    46.71   0.000     .0075483    .0082269
  _SstaXgro_26_4 |  -.0206741   .0002153   -96.02   0.000    -.0211068   -.0202414
  _SstaXgro_26_5 |  -.0322091   .0000872  -369.33   0.000    -.0323844   -.0320339
  _SstaXgro_26_7 |  -.0232635   .0001116  -208.47   0.000    -.0234878   -.0230393
  _SstaXgro_26_8 |   .0023824   .0000711    33.51   0.000     .0022395    .0025252
  _SstaXgro_27_1 |    .133608   .0013866    96.36   0.000     .1308215    .1363945
  _SstaXgro_27_2 |   .0441027   .0009873    44.67   0.000     .0421187    .0460867
  _SstaXgro_27_3 |  -.0002221   .0012538    -0.18   0.860    -.0027417    .0022975
  _SstaXgro_27_4 |  -.0274158   .0010867   -25.23   0.000    -.0295996   -.0252321
  _SstaXgro_27_5 |  -.0089642   .0001837   -48.80   0.000    -.0093334   -.0085951
  _SstaXgro_27_7 |   .0705068   .0001963   359.19   0.000     .0701123    .0709013
  _SstaXgro_27_8 |   .0384757   .0001884   204.26   0.000     .0380972    .0388543
  _SstaXgro_28_1 |    .094335   .0056226    16.78   0.000      .083036    .1056341
  _SstaXgro_28_2 |   .0234568   .0048254     4.86   0.000     .0137598    .0331539
  _SstaXgro_28_3 |   .0350179   .0059464     5.89   0.000     .0230681    .0469676
  _SstaXgro_28_4 |  -.0091764   .0058978    -1.56   0.126    -.0210285    .0026757
  _SstaXgro_28_5 |  -.0124192   .0030337    -4.09   0.000    -.0185157   -.0063228
  _SstaXgro_28_7 |  -.0902579   .0043205   -20.89   0.000    -.0989404   -.0815755
  _SstaXgro_28_8 |  -.0413108   .0029147   -14.17   0.000    -.0471682   -.0354535
  _SstaXgro_29_1 |   .0899159   .0004544   197.89   0.000     .0890028     .090829
  _SstaXgro_29_2 |   .0560376   .0004354   128.71   0.000     .0551626    .0569125
  _SstaXgro_29_3 |   .1197167   .0002733   438.07   0.000     .1191675    .1202658
  _SstaXgro_29_4 |   .0283643   .0004808    58.99   0.000     .0273981    .0293306
  _SstaXgro_29_5 |  -.0020824   .0001514   -13.76   0.000    -.0023866   -.0017782
  _SstaXgro_29_7 |   .0121353   .0001641    73.97   0.000     .0118056    .0124649
  _SstaXgro_29_8 |   .0246221    .000098   251.23   0.000     .0244251     .024819
  _SstaXgro_30_1 |   .1202997   .0015259    78.84   0.000     .1172333    .1233661
  _SstaXgro_30_2 |   .1473258   .0026468    55.66   0.000     .1420068    .1526447
  _SstaXgro_30_3 |   .2211684   .0016095   137.42   0.000      .217934    .2244027
  _SstaXgro_30_4 |  -.0196245   .0006789   -28.91   0.000    -.0209888   -.0182602
  _SstaXgro_30_5 |  -.0132809   .0003325   -39.94   0.000     -.013949   -.0126127
  _SstaXgro_30_7 |   .0250794   .0004549    55.13   0.000     .0241652    .0259936
  _SstaXgro_30_8 |   .0353702   .0000891   397.00   0.000     .0351911    .0355492
  _SstaXgro_31_1 |   .0706344   .0005995   117.81   0.000     .0694296    .0718393
  _SstaXgro_31_2 |   .0410987   .0008823    46.58   0.000     .0393256    .0428717
  _SstaXgro_31_3 |   .0686305   .0002883   238.08   0.000     .0680512    .0692098
  _SstaXgro_31_4 |    .014696   .0004421    33.24   0.000     .0138075    .0155845
  _SstaXgro_31_5 |   .0233274   .0001843   126.57   0.000      .022957    .0236978
  _SstaXgro_31_7 |   .0486714   .0001035   470.03   0.000     .0484633    .0488795
  _SstaXgro_31_8 |   .0224154    .000087   257.68   0.000     .0222406    .0225902
  _SstaXgro_32_1 |   .1823657   .0012827   142.17   0.000      .179788    .1849434
  _SstaXgro_32_2 |   .0678824   .0013451    50.46   0.000     .0651792    .0705855
  _SstaXgro_32_3 |   .1292908   .0013435    96.23   0.000     .1265908    .1319907
  _SstaXgro_32_4 |  -.0022445   .0009572    -2.34   0.023    -.0041681   -.0003209
  _SstaXgro_32_5 |   .0068233   .0005236    13.03   0.000     .0057712    .0078755
  _SstaXgro_32_7 |   .0139905   .0007512    18.62   0.000     .0124809    .0155001
  _SstaXgro_32_8 |  -.0243234   .0002902   -83.82   0.000    -.0249065   -.0237402
  _SstaXgro_33_1 |   .0827668   .0016442    50.34   0.000     .0794627     .086071
  _SstaXgro_33_2 |     .12527   .0016244    77.12   0.000     .1220057    .1285344
  _SstaXgro_33_3 |   .1015416    .001617    62.80   0.000     .0982921    .1047911
  _SstaXgro_33_4 |  -.0580116   .0018118   -32.02   0.000    -.0616526   -.0543705
  _SstaXgro_33_5 |   .0118875   .0003348    35.51   0.000     .0112147    .0125603
  _SstaXgro_33_7 |   .0388385   .0003737   103.93   0.000     .0380876    .0395895
  _SstaXgro_33_8 |    .005243   .0001276    41.09   0.000     .0049866    .0054994
  _SstaXgro_34_1 |   .1297486   .0002539   510.95   0.000     .1292383     .130259
  _SstaXgro_34_2 |   .0560928   .0006178    90.79   0.000     .0548512    .0573343
  _SstaXgro_34_3 |   .1352226   .0002446   552.81   0.000      .134731    .1357141
  _SstaXgro_34_4 |   .0185176   .0004592    40.32   0.000     .0175947    .0194404
  _SstaXgro_34_5 |   .0163029   .0000855   190.61   0.000      .016131    .0164748
  _SstaXgro_34_7 |  -.0077472   .0000771  -100.46   0.000    -.0079022   -.0075922
  _SstaXgro_34_8 |  -.0295571    .000084  -351.75   0.000    -.0297259   -.0293882
  _SstaXgro_35_1 |   .1242548   .0011352   109.46   0.000     .1219735    .1265361
  _SstaXgro_35_2 |   .0410436   .0005303    77.40   0.000      .039978    .0421092
  _SstaXgro_35_3 |   .0682709   .0010519    64.90   0.000      .066157    .0703848
  _SstaXgro_35_4 |   .0193474    .000626    30.91   0.000     .0180894    .0206055
  _SstaXgro_35_5 |  -.0489171   .0006044   -80.94   0.000    -.0501316   -.0477025
  _SstaXgro_35_7 |  -.0623822   .0005343  -116.76   0.000    -.0634559   -.0613085
  _SstaXgro_35_8 |  -.0026592   .0000975   -27.29   0.000    -.0028551   -.0024634
  _SstaXgro_36_1 |   .0796435   .0002352   338.58   0.000     .0791708    .0801162
  _SstaXgro_36_2 |   .0201197   .0004934    40.78   0.000     .0191282    .0211113
  _SstaXgro_36_3 |   .0694778   .0003663   189.65   0.000     .0687416     .070214
  _SstaXgro_36_4 |  -.0082424   .0001728   -47.69   0.000    -.0085897   -.0078951
  _SstaXgro_36_5 |  -.0100524   .0001517   -66.26   0.000    -.0103572   -.0097475
  _SstaXgro_36_7 |  -.0400402   .0001709  -234.32   0.000    -.0403836   -.0396968
  _SstaXgro_36_8 |  -.0032181   .0000501   -64.28   0.000    -.0033187   -.0031175
  _SstaXgro_37_1 |   .1625974   .0004424   367.52   0.000     .1617083    .1634864
  _SstaXgro_37_2 |   .0450164   .0007803    57.69   0.000     .0434483    .0465846
  _SstaXgro_37_3 |   .1187094   .0005132   231.32   0.000     .1176782    .1197407
  _SstaXgro_37_4 |   .0352627   .0006675    52.83   0.000     .0339212    .0366041
  _SstaXgro_37_5 |   .0013269   .0001929     6.88   0.000     .0009393    .0017144
  _SstaXgro_37_7 |  -.0097601   .0003336   -29.25   0.000    -.0104306   -.0090897
  _SstaXgro_37_8 |  -.0184742   .0001634  -113.09   0.000    -.0188025   -.0181459
  _SstaXgro_38_1 |   .2697857   .0016738   161.19   0.000     .2664222    .2731492
  _SstaXgro_38_2 |   .1759917   .0019015    92.55   0.000     .1721705    .1798129
  _SstaXgro_38_3 |   .1341231   .0008917   150.41   0.000     .1323311    .1359151
  _SstaXgro_38_4 |  -.0597295   .0014199   -42.07   0.000    -.0625829   -.0568762
  _SstaXgro_38_5 |  -.0042508   .0001151   -36.95   0.000     -.004482   -.0040196
  _SstaXgro_38_7 |   .0493238   .0001727   285.59   0.000     .0489767    .0496709
  _SstaXgro_38_8 |   .0356917   .0000746   478.33   0.000     .0355417    .0358416
  _SstaXgro_39_1 |   .0752674   .0045207    16.65   0.000     .0661827    .0843522
  _SstaXgro_39_2 |   .0176512   .0042183     4.18   0.000     .0091742    .0261282
  _SstaXgro_39_3 |   .0491754   .0050414     9.75   0.000     .0390443    .0593065
  _SstaXgro_39_4 |      .0082   .0049221     1.67   0.102    -.0016913    .0180913
  _SstaXgro_39_5 |  -.0185761   .0025257    -7.35   0.000    -.0236518   -.0135005
  _SstaXgro_39_7 |  -.0298125   .0035425    -8.42   0.000    -.0369314   -.0226937
  _SstaXgro_39_8 |   .0052489   .0024728     2.12   0.039     .0002796    .0102183
  _SstaXgro_40_1 |   .0822846   .0002351   350.01   0.000     .0818122     .082757
  _SstaXgro_40_2 |   .0318124   .0007316    43.48   0.000     .0303422    .0332827
  _SstaXgro_40_3 |    .067131   .0002802   239.59   0.000      .066568    .0676941
  _SstaXgro_40_4 |   .0024893   .0004669     5.33   0.000      .001551    .0034276
  _SstaXgro_40_5 |  -.0107306   .0002266   -47.35   0.000     -.011186   -.0102752
  _SstaXgro_40_7 |  -.0339653   .0002487  -136.58   0.000    -.0344651   -.0334655
  _SstaXgro_40_8 |   -.022821   .0000616  -370.64   0.000    -.0229448   -.0226973
  _SstaXgro_41_1 |   .0758025   .0011632    65.16   0.000     .0734649    .0781402
  _SstaXgro_41_2 |   .0449703   .0009892    45.46   0.000     .0429824    .0469581
  _SstaXgro_41_3 |   .0952074   .0007159   132.98   0.000     .0937687    .0966462
  _SstaXgro_41_4 |  -.0813091    .000502  -161.98   0.000    -.0823179   -.0803003
  _SstaXgro_41_5 |   -.007279   .0004883   -14.91   0.000    -.0082603   -.0062977
  _SstaXgro_41_7 |   .0038071   .0004738     8.04   0.000     .0028549    .0047592
  _SstaXgro_41_8 |    .013675   .0001074   127.33   0.000     .0134591    .0138908
  _SstaXgro_42_1 |   .0276976   .0002973    93.17   0.000     .0271002     .028295
  _SstaXgro_42_2 |   .0233121   .0002331   100.01   0.000     .0228437    .0237806
  _SstaXgro_42_3 |   .0628326   .0003906   160.88   0.000     .0620478    .0636175
  _SstaXgro_42_4 |   .0090999   .0003006    30.27   0.000     .0084958     .009704
  _SstaXgro_42_5 |   .0011477   .0001846     6.22   0.000     .0007767    .0015187
  _SstaXgro_42_7 |  -.0085869   .0002155   -39.84   0.000    -.0090201   -.0081538
  _SstaXgro_42_8 |  -.0062639   .0000725   -86.41   0.000    -.0064095   -.0061182
  _SstaXgro_44_1 |    .132874   .0008304   160.00   0.000     .1312052    .1345429
  _SstaXgro_44_2 |   .0702361    .000723    97.15   0.000     .0687832    .0716889
  _SstaXgro_44_3 |   .1308479   .0005784   226.21   0.000     .1296854    .1320103
  _SstaXgro_44_4 |   .0056681    .000938     6.04   0.000     .0037831     .007553
  _SstaXgro_44_5 |  -.0271097   .0002295  -118.10   0.000     -.027571   -.0266484
  _SstaXgro_44_7 |   .0181821   .0003529    51.53   0.000      .017473    .0188912
  _SstaXgro_44_8 |   .0336627   .0002089   161.13   0.000     .0332428    .0340825
  _SstaXgro_45_1 |   .1359036   .0116399    11.68   0.000     .1125124    .1592949
  _SstaXgro_45_2 |   .0513605   .0093849     5.47   0.000     .0325008    .0702202
  _SstaXgro_45_3 |   .0929503   .0130851     7.10   0.000     .0666549    .1192458
  _SstaXgro_45_4 |   .0387087   .0109746     3.53   0.001     .0166544     .060763
  _SstaXgro_45_5 |   .0105066    .006409     1.64   0.108    -.0023728    .0233859
  _SstaXgro_45_7 |  -.0161358   .0096433    -1.67   0.101    -.0355148    .0032432
  _SstaXgro_45_8 |  -.0134556   .0059292    -2.27   0.028    -.0253708   -.0015403
  _SstaXgro_46_1 |   .3015312   .0026311   114.60   0.000     .2962439    .3068186
  _SstaXgro_46_2 |   .1072547   .0014712    72.90   0.000     .1042983    .1102112
  _SstaXgro_46_3 |   .2235877   .0027487    81.34   0.000     .2180639    .2291115
  _SstaXgro_46_4 |   .0609995   .0017198    35.47   0.000     .0575434    .0644556
  _SstaXgro_46_5 |   .0217358   .0001377   157.89   0.000     .0214592    .0220124
  _SstaXgro_46_7 |   .0593299   .0002173   273.04   0.000     .0588933    .0597666
  _SstaXgro_46_8 |   .0433079   .0000972   445.45   0.000     .0431125    .0435033
  _SstaXgro_47_1 |    .098022   .0058105    16.87   0.000     .0863453    .1096987
  _SstaXgro_47_2 |   .1062285   .0051009    20.83   0.000     .0959779    .1164791
  _SstaXgro_47_3 |   .1220203   .0061401    19.87   0.000     .1096813    .1343593
  _SstaXgro_47_4 |   .0585947   .0060606     9.67   0.000     .0464155    .0707739
  _SstaXgro_47_5 |  -.0243896   .0033667    -7.24   0.000    -.0311551    -.017624
  _SstaXgro_47_7 |  -.0449207   .0046935    -9.57   0.000    -.0543526   -.0354888
  _SstaXgro_47_8 |  -.0160192   .0032284    -4.96   0.000    -.0225069   -.0095314
  _SstaXgro_48_1 |   .1229652   .0003246   378.86   0.000      .122313    .1236175
  _SstaXgro_48_2 |   .0622251   .0006016   103.42   0.000      .061016    .0634341
  _SstaXgro_48_3 |   .1291202   .0003996   323.15   0.000     .1283172    .1299231
  _SstaXgro_48_4 |   .0243676   .0005692    42.81   0.000     .0232239    .0255114
  _SstaXgro_48_5 |   .0168445   .0003159    53.32   0.000     .0162096    .0174794
  _SstaXgro_48_7 |  -.0175199   .0003321   -52.75   0.000    -.0181874   -.0168525
  _SstaXgro_48_8 |  -.0321241    .000074  -434.33   0.000    -.0322728   -.0319755
  _SstaXgro_49_1 |   .2115209    .006656    31.78   0.000     .1981451    .2248966
  _SstaXgro_49_2 |   .0755622   .0051148    14.77   0.000     .0652836    .0858408
  _SstaXgro_49_3 |    .193465    .007943    24.36   0.000      .177503     .209427
  _SstaXgro_49_4 |   .0386535   .0065343     5.92   0.000     .0255223    .0517847
  _SstaXgro_49_5 |   .0216393   .0029994     7.21   0.000     .0156119    .0276668
  _SstaXgro_49_7 |  -.0041021   .0042127    -0.97   0.335    -.0125678    .0043636
  _SstaXgro_49_8 |  -.0787027   .0027946   -28.16   0.000    -.0843188   -.0730867
  _SstaXgro_50_1 |    .219666   .0038536    57.00   0.000     .2119218    .2274101
  _SstaXgro_50_2 |   .0275636   .0014403    19.14   0.000     .0246693    .0304579
  _SstaXgro_50_3 |   .1150532   .0030919    37.21   0.000     .1088397    .1212667
  _SstaXgro_50_4 |  -.0750942   .0013171   -57.02   0.000     -.077741   -.0724474
  _SstaXgro_50_5 |  -.0048457   .0002954   -16.41   0.000    -.0054392   -.0042521
  _SstaXgro_50_7 |   .0439027   .0003887   112.96   0.000     .0431216    .0446837
  _SstaXgro_50_8 |   .0403691    .000173   233.36   0.000     .0400214    .0407167
  _SstaXgro_51_1 |   .1876969    .000219   857.04   0.000     .1872568     .188137
  _SstaXgro_51_2 |   .0854621   .0004249   201.12   0.000     .0846082     .086316
  _SstaXgro_51_3 |   .1554927    .000274   567.40   0.000      .154942    .1560434
  _SstaXgro_51_4 |   .0479077   .0004893    97.90   0.000     .0469243     .048891
  _SstaXgro_51_5 |    .012304   .0001827    67.33   0.000     .0119367    .0126712
  _SstaXgro_51_7 |  -.0141964   .0002496   -56.87   0.000     -.014698   -.0136947
  _SstaXgro_51_8 |  -.0227898   .0000975  -233.73   0.000    -.0229857   -.0225938
  _SstaXgro_53_1 |   .1086839   .0010617   102.37   0.000     .1065505    .1108174
  _SstaXgro_53_2 |   .0604303   .0005991   100.86   0.000     .0592263    .0616343
  _SstaXgro_53_3 |   .1526797   .0012123   125.95   0.000     .1502436    .1551158
  _SstaXgro_53_4 |    .021679   .0008485    25.55   0.000     .0199739    .0233841
  _SstaXgro_53_5 |   -.010316   .0005756   -17.92   0.000    -.0114727   -.0091593
  _SstaXgro_53_7 |  -.0144953   .0006652   -21.79   0.000    -.0158321   -.0131585
  _SstaXgro_53_8 |  -.0124476   .0001317   -94.53   0.000    -.0127122    -.012183
  _SstaXgro_54_1 |   .0618392   .0006294    98.25   0.000     .0605744    .0631041
  _SstaXgro_54_2 |   .0529892   .0009486    55.86   0.000     .0510829    .0548956
  _SstaXgro_54_3 |   .0982855   .0005979   164.38   0.000      .097084    .0994871
  _SstaXgro_54_4 |   .0011707   .0005324     2.20   0.033     .0001009    .0022405
  _SstaXgro_54_5 |  -.0961403   .0003357  -286.36   0.000     -.096815   -.0954657
  _SstaXgro_54_7 |  -.1508347   .0002407  -626.74   0.000    -.1513183    -.150351
  _SstaXgro_54_8 |   .0236056   .0001184   199.39   0.000     .0233676    .0238435
  _SstaXgro_55_1 |   .0221029   .0008437    26.20   0.000     .0204075    .0237983
  _SstaXgro_55_2 |   .0019521    .000224     8.71   0.000      .001502    .0024023
  _SstaXgro_55_3 |    .065733   .0004842   135.75   0.000     .0647599    .0667061
  _SstaXgro_55_4 |  -.0232371   .0006474   -35.89   0.000    -.0245382    -.021936
  _SstaXgro_55_5 |   .0129606   .0001092   118.66   0.000     .0127411    .0131801
  _SstaXgro_55_7 |   .0872197   .0001987   439.05   0.000     .0868205     .087619
  _SstaXgro_55_8 |   .0394052   .0001005   392.25   0.000     .0392033    .0396071
  _SstaXgro_56_1 |   .1510715    .000996   151.68   0.000       .14907    .1530729
  _SstaXgro_56_2 |   .0957174   .0009424   101.57   0.000     .0938236    .0976112
  _SstaXgro_56_3 |   .1012102   .0012676    79.84   0.000     .0986628    .1037576
  _SstaXgro_56_4 |   .0219732   .0012229    17.97   0.000     .0195157    .0244306
  _SstaXgro_56_5 |     .00382    .000294    12.99   0.000     .0032291    .0044109
  _SstaXgro_56_7 |  -.0094578   .0004735   -19.97   0.000    -.0104094   -.0085062
  _SstaXgro_56_8 |  -.0059339   .0002459   -24.13   0.000    -.0064281   -.0054397
    _SstaXttre_1 |   .0003369   .0005764     0.58   0.562    -.0008214    .0014951
    _SstaXttre_2 |  -.0010321   .0009713    -1.06   0.293     -.002984    .0009197
    _SstaXttre_4 |   .0023512   .0007293     3.22   0.002     .0008856    .0038168
    _SstaXttre_5 |   .0011033   .0003642     3.03   0.004     .0003715    .0018352
    _SstaXttre_6 |   .0012003   .0005139     2.34   0.024     .0001676     .002233
    _SstaXttre_8 |  -.0046831   .0004497   -10.41   0.000    -.0055868   -.0037793
    _SstaXttre_9 |   .0017498   .0006536     2.68   0.010     .0004364    .0030632
   _SstaXttre_10 |   .0041081   .0008926     4.60   0.000     .0023145    .0059018
   _SstaXttre_12 |   .0078636   .0007443    10.57   0.000      .006368    .0093593
   _SstaXttre_13 |   .0031095   .0006299     4.94   0.000     .0018436    .0043754
   _SstaXttre_15 |  -.0026134   .0007467    -3.50   0.001    -.0041139   -.0011129
   _SstaXttre_16 |   .0015443   .0008523     1.81   0.076    -.0001685     .003257
   _SstaXttre_18 |   .0007931   .0005565     1.43   0.160    -.0003253    .0019115
   _SstaXttre_19 |   .0040328   .0007953     5.07   0.000     .0024346     .005631
   _SstaXttre_20 |  -.0003583   .0002863    -1.25   0.217    -.0009336     .000217
   _SstaXttre_21 |  -.0054892   .0002254   -24.35   0.000    -.0059422   -.0050362
   _SstaXttre_22 |  -.0005415   .0005146    -1.05   0.298    -.0015755    .0004926
   _SstaXttre_23 |   .0026769   .0007394     3.62   0.001      .001191    .0041628
   _SstaXttre_24 |   .0042667    .000336    12.70   0.000     .0035915     .004942
   _SstaXttre_25 |    .001862   .0003867     4.81   0.000     .0010849    .0026392
   _SstaXttre_26 |  -.0010806   .0004409    -2.45   0.018    -.0019666   -.0001945
   _SstaXttre_27 |   .0013387   .0005103     2.62   0.012     .0003131    .0023642
   _SstaXttre_28 |   .0044583   .0010837     4.11   0.000     .0022805    .0066361
   _SstaXttre_29 |  -.0052926   .0003443   -15.37   0.000    -.0059844   -.0046008
   _SstaXttre_30 |   .0049171   .0006789     7.24   0.000     .0035528    .0062813
   _SstaXttre_31 |   .0007591   .0005189     1.46   0.150    -.0002838    .0018019
   _SstaXttre_32 |    .001108   .0005485     2.02   0.049     5.72e-06    .0022102
   _SstaXttre_33 |  -.0004188    .000723    -0.58   0.565    -.0018716    .0010341
   _SstaXttre_34 |   .0028721   .0006096     4.71   0.000      .001647    .0040972
   _SstaXttre_35 |  -.0069007   .0004214   -16.37   0.000    -.0077476   -.0060538
   _SstaXttre_36 |  -.0010529   .0004597    -2.29   0.026    -.0019767   -.0001291
   _SstaXttre_37 |   .0052043   .0006722     7.74   0.000     .0038535    .0065551
   _SstaXttre_38 |   .0024357   .0006074     4.01   0.000     .0012151    .0036564
   _SstaXttre_39 |  -.0011834   .0006158    -1.92   0.060    -.0024209    .0000542
   _SstaXttre_40 |   -.002767   .0005218    -5.30   0.000    -.0038156   -.0017183
   _SstaXttre_41 |   -.000877   .0004416    -1.99   0.053    -.0017644    .0000103
   _SstaXttre_42 |  -.0018795   .0004225    -4.45   0.000    -.0027287   -.0010304
   _SstaXttre_44 |  -.0011254   .0005833    -1.93   0.059    -.0022976    .0000468
   _SstaXttre_45 |   .0023297   .0012836     1.82   0.076    -.0002497    .0049091
   _SstaXttre_46 |  -.0017002   .0004632    -3.67   0.001    -.0026311   -.0007693
   _SstaXttre_47 |   .0027517   .0009458     2.91   0.005     .0008511    .0046523
   _SstaXttre_48 |    .003316   .0012563     2.64   0.011     .0007914    .0058407
   _SstaXttre_49 |   .0019299   .0006781     2.85   0.006     .0005672    .0032927
   _SstaXttre_50 |  -.0004339    .000562    -0.77   0.444    -.0015634    .0006955
   _SstaXttre_51 |   .0063749     .00037    17.23   0.000     .0056314    .0071184
   _SstaXttre_53 |  -.0023343   .0005796    -4.03   0.000    -.0034989   -.0011696
   _SstaXttre_54 |  -.0005739   .0007021    -0.82   0.418    -.0019849    .0008371
   _SstaXttre_55 |  -.0010468    .000862    -1.21   0.230     -.002779    .0006854
   _SstaXttre_56 |  -.0051826   .0007832    -6.62   0.000    -.0067565   -.0036087
    _SstaXttrea1 |  -.0001569   .0000527    -2.98   0.005    -.0002628    -.000051
    _SstaXttrea2 |  -.0000139   .0000678    -0.21   0.838    -.0001501    .0001223
    _SstaXttrea4 |  -.0002063   .0000643    -3.21   0.002    -.0003355   -.0000771
    _SstaXttrea5 |  -.0000732   .0000273    -2.68   0.010     -.000128   -.0000184
    _SstaXttrea6 |  -.0004418   .0000332   -13.31   0.000    -.0005085   -.0003752
    _SstaXttrea8 |   .0003265   .0000354     9.23   0.000     .0002554    .0003975
    _SstaXttrea9 |  -.0003585   .0000743    -4.83   0.000    -.0005077   -.0002092
   _SstaXttrea10 |   -.000288   .0000777    -3.71   0.001    -.0004441    -.000132
   _SstaXttrea12 |  -.0007911   .0000572   -13.84   0.000     -.000906   -.0006762
   _SstaXttrea13 |  -.0004985   .0000577    -8.63   0.000    -.0006145   -.0003824
   _SstaXttrea15 |   .0001241   .0000664     1.87   0.067    -9.23e-06    .0002575
   _SstaXttrea16 |   .0001095   .0000724     1.51   0.137    -.0000361    .0002551
   _SstaXttrea18 |  -.0000831   .0000357    -2.33   0.024    -.0001548   -.0000114
   _SstaXttrea19 |  -.0000945   .0000698    -1.35   0.182    -.0002348    .0000459
   _SstaXttrea20 |   .0001193    .000029     4.12   0.000     .0000611    .0001776
   _SstaXttrea21 |   .0003114   .0000185    16.81   0.000     .0002742    .0003487
   _SstaXttrea22 |  -.0001015   .0000629    -1.61   0.113     -.000228    .0000249
   _SstaXttrea23 |  -.0002741   .0000642    -4.27   0.000    -.0004031   -.0001451
   _SstaXttrea24 |  -.0003377   .0000313   -10.79   0.000    -.0004005   -.0002748
   _SstaXttrea25 |  -.0003218   .0000365    -8.82   0.000    -.0003951   -.0002485
   _SstaXttrea26 |  -.0000326   .0000141    -2.32   0.025    -.0000608   -4.34e-06
   _SstaXttrea27 |  -.0000983   .0000286    -3.44   0.001    -.0001557    -.000041
   _SstaXttrea28 |  -.0005677   .0001157    -4.91   0.000    -.0008003   -.0003352
   _SstaXttrea29 |   .0004472   .0000343    13.03   0.000     .0003782    .0005161
   _SstaXttrea30 |  -.0003518   .0000464    -7.57   0.000    -.0004451   -.0002584
   _SstaXttrea31 |   .0001903   .0000418     4.55   0.000     .0001063    .0002744
   _SstaXttrea32 |  -.0003285    .000047    -6.99   0.000     -.000423    -.000234
   _SstaXttrea33 |  -.0000954   .0000604    -1.58   0.121    -.0002168    .0000261
   _SstaXttrea34 |  -.0003411     .00005    -6.82   0.000    -.0004416   -.0002407
   _SstaXttrea35 |   .0006162   .0000265    23.26   0.000      .000563    .0006695
   _SstaXttrea36 |  -.0000881   .0000337    -2.62   0.012    -.0001559   -.0000204
   _SstaXttrea37 |  -.0004464   .0000359   -12.44   0.000    -.0005185   -.0003743
   _SstaXttrea38 |   .0000811   .0000384     2.11   0.040     3.91e-06    .0001584
   _SstaXttrea39 |   .0000422   .0000442     0.95   0.345    -.0000467    .0001311
   _SstaXttrea40 |  -9.35e-06   .0000426    -0.22   0.827    -.0000949    .0000762
   _SstaXttrea41 |   .0001261   .0000359     3.52   0.001     .0000541    .0001982
   _SstaXttrea42 |   .0001447   .0000345     4.20   0.000     .0000754     .000214
   _SstaXttrea44 |  -.0001045     .00005    -2.09   0.042    -.0002049   -4.14e-06
   _SstaXttrea45 |  -.0003698   .0000755    -4.90   0.000    -.0005215   -.0002182
   _SstaXttrea46 |   .0003749   .0000337    11.12   0.000     .0003072    .0004427
   _SstaXttrea47 |  -.0003096   .0000716    -4.33   0.000    -.0004534   -.0001658
   _SstaXttrea48 |  -.0003471   .0001472    -2.36   0.022    -.0006429   -.0000514
   _SstaXttrea49 |   .0002164   .0000511     4.23   0.000     .0001136    .0003191
   _SstaXttrea50 |  -.0000361   .0000399    -0.91   0.370    -.0001164    .0000441
   _SstaXttrea51 |  -.0005545   .0000293   -18.95   0.000    -.0006133   -.0004957
   _SstaXttrea53 |   .0000892   .0000367     2.43   0.019     .0000155    .0001629
   _SstaXttrea54 |  -.0001181   .0000405    -2.92   0.005    -.0001994   -.0000367
   _SstaXttrea55 |    .000178   .0000637     2.79   0.007       .00005    .0003061
   _SstaXttrea56 |   .0004665   .0000535     8.72   0.000      .000359     .000574
    _SstaXttreb1 |   3.32e-06   1.19e-06     2.80   0.007     9.36e-07    5.71e-06
    _SstaXttreb2 |   2.16e-06   1.44e-06     1.50   0.139    -7.26e-07    5.05e-06
    _SstaXttreb4 |   3.07e-06   1.45e-06     2.12   0.039     1.65e-07    5.98e-06
    _SstaXttreb5 |   7.49e-07   4.85e-07     1.54   0.129    -2.26e-07    1.72e-06
    _SstaXttreb6 |   .0000133   7.71e-07    17.20   0.000     .0000117    .0000148
    _SstaXttreb8 |  -5.34e-06   6.63e-07    -8.05   0.000    -6.67e-06   -4.01e-06
    _SstaXttreb9 |   .0000105   1.71e-06     6.14   0.000     7.04e-06    .0000139
   _SstaXttreb10 |   5.51e-06   1.80e-06     3.06   0.004     1.88e-06    9.13e-06
   _SstaXttreb12 |    .000018   1.10e-06    16.37   0.000     .0000158    .0000202
   _SstaXttreb13 |   .0000129   1.16e-06    11.03   0.000     .0000105    .0000152
   _SstaXttreb15 |  -6.47e-07   1.42e-06    -0.45   0.652    -3.51e-06    2.21e-06
   _SstaXttreb16 |  -3.90e-06   1.32e-06    -2.96   0.005    -6.54e-06   -1.25e-06
   _SstaXttreb18 |   2.00e-06   8.18e-07     2.44   0.018     3.53e-07    3.64e-06
   _SstaXttreb19 |   6.87e-07   1.45e-06     0.47   0.638    -2.23e-06    3.61e-06
   _SstaXttreb20 |  -2.56e-06   7.20e-07    -3.55   0.001    -4.01e-06   -1.11e-06
   _SstaXttreb21 |  -5.21e-06   4.91e-07   -10.62   0.000    -6.20e-06   -4.23e-06
   _SstaXttreb22 |   3.63e-06   1.33e-06     2.74   0.009     9.66e-07    6.30e-06
   _SstaXttreb23 |   7.80e-06   1.60e-06     4.86   0.000     4.58e-06     .000011
   _SstaXttreb24 |   6.75e-06   6.78e-07     9.95   0.000     5.38e-06    8.11e-06
   _SstaXttreb25 |   8.10e-06   8.42e-07     9.62   0.000     6.41e-06    9.80e-06
   _SstaXttreb26 |   2.45e-06   2.59e-07     9.44   0.000     1.93e-06    2.97e-06
   _SstaXttreb27 |   2.60e-06   6.34e-07     4.11   0.000     1.33e-06    3.88e-06
   _SstaXttreb28 |   .0000141   2.34e-06     6.03   0.000     9.41e-06    .0000188
   _SstaXttreb29 |  -9.13e-06   6.75e-07   -13.52   0.000    -.0000105   -7.77e-06
   _SstaXttreb30 |   8.49e-06   8.54e-07     9.95   0.000     6.77e-06    .0000102
   _SstaXttreb31 |  -5.27e-06   9.75e-07    -5.41   0.000    -7.23e-06   -3.32e-06
   _SstaXttreb32 |   .0000103   1.03e-06    10.05   0.000     8.28e-06    .0000124
   _SstaXttreb33 |   4.07e-06   1.36e-06     2.99   0.004     1.33e-06    6.81e-06
   _SstaXttreb34 |   8.68e-06   1.08e-06     8.03   0.000     6.51e-06    .0000109
   _SstaXttreb35 |  -.0000146   5.59e-07   -26.03   0.000    -.0000157   -.0000134
   _SstaXttreb36 |   4.19e-06   6.82e-07     6.14   0.000     2.82e-06    5.56e-06
   _SstaXttreb37 |   9.85e-06   5.66e-07    17.40   0.000     8.72e-06     .000011
   _SstaXttreb38 |  -1.81e-06   9.22e-07    -1.96   0.055    -3.66e-06    4.27e-08
   _SstaXttreb39 |   3.87e-07   7.97e-07     0.49   0.629    -1.21e-06    1.99e-06
   _SstaXttreb40 |   3.76e-06   9.27e-07     4.06   0.000     1.90e-06    5.63e-06
   _SstaXttreb41 |  -3.29e-06   8.47e-07    -3.89   0.000    -5.00e-06   -1.59e-06
   _SstaXttreb42 |  -1.48e-06   7.94e-07    -1.87   0.068    -3.08e-06    1.14e-07
   _SstaXttreb44 |   5.14e-06   1.11e-06     4.65   0.000     2.92e-06    7.36e-06
   _SstaXttreb45 |   .0000101   1.35e-06     7.48   0.000     7.40e-06    .0000128
   _SstaXttreb46 |  -8.33e-06   6.87e-07   -12.14   0.000    -9.71e-06   -6.95e-06
   _SstaXttreb47 |   7.68e-06   1.27e-06     6.05   0.000     5.13e-06    .0000102
   _SstaXttreb48 |   8.13e-06   3.38e-06     2.40   0.020     1.33e-06    .0000149
   _SstaXttreb49 |  -8.78e-06   9.87e-07    -8.89   0.000    -.0000108   -6.79e-06
   _SstaXttreb50 |   2.72e-06   8.85e-07     3.07   0.004     9.37e-07    4.49e-06
   _SstaXttreb51 |   .0000125   6.07e-07    20.57   0.000     .0000113    .0000137
   _SstaXttreb53 |  -9.57e-08   7.54e-07    -0.13   0.900    -1.61e-06    1.42e-06
   _SstaXttreb54 |   4.01e-06   7.40e-07     5.41   0.000     2.52e-06    5.49e-06
   _SstaXttreb55 |  -3.54e-06   1.17e-06    -3.04   0.004    -5.89e-06   -1.20e-06
   _SstaXttreb56 |  -8.31e-06   1.03e-06    -8.05   0.000    -.0000104   -6.23e-06
   _TgroXttren_1 |  -.0112871   .0024096    -4.68   0.000    -.0161293   -.0064449
   _TgroXttren_2 |   .0029425   .0023899     1.23   0.224      -.00186    .0077451
   _TgroXttren_3 |  -.0028298   .0034591    -0.82   0.417    -.0097812    .0041216
   _TgroXttren_4 |   .0072386   .0035266     2.05   0.045     .0001516    .0143256
   _TgroXttren_5 |  -.0026406   .0012591    -2.10   0.041    -.0051709   -.0001102
   _TgroXttren_7 |   .0087465   .0013246     6.60   0.000     .0060847    .0114084
   _TgroXttren_8 |   .0151419   .0013402    11.30   0.000     .0124487     .017835
   _TgroXttrena1 |   .0007741   .0002187     3.54   0.001     .0003346    .0012135
   _TgroXttrena2 |  -.0000623   .0001848    -0.34   0.738    -.0004336    .0003091
   _TgroXttrena3 |   .0007268   .0002628     2.76   0.008     .0001985     .001255
   _TgroXttrena4 |  -.0002015   .0002374    -0.85   0.400    -.0006786    .0002755
   _TgroXttrena5 |   .0001965   .0000953     2.06   0.045     4.89e-06    .0003881
   _TgroXttrena7 |  -.0001656   .0000842    -1.97   0.055    -.0003347    3.63e-06
   _TgroXttrena8 |  -.0008038   .0001021    -7.88   0.000    -.0010089   -.0005987
   _TgroXttrenb1 |  -.0000168   5.27e-06    -3.18   0.003    -.0000274   -6.18e-06
   _TgroXttrenb2 |  -6.13e-07   3.94e-06    -0.16   0.877    -8.54e-06    7.31e-06
   _TgroXttrenb3 |  -.0000183   5.47e-06    -3.34   0.002    -.0000293   -7.29e-06
   _TgroXttrenb4 |   1.38e-06   4.73e-06     0.29   0.772    -8.12e-06    .0000109
   _TgroXttrenb5 |  -6.69e-06   2.15e-06    -3.11   0.003     -.000011   -2.37e-06
   _TgroXttrenb7 |  -1.39e-06   1.64e-06    -0.84   0.403    -4.69e-06    1.92e-06
   _TgroXttrenb8 |    .000014   2.20e-06     6.37   0.000     9.58e-06    .0000184
           _cons |   .2486956   .0216448    11.49   0.000     .2051988    .2921924
----------------------------------------------------------------------------------

. estimates store empd ;

. quietly reg empdhi $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdhi ;

. quietly reg empdlg $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdlg ;

. * note group health coverage and pension are conditional on being asked the question ;
. quietly reg ph $controls [pw=wtsupp], cluster(statefip) ;

. estimates store ph ;

. quietly reg lrhw $controls [pw=wtsupp] if hwagesamp==1, cluster(statefip) ;

. estimates store lrhw ;

. ****** ESTIMATES WITH PRO TESTING DUMMY ONLY ******* ;
. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) se(%7.3f) ;

----------------------------------------------------------------
    Variable |  empd     empdhi    empdlg      ph       lrhw    
-------------+--------------------------------------------------
  _Pgroup8_1 |  -0.290     0.156    -0.217    -0.072    -0.361  
             |   0.008     0.015     0.072     0.011     0.013  
  _Pgroup8_2 |  -0.158     0.096     0.154    -0.004    -0.131  
             |   0.010     0.013     0.107     0.009     0.013  
  _Pgroup8_3 |  -0.462    -0.030    -0.105    -0.187    -0.648  
             |   0.010     0.012     0.068     0.008     0.012  
  _Pgroup8_4 |  -0.198    -0.083     0.430    -0.023    -0.322  
             |   0.016     0.013     0.065     0.010     0.014  
  _Pgroup8_5 |  -0.037     0.157    -0.067    -0.019    -0.115  
             |   0.005     0.006     0.037     0.003     0.005  
  _Pgroup8_7 |  -0.289    -0.050    -0.141    -0.206    -0.585  
             |   0.006     0.007     0.040     0.005     0.004  
  _Pgroup8_8 |  -0.192    -0.185    -0.112    -0.124    -0.362  
             |   0.005     0.008     0.033     0.004     0.006  
 _PgroXpro_1 |  -0.005     0.039     0.046     0.043     0.036  
             |   0.014     0.021     0.012     0.011     0.016  
 _PgroXpro_2 |  -0.003    -0.008     0.015     0.024     0.007  
             |   0.011     0.022     0.016     0.013     0.016  
 _PgroXpro_3 |   0.015     0.011     0.006     0.044     0.015  
             |   0.015     0.020     0.013     0.010     0.013  
 _PgroXpro_4 |  -0.018     0.005    -0.007    -0.001    -0.008  
             |   0.012     0.015     0.011     0.011     0.014  
 _PgroXpro_5 |   0.002     0.015     0.007     0.013     0.015  
             |   0.007     0.009     0.005     0.005     0.007  
 _PgroXpro_7 |  -0.010    -0.010    -0.004    -0.006    -0.001  
             |   0.011     0.010     0.008     0.011     0.008  
 _PgroXpro_8 |  -0.002    -0.008    -0.012    -0.006    -0.004  
             |   0.007     0.008     0.005     0.006     0.007  
         pro |   0.012    -0.010     0.005     0.005     0.024  
             |   0.006     0.010     0.007     0.011     0.008  
         age |   0.039     0.024    -0.002     0.049     0.090  
             |   0.001     0.001     0.001     0.001     0.002  
        age2 |  -0.000    -0.000     0.000    -0.001    -0.001  
             |   0.000     0.000     0.000     0.000     0.000  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |    empd        empdhi       empdlg         ph          lrhw     
-------------+-----------------------------------------------------------------
  _Pgroup8_1 |  -0.290***     0.156***    -0.217**     -0.072***    -0.361***  
  _Pgroup8_2 |  -0.158***     0.096***     0.154       -0.004       -0.131***  
  _Pgroup8_3 |  -0.462***    -0.030*      -0.105       -0.187***    -0.648***  
  _Pgroup8_4 |  -0.198***    -0.083***     0.430***    -0.023*      -0.322***  
  _Pgroup8_5 |  -0.037***     0.157***    -0.067       -0.019***    -0.115***  
  _Pgroup8_7 |  -0.289***    -0.050***    -0.141**     -0.206***    -0.585***  
  _Pgroup8_8 |  -0.192***    -0.185***    -0.112**     -0.124***    -0.362***  
 _PgroXpro_1 |  -0.005        0.039        0.046***     0.043***     0.036*    
 _PgroXpro_2 |  -0.003       -0.008        0.015        0.024        0.007     
 _PgroXpro_3 |   0.015        0.011        0.006        0.044***     0.015     
 _PgroXpro_4 |  -0.018        0.005       -0.007       -0.001       -0.008     
 _PgroXpro_5 |   0.002        0.015        0.007        0.013*       0.015*    
 _PgroXpro_7 |  -0.010       -0.010       -0.004       -0.006       -0.001     
 _PgroXpro_8 |  -0.002       -0.008       -0.012*      -0.006       -0.004     
         pro |   0.012       -0.010        0.005        0.005        0.024**   
         age |   0.039***     0.024***    -0.002**      0.049***     0.090***  
        age2 |  -0.000***    -0.000***     0.000***    -0.001***    -0.001***  
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. macro drop all ;

. estimates clear ;

. global controls _P* _A* pro anti age age2
>   eg* minwage unemploymentrate incarcr
>   tt* _S* _T* ;

. unab avars: _A* ;

.     global outvars `pvars' `avars' pro anti age age2 ;

. summ $outvars year ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  _Pgroup8_1 |  2,390,339    .0297841    .1699911          0          1
  _Pgroup8_2 |  2,390,339    .0187727    .1357212          0          1
  _Pgroup8_3 |  2,390,339    .0368178    .1883142          0          1
  _Pgroup8_4 |  2,390,339    .0272304    .1627543          0          1
  _Pgroup8_5 |  2,390,339    .2011045    .4008261          0          1
-------------+---------------------------------------------------------
  _Pgroup8_7 |  2,390,339    .2112822    .4082182          0          1
  _Pgroup8_8 |  2,390,339    .2430797     .428943          0          1
 _PgroXpro_1 |  2,390,339    .0051641     .071676          0          1
 _PgroXpro_2 |  2,390,339     .003269    .0570816          0          1
 _PgroXpro_3 |  2,390,339    .0059569    .0769507          0          1
-------------+---------------------------------------------------------
 _PgroXpro_4 |  2,390,339    .0052725    .0724201          0          1
 _PgroXpro_5 |  2,390,339    .0183074    .1340608          0          1
 _PgroXpro_7 |  2,390,339    .0177519    .1320483          0          1
 _PgroXpro_8 |  2,390,339    .0268585    .1616699          0          1
_AgroXanti_1 |  2,390,339    .0006413    .0253164          0          1
-------------+---------------------------------------------------------
_AgroXanti_2 |  2,390,339    .0005598    .0236525          0          1
_AgroXanti_3 |  2,390,339    .0006823    .0261125          0          1
_AgroXanti_4 |  2,390,339     .000753    .0274311          0          1
_AgroXanti_5 |  2,390,339    .0088305    .0935552          0          1
_AgroXanti_7 |  2,390,339    .0079441    .0887748          0          1
-------------+---------------------------------------------------------
_AgroXanti_8 |  2,390,339    .0147795    .1206692          0          1
         pro |  2,390,339    .1060992    .3079646          0          1
        anti |  2,390,339     .046698    .2109912          0          1
         age |  2,390,339    36.07595    10.56432         18         55
        age2 |  2,390,339    1413.079    771.6311        324       3025
-------------+---------------------------------------------------------
        year |  2,390,339    1995.548    9.271415       1980       2010

. summ empd empdhi inclughr pensionr lrhw if pro==0 & anti==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |  2,024,702    .7597034    .4272637          0          1
      empdhi |  1,538,173    .2813019    .4496346          0          1
    inclughr |  1,699,419    .5543489    .4970376          0          1
    pensionr |  1,699,417    .5451758    .4979551          0          1
        lrhw |  1,592,752    2.467978    .7879602  -8.419633   10.49622

.   reg empd $controls [pw=wtsupp], cluster(statefip) ;
(sum of wgt is 3,854,608,510)

Linear regression                               Number of obs     =  2,355,785
                                                F(44, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0862
                                                Root MSE          =     .41061

                                  (Std. Err. adjusted for 50 clusters in statefip)
----------------------------------------------------------------------------------
                 |               Robust
            empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
      _Pgroup8_1 |  -.2903408   .0083724   -34.68   0.000    -.3071657   -.2735159
      _Pgroup8_2 |  -.1586192   .0103082   -15.39   0.000    -.1793343   -.1379041
      _Pgroup8_3 |  -.4622743   .0102543   -45.08   0.000     -.482881   -.4416676
      _Pgroup8_4 |  -.1978722     .01592   -12.43   0.000    -.2298647   -.1658797
      _Pgroup8_5 |  -.0365302   .0046568    -7.84   0.000    -.0458883   -.0271721
      _Pgroup8_7 |  -.2896588   .0061602   -47.02   0.000    -.3020382   -.2772794
      _Pgroup8_8 |  -.1921542   .0046423   -41.39   0.000    -.2014833   -.1828252
     _PgroXpro_1 |  -.0058903   .0137475    -0.43   0.670    -.0335169    .0217363
     _PgroXpro_2 |  -.0038112   .0108297    -0.35   0.726    -.0255743    .0179518
     _PgroXpro_3 |   .0149507   .0154063     0.97   0.337    -.0160093    .0459108
     _PgroXpro_4 |  -.0177933   .0124594    -1.43   0.160    -.0428314    .0072448
     _PgroXpro_5 |   .0017206   .0072168     0.24   0.813     -.012782    .0162233
     _PgroXpro_7 |  -.0103759   .0112726    -0.92   0.362    -.0330291    .0122772
     _PgroXpro_8 |  -.0010627   .0067539    -0.16   0.876    -.0146351    .0125097
    _AgroXanti_1 |  -.0273283   .0389229    -0.70   0.486    -.1055469    .0508903
    _AgroXanti_2 |  -.0199326   .0139299    -1.43   0.159    -.0479258    .0080605
    _AgroXanti_3 |    .015579   .0213031     0.73   0.468    -.0272312    .0583891
    _AgroXanti_4 |   .0232358   .0156084     1.49   0.143    -.0081305    .0546021
    _AgroXanti_5 |   .0025033   .0054418     0.46   0.648    -.0084324    .0134391
    _AgroXanti_7 |  -.0119635   .0067901    -1.76   0.084    -.0256088    .0016817
    _AgroXanti_8 |   .0087067   .0091385     0.95   0.345    -.0096579    .0270713
             pro |   .0119139   .0065136     1.83   0.073    -.0011756    .0250035
            anti |   .0119767    .003854     3.11   0.003     .0042317    .0197217
             age |   .0389778   .0009624    40.50   0.000     .0370437    .0409119
            age2 |  -.0004869   .0000119   -40.78   0.000    -.0005109   -.0004629
           eg200 |   .0054341   .0036706     1.48   0.145    -.0019422    .0128105
           eg300 |  -.0438269   .0088479    -4.95   0.000    -.0616075   -.0260463
           eg400 |  -.0574466   .0161825    -3.55   0.001    -.0899665   -.0249267
           eg500 |  -.0127106   .0107568    -1.18   0.243    -.0343273     .008906
           eg900 |   .0732084   .0453574     1.61   0.113    -.0179407    .1643574
         minwage |    .004385   .0012264     3.58   0.001     .0019203    .0068496
unemploymentrate |  -.0114044   .0006452   -17.68   0.000    -.0127009   -.0101078
         incarcr |  -.4402119   1.390289    -0.32   0.753    -3.234103    2.353679
          ttrend |  -.0015527   .0007468    -2.08   0.043    -.0030535   -.0000519
         ttrend2 |  -.0000105   .0000546    -0.19   0.848    -.0001203    .0000993
         ttrend3 |  -5.32e-07   1.38e-06    -0.38   0.702    -3.31e-06    2.25e-06
    _Sstatefip_1 |   .0129635   .0059183     2.19   0.033     .0010702    .0248568
    _Sstatefip_2 |  -.0196882   .0057954    -3.40   0.001    -.0313345   -.0080419
    _Sstatefip_4 |  -.0013762   .0048106    -0.29   0.776    -.0110434    .0082911
    _Sstatefip_5 |  -.0048899   .0029836    -1.64   0.108    -.0108857    .0011059
    _Sstatefip_6 |   .0105637   .0017924     5.89   0.000     .0069617    .0141656
    _Sstatefip_8 |   .0057697   .0022427     2.57   0.013     .0012629    .0102765
    _Sstatefip_9 |   -.012647   .0030781    -4.11   0.000    -.0188327   -.0064613
   _Sstatefip_10 |   -.025055   .0054464    -4.60   0.000        -.036     -.01411
   _Sstatefip_12 |  -.0129765   .0058628    -2.21   0.032    -.0247582   -.0011947
   _Sstatefip_13 |   .0159665   .0059437     2.69   0.010     .0040222    .0279107
   _Sstatefip_15 |   -.026591   .0028357    -9.38   0.000    -.0322897   -.0208924
   _Sstatefip_16 |  -.0508209   .0030283   -16.78   0.000    -.0569066   -.0447352
   _Sstatefip_18 |  -.0013846   .0020531    -0.67   0.503    -.0055104    .0027413
   _Sstatefip_19 |  -.0478691   .0035665   -13.42   0.000    -.0550361    -.040702
   _Sstatefip_20 |  -.0127597   .0026971    -4.73   0.000    -.0181798   -.0073396
   _Sstatefip_21 |    .015836   .0009491    16.69   0.000     .0139288    .0177433
   _Sstatefip_22 |   .0227766   .0055192     4.13   0.000     .0116855    .0338678
   _Sstatefip_23 |  -.0467503   .0018894   -24.74   0.000    -.0505472   -.0429534
   _Sstatefip_24 |  -.0016273   .0033764    -0.48   0.632    -.0084123    .0051578
   _Sstatefip_25 |  -.0183982   .0030074    -6.12   0.000    -.0244419   -.0123545
   _Sstatefip_26 |   .0116073   .0029826     3.89   0.000     .0056135     .017601
   _Sstatefip_27 |  -.0121512    .002866    -4.24   0.000    -.0179106   -.0063917
   _Sstatefip_28 |   .0278677   .0054612     5.10   0.000     .0168929    .0388424
   _Sstatefip_29 |  -.0000331   .0015076    -0.02   0.983    -.0030628    .0029966
   _Sstatefip_30 |  -.0667086   .0020364   -32.76   0.000     -.070801   -.0626163
   _Sstatefip_31 |  -.0391828    .002433   -16.10   0.000    -.0440722   -.0342935
   _Sstatefip_32 |    .022748   .0043502     5.23   0.000     .0140058    .0314901
   _Sstatefip_33 |  -.0069402   .0033977    -2.04   0.046    -.0137681   -.0001124
   _Sstatefip_34 |  -.0141329   .0017092    -8.27   0.000    -.0175677    -.010698
   _Sstatefip_35 |  -.0057965   .0019484    -2.98   0.005     -.009712    -.001881
   _Sstatefip_36 |  -.0184439    .001454   -12.69   0.000    -.0213658    -.015522
   _Sstatefip_37 |  -.0044299   .0053372    -0.83   0.411    -.0151553    .0062955
   _Sstatefip_38 |  -.0694522   .0029128   -23.84   0.000    -.0753058   -.0635987
   _Sstatefip_39 |  -.0002863   .0029033    -0.10   0.922    -.0061208    .0055481
   _Sstatefip_40 |   .0039796   .0031714     1.25   0.215    -.0023936    .0103528
   _Sstatefip_41 |  -.0319453   .0015553   -20.54   0.000    -.0350708   -.0288198
   _Sstatefip_42 |  -.0245536    .001197   -20.51   0.000    -.0269591   -.0221482
   _Sstatefip_44 |    .000682   .0018564     0.37   0.715    -.0030485    .0044125
   _Sstatefip_45 |   .0033864   .0090499     0.37   0.710       -.0148    .0215729
   _Sstatefip_46 |  -.0522136   .0029105   -17.94   0.000    -.0580625   -.0463647
   _Sstatefip_47 |   -.012433   .0042664    -2.91   0.005    -.0210066   -.0038595
   _Sstatefip_48 |   .0067073   .0046178     1.45   0.153    -.0025725    .0159872
   _Sstatefip_49 |  -.0356211    .003198   -11.14   0.000    -.0420476   -.0291945
   _Sstatefip_50 |   -.038813   .0023099   -16.80   0.000     -.043455   -.0341709
   _Sstatefip_51 |  -.0191415   .0028009    -6.83   0.000      -.02477   -.0135129
   _Sstatefip_53 |  -.0116213   .0023098    -5.03   0.000     -.016263   -.0069796
   _Sstatefip_54 |  -.0075267   .0019413    -3.88   0.000    -.0114279   -.0036255
   _Sstatefip_55 |  -.0268255   .0009808   -27.35   0.000    -.0287965   -.0248544
   _Sstatefip_56 |   -.014031   .0032525    -4.31   0.000    -.0205672   -.0074948
   _SstaXgro_1_1 |   .0786936   .0070496    11.16   0.000     .0645269    .0928603
   _SstaXgro_1_2 |   .0370713   .0063062     5.88   0.000     .0243986     .049744
   _SstaXgro_1_3 |   .0499923   .0077355     6.46   0.000     .0344473    .0655374
   _SstaXgro_1_4 |   .0277857    .007562     3.67   0.001     .0125892    .0429822
   _SstaXgro_1_5 |  -.0016612    .004026    -0.41   0.682    -.0097518    .0064295
   _SstaXgro_1_7 |  -.0735404   .0055941   -13.15   0.000     -.084782   -.0622987
   _SstaXgro_1_8 |  -.0237368   .0038664    -6.14   0.000    -.0315066   -.0159671
   _SstaXgro_2_1 |   .2686137   .0035203    76.30   0.000     .2615393    .2756881
   _SstaXgro_2_2 |   .1399652   .0035868    39.02   0.000     .1327573    .1471732
   _SstaXgro_2_3 |   .2382361   .0039066    60.98   0.000     .2303856    .2460867
   _SstaXgro_2_4 |   .0363151   .0045787     7.93   0.000     .0271138    .0455164
   _SstaXgro_2_5 |  -.0627365    .002298   -27.30   0.000    -.0673544   -.0581185
   _SstaXgro_2_7 |  -.0109912    .003261    -3.37   0.001    -.0175444   -.0044379
   _SstaXgro_2_8 |   .0049768   .0022093     2.25   0.029     .0005369    .0094166
   _SstaXgro_4_1 |   .1049464   .0085109    12.33   0.000     .0878431    .1220498
   _SstaXgro_4_2 |   .0942281   .0068319    13.79   0.000     .0804988    .1079574
   _SstaXgro_4_3 |   .1177997   .0099519    11.84   0.000     .0978006    .1377987
   _SstaXgro_4_4 |   .0530436   .0086948     6.10   0.000     .0355709    .0705164
   _SstaXgro_4_5 |  -.0010166   .0043896    -0.23   0.818    -.0098378    .0078047
   _SstaXgro_4_7 |  -.0149835   .0063069    -2.38   0.021    -.0276577   -.0023092
   _SstaXgro_4_8 |  -.0326152   .0042273    -7.72   0.000    -.0411103   -.0241202
   _SstaXgro_5_1 |   .0924408   .0041189    22.44   0.000     .0841635     .100718
   _SstaXgro_5_2 |   .0122357    .003741     3.27   0.002     .0047179    .0197535
   _SstaXgro_5_3 |   .0580394   .0047366    12.25   0.000     .0485208     .067558
   _SstaXgro_5_4 |   .0106823   .0048029     2.22   0.031     .0010306    .0203341
   _SstaXgro_5_5 |  -.0074447   .0024675    -3.02   0.004    -.0124033   -.0024861
   _SstaXgro_5_7 |   -.028045   .0034458    -8.14   0.000    -.0349696   -.0211204
   _SstaXgro_5_8 |  -.0004726    .002375    -0.20   0.843    -.0052453    .0043001
   _SstaXgro_6_1 |   .0793538   .0002515   315.55   0.000     .0788484    .0798592
   _SstaXgro_6_2 |   .0656397   .0002178   301.39   0.000      .065202    .0660773
   _SstaXgro_6_3 |   .0536461   .0003647   147.08   0.000     .0529132    .0543791
   _SstaXgro_6_4 |   .0219998   .0003197    68.81   0.000     .0213573    .0226423
   _SstaXgro_6_5 |  -.0309847   .0004124   -75.14   0.000    -.0318134    -.030156
   _SstaXgro_6_7 |   -.041275   .0003177  -129.93   0.000    -.0419134   -.0406366
   _SstaXgro_6_8 |  -.0097991   .0000586  -167.23   0.000    -.0099169   -.0096814
   _SstaXgro_8_1 |   .1260884   .0004881   258.31   0.000     .1251075    .1270693
   _SstaXgro_8_2 |   .0735265   .0004668   157.50   0.000     .0725884    .0744647
   _SstaXgro_8_3 |   .1231982    .000552   223.19   0.000     .1220889    .1243075
   _SstaXgro_8_4 |   .0005433   .0004567     1.19   0.240    -.0003745     .001461
   _SstaXgro_8_5 |    .018089   .0003933    45.99   0.000     .0172986    .0188793
   _SstaXgro_8_7 |   .0143779   .0003914    36.74   0.000     .0135914    .0151643
   _SstaXgro_8_8 |  -.0083628   .0001746   -47.90   0.000    -.0087136    -.008012
   _SstaXgro_9_1 |   .1877886   .0212034     8.86   0.000     .1451787    .2303984
   _SstaXgro_9_2 |   .0722605   .0080254     9.00   0.000     .0561329     .088388
   _SstaXgro_9_3 |   .1666543   .0107186    15.55   0.000     .1451145    .1881941
   _SstaXgro_9_4 |   .0424433   .0102946     4.12   0.000     .0217555     .063131
   _SstaXgro_9_5 |   .0168086    .002431     6.91   0.000     .0119233    .0216939
   _SstaXgro_9_7 |   .0482165   .0026092    18.48   0.000     .0429732    .0534598
   _SstaXgro_9_8 |  -.0052959   .0049675    -1.07   0.292    -.0152785    .0046866
  _SstaXgro_10_1 |   .1641547   .0013559   121.07   0.000       .16143    .1668794
  _SstaXgro_10_2 |   .0785546   .0018859    41.65   0.000     .0747647    .0823444
  _SstaXgro_10_3 |    .182907   .0012047   151.82   0.000      .180486     .185328
  _SstaXgro_10_4 |   .0374203   .0014399    25.99   0.000     .0345266    .0403139
  _SstaXgro_10_5 |   .0153441   .0007717    19.88   0.000     .0137933     .016895
  _SstaXgro_10_7 |   .0193217   .0008023    24.08   0.000     .0177094    .0209341
  _SstaXgro_10_8 |  -.0122405   .0007071   -17.31   0.000    -.0136614   -.0108195
  _SstaXgro_12_1 |    .182246   .0053611    33.99   0.000     .1714725    .1930195
  _SstaXgro_12_2 |   .0814463   .0048397    16.83   0.000     .0717206     .091172
  _SstaXgro_12_3 |   .1182786   .0059294    19.95   0.000      .106363    .1301942
  _SstaXgro_12_4 |   .0569675   .0060326     9.44   0.000     .0448447    .0690904
  _SstaXgro_12_5 |   .0144496   .0030786     4.69   0.000     .0082629    .0206363
  _SstaXgro_12_7 |   .0081602   .0043312     1.88   0.066    -.0005437    .0168641
  _SstaXgro_12_8 |  -.0095744   .0029945    -3.20   0.002    -.0155921   -.0035566
  _SstaXgro_13_1 |   .1523287   .0064573    23.59   0.000     .1393522    .1653052
  _SstaXgro_13_2 |   .0614432   .0057226    10.74   0.000     .0499432    .0729433
  _SstaXgro_13_3 |   .1020265   .0072789    14.02   0.000     .0873991    .1166539
  _SstaXgro_13_4 |   .0474273   .0070411     6.74   0.000     .0332777    .0615768
  _SstaXgro_13_5 |   .0113656   .0037299     3.05   0.004       .00387    .0188611
  _SstaXgro_13_7 |  -.0290262   .0052739    -5.50   0.000    -.0396245    -.018428
  _SstaXgro_13_8 |  -.0333269   .0035178    -9.47   0.000    -.0403961   -.0262576
  _SstaXgro_15_1 |    .358756   .0011374   315.43   0.000     .3564704    .3610416
  _SstaXgro_15_2 |   .1194754   .0006308   189.39   0.000     .1182077    .1207431
  _SstaXgro_15_3 |   .0860179   .0011217    76.69   0.000     .0837638     .088272
  _SstaXgro_15_4 |  -.0783104   .0010937   -71.60   0.000    -.0805083   -.0761125
  _SstaXgro_15_5 |   -.006316   .0003552   -17.78   0.000    -.0070299   -.0056021
  _SstaXgro_15_7 |   .0011952   .0003275     3.65   0.001     .0005371    .0018533
  _SstaXgro_15_8 |   .0312896   .0000828   378.04   0.000     .0311233     .031456
  _SstaXgro_16_1 |   .2029111   .0074818    27.12   0.000     .1878758    .2179464
  _SstaXgro_16_2 |  -.0265187   .0054171    -4.90   0.000    -.0374047   -.0156327
  _SstaXgro_16_3 |  -.0031774   .0080039    -0.40   0.693    -.0192618    .0129069
  _SstaXgro_16_4 |  -.0294227   .0070905    -4.15   0.000    -.0436715   -.0151739
  _SstaXgro_16_5 |  -.0014108   .0033565    -0.42   0.676     -.008156    .0053344
  _SstaXgro_16_7 |   .0296941   .0047095     6.31   0.000       .02023    .0391583
  _SstaXgro_16_8 |  -.0167657   .0032861    -5.10   0.000    -.0233694   -.0101619
  _SstaXgro_18_1 |   .0378051   .0003784    99.92   0.000     .0370447    .0385654
  _SstaXgro_18_2 |  -.0017603   .0004299    -4.09   0.000    -.0026243   -.0008964
  _SstaXgro_18_3 |   .1030008   .0002811   366.46   0.000     .1024359    .1035656
  _SstaXgro_18_4 |  -.0022381   .0004052    -5.52   0.000    -.0030525   -.0014238
  _SstaXgro_18_5 |  -.0024378   .0002035   -11.98   0.000    -.0028468   -.0020288
  _SstaXgro_18_7 |  -.0126981   .0002521   -50.36   0.000    -.0132048   -.0121914
  _SstaXgro_18_8 |  -.0042018   .0001454   -28.90   0.000     -.004494   -.0039096
  _SstaXgro_19_1 |   .0223179   .0074853     2.98   0.004     .0072755    .0373602
  _SstaXgro_19_2 |   .0202114   .0062994     3.21   0.002     .0075522    .0328705
  _SstaXgro_19_3 |   .0538342   .0076419     7.04   0.000     .0384773    .0691912
  _SstaXgro_19_4 |  -.0536419   .0075089    -7.14   0.000    -.0687315   -.0385523
  _SstaXgro_19_5 |   .0167879   .0037499     4.48   0.000     .0092522    .0243236
  _SstaXgro_19_7 |   .0542165   .0052839    10.26   0.000     .0435981    .0648349
  _SstaXgro_19_8 |   .0253562   .0037627     6.74   0.000     .0177948    .0329177
  _SstaXgro_20_1 |    .095458   .0002733   349.31   0.000     .0949088    .0960071
  _SstaXgro_20_2 |   .0495475   .0003142   157.70   0.000     .0489161    .0501788
  _SstaXgro_20_3 |   .0912344   .0002387   382.27   0.000     .0907548     .091714
  _SstaXgro_20_4 |   -.036054   .0005088   -70.86   0.000    -.0370764   -.0350316
  _SstaXgro_20_5 |   .0082864   .0001122    73.87   0.000      .008061    .0085119
  _SstaXgro_20_7 |   .0204852   .0001679   121.99   0.000     .0201478    .0208227
  _SstaXgro_20_8 |  -.0042545   .0000595   -71.51   0.000    -.0043741    -.004135
  _SstaXgro_21_1 |   .0878286   .0006594   133.19   0.000     .0865035    .0891538
  _SstaXgro_21_2 |    .019802   .0008598    23.03   0.000     .0180741    .0215298
  _SstaXgro_21_3 |   .0957882   .0003869   247.56   0.000     .0950106    .0965657
  _SstaXgro_21_4 |   .0068998     .00057    12.10   0.000     .0057543    .0080453
  _SstaXgro_21_5 |  -.0520954   .0002443  -213.23   0.000    -.0525864   -.0516045
  _SstaXgro_21_7 |  -.0857331   .0002946  -290.98   0.000    -.0863252    -.085141
  _SstaXgro_21_8 |   .0069893   .0001042    67.11   0.000       .00678    .0071987
  _SstaXgro_22_1 |   .0619982   .0036398    17.03   0.000     .0546838    .0693126
  _SstaXgro_22_2 |  -.0023494   .0031469    -0.75   0.459    -.0086734    .0039746
  _SstaXgro_22_3 |   .0193439   .0038108     5.08   0.000     .0116858     .027002
  _SstaXgro_22_4 |   .0101951   .0039108     2.61   0.012     .0023361    .0180541
  _SstaXgro_22_5 |  -.0125455    .001907    -6.58   0.000    -.0163777   -.0087133
  _SstaXgro_22_7 |  -.1009221   .0026626   -37.90   0.000    -.1062727   -.0955715
  _SstaXgro_22_8 |  -.0389371   .0018705   -20.82   0.000    -.0426959   -.0351783
  _SstaXgro_23_1 |    .348256   .0108264    32.17   0.000     .3264994    .3700125
  _SstaXgro_23_2 |   .1785095   .0063412    28.15   0.000     .1657664    .1912525
  _SstaXgro_23_3 |   .1764848   .0099643    17.71   0.000     .1564609    .1965088
  _SstaXgro_23_4 |  -.0844107   .0088224    -9.57   0.000      -.10214   -.0666814
  _SstaXgro_23_5 |  -.0305047   .0016366   -18.64   0.000    -.0337936   -.0272158
  _SstaXgro_23_7 |   .0135547   .0017571     7.71   0.000     .0100236    .0170857
  _SstaXgro_23_8 |   .0275252   .0031145     8.84   0.000     .0212663    .0337841
  _SstaXgro_24_1 |   .1330563   .0005253   253.28   0.000     .1320006     .134112
  _SstaXgro_24_2 |   .0722309   .0006415   112.59   0.000     .0709417    .0735201
  _SstaXgro_24_3 |   .1611325    .000271   594.57   0.000     .1605879    .1616771
  _SstaXgro_24_4 |   .0751637   .0003524   213.32   0.000     .0744556    .0758718
  _SstaXgro_24_5 |   .0012221   .0002183     5.60   0.000     .0007834    .0016609
  _SstaXgro_24_7 |  -.0006035   .0001739    -3.47   0.001    -.0009531    -.000254
  _SstaXgro_24_8 |  -.0119119   .0000905  -131.69   0.000    -.0120937   -.0117302
  _SstaXgro_25_1 |   .1431221   .0010789   132.65   0.000     .1409539    .1452902
  _SstaXgro_25_2 |   .0223995   .0009545    23.47   0.000     .0204812    .0243177
  _SstaXgro_25_3 |   .0791385    .000677   116.90   0.000      .077778    .0804989
  _SstaXgro_25_4 |   .0364841   .0006527    55.89   0.000     .0351724    .0377959
  _SstaXgro_25_5 |  -.0145548    .000098  -148.52   0.000    -.0147517   -.0143579
  _SstaXgro_25_7 |   .0247411   .0001282   192.93   0.000     .0244834    .0249988
  _SstaXgro_25_8 |   .0229118   .0000651   351.71   0.000     .0227809    .0230427
  _SstaXgro_26_1 |   .0006714   .0002235     3.00   0.004     .0002223    .0011206
  _SstaXgro_26_2 |   .0041917   .0003057    13.71   0.000     .0035774    .0048059
  _SstaXgro_26_3 |   .0078915   .0001718    45.92   0.000     .0075462    .0082369
  _SstaXgro_26_4 |  -.0206614    .000219   -94.32   0.000    -.0211016   -.0202212
  _SstaXgro_26_5 |   -.032212   .0000883  -364.62   0.000    -.0323895   -.0320345
  _SstaXgro_26_7 |  -.0232835   .0001142  -203.89   0.000    -.0235129    -.023054
  _SstaXgro_26_8 |   .0023972   .0000712    33.69   0.000     .0022542    .0025402
  _SstaXgro_27_1 |   .1531813   .0281012     5.45   0.000     .0967097    .2096528
  _SstaXgro_27_2 |   .0596825    .010702     5.58   0.000      .038176    .0811891
  _SstaXgro_27_3 |  -.0094497   .0131567    -0.72   0.476    -.0358891    .0169897
  _SstaXgro_27_4 |  -.0468634   .0125076    -3.75   0.000    -.0719983   -.0217284
  _SstaXgro_27_5 |  -.0100777   .0026713    -3.77   0.000    -.0154459   -.0047095
  _SstaXgro_27_7 |   .0757878   .0032792    23.11   0.000      .069198    .0823776
  _SstaXgro_27_8 |   .0324509   .0062415     5.20   0.000     .0199082    .0449936
  _SstaXgro_28_1 |   .0945525   .0056544    16.72   0.000     .0831896    .1059154
  _SstaXgro_28_2 |   .0236706   .0048848     4.85   0.000     .0138543     .033487
  _SstaXgro_28_3 |   .0348969   .0059587     5.86   0.000     .0229225    .0468713
  _SstaXgro_28_4 |  -.0094139   .0059359    -1.59   0.119    -.0213425    .0025147
  _SstaXgro_28_5 |  -.0124759   .0030444    -4.10   0.000    -.0185938    -.006358
  _SstaXgro_28_7 |  -.0900623   .0043348   -20.78   0.000    -.0987735   -.0813512
  _SstaXgro_28_8 |   -.041538    .002953   -14.07   0.000    -.0474722   -.0356038
  _SstaXgro_29_1 |   .0898941   .0004579   196.32   0.000     .0889739    .0908142
  _SstaXgro_29_2 |   .0560222   .0004412   126.98   0.000     .0551356    .0569088
  _SstaXgro_29_3 |   .1197228   .0002751   435.15   0.000     .1191699    .1202757
  _SstaXgro_29_4 |   .0283954    .000485    58.55   0.000     .0274208      .02937
  _SstaXgro_29_5 |  -.0020824   .0001571   -13.25   0.000    -.0023982   -.0017666
  _SstaXgro_29_7 |   .0120977   .0001701    71.11   0.000     .0117558    .0124396
  _SstaXgro_29_8 |   .0246381   .0000994   247.79   0.000     .0244383    .0248379
  _SstaXgro_30_1 |   .1219501   .0029644    41.14   0.000      .115993    .1279072
  _SstaXgro_30_2 |   .1573142   .0063256    24.87   0.000     .1446024    .1700261
  _SstaXgro_30_3 |   .2176396   .0050606    43.01   0.000       .20747    .2278091
  _SstaXgro_30_4 |  -.0275719   .0054676    -5.04   0.000    -.0385595   -.0165843
  _SstaXgro_30_5 |  -.0138146   .0011326   -12.20   0.000    -.0160907   -.0115384
  _SstaXgro_30_7 |   .0269295   .0012378    21.76   0.000     .0244421     .029417
  _SstaXgro_30_8 |   .0332067     .00219    15.16   0.000     .0288056    .0376077
  _SstaXgro_31_1 |   .0705691   .0006168   114.40   0.000     .0693295    .0718087
  _SstaXgro_31_2 |   .0410518   .0009031    45.46   0.000     .0392369    .0428667
  _SstaXgro_31_3 |   .0686368   .0002896   237.04   0.000     .0680549    .0692187
  _SstaXgro_31_4 |   .0147064   .0004439    33.13   0.000     .0138144    .0155983
  _SstaXgro_31_5 |   .0233289   .0001872   124.60   0.000     .0229527    .0237052
  _SstaXgro_31_7 |   .0486723   .0001074   453.17   0.000     .0484565    .0488881
  _SstaXgro_31_8 |   .0224255   .0000896   250.16   0.000     .0222454    .0226057
  _SstaXgro_32_1 |   .1822479   .0013132   138.78   0.000     .1796089     .184887
  _SstaXgro_32_2 |   .0678137   .0013767    49.26   0.000     .0650471    .0705804
  _SstaXgro_32_3 |   .1293719   .0013624    94.96   0.000      .126634    .1321098
  _SstaXgro_32_4 |  -.0021689   .0009778    -2.22   0.031    -.0041338   -.0002039
  _SstaXgro_32_5 |   .0068446   .0005266    13.00   0.000     .0057863    .0079029
  _SstaXgro_32_7 |    .013861   .0007776    17.83   0.000     .0122984    .0154236
  _SstaXgro_32_8 |   -.024259   .0003063   -79.21   0.000    -.0248744   -.0236435
  _SstaXgro_33_1 |   .0826267   .0016702    49.47   0.000     .0792703    .0859831
  _SstaXgro_33_2 |   .1251773   .0016654    75.16   0.000     .1218305     .128524
  _SstaXgro_33_3 |   .1016452   .0016542    61.45   0.000      .098321    .1049694
  _SstaXgro_33_4 |  -.0578876   .0018276   -31.67   0.000    -.0615603   -.0542149
  _SstaXgro_33_5 |   .0118978   .0003331    35.71   0.000     .0112284    .0125673
  _SstaXgro_33_7 |   .0388112   .0003784   102.58   0.000     .0380509    .0395716
  _SstaXgro_33_8 |   .0052684   .0001308    40.29   0.000     .0050056    .0055311
  _SstaXgro_34_1 |   .1297347   .0002539   510.88   0.000     .1292244     .130245
  _SstaXgro_34_2 |   .0560628   .0006322    88.68   0.000     .0547924    .0573332
  _SstaXgro_34_3 |    .135238   .0002495   542.05   0.000     .1347367    .1357394
  _SstaXgro_34_4 |   .0185388   .0004599    40.31   0.000     .0176145    .0194631
  _SstaXgro_34_5 |   .0162994   .0000875   186.26   0.000     .0161235    .0164752
  _SstaXgro_34_7 |  -.0077392   .0000783   -98.88   0.000    -.0078964   -.0075819
  _SstaXgro_34_8 |  -.0295588   .0000842  -351.02   0.000    -.0297281   -.0293896
  _SstaXgro_35_1 |   .1241589   .0011571   107.30   0.000     .1218335    .1264843
  _SstaXgro_35_2 |   .0410329   .0005356    76.61   0.000     .0399566    .0421092
  _SstaXgro_35_3 |   .0683013   .0010497    65.07   0.000      .066192    .0704107
  _SstaXgro_35_4 |   .0193783   .0006341    30.56   0.000     .0181041    .0206524
  _SstaXgro_35_5 |  -.0489121   .0006031   -81.10   0.000    -.0501241      -.0477
  _SstaXgro_35_7 |  -.0624207   .0005383  -115.96   0.000    -.0635024    -.061339
  _SstaXgro_35_8 |  -.0026523   .0000978   -27.12   0.000    -.0028489   -.0024558
  _SstaXgro_36_1 |    .079612   .0002399   331.81   0.000     .0791298    .0800942
  _SstaXgro_36_2 |   .0200982   .0005039    39.89   0.000     .0190856    .0211108
  _SstaXgro_36_3 |   .0694952   .0003714   187.10   0.000     .0687488    .0702417
  _SstaXgro_36_4 |  -.0082313    .000173   -47.57   0.000    -.0085791   -.0078836
  _SstaXgro_36_5 |  -.0100518   .0001524   -65.97   0.000     -.010358   -.0097456
  _SstaXgro_36_7 |  -.0400482   .0001697  -235.97   0.000    -.0403892   -.0397071
  _SstaXgro_36_8 |  -.0032298    .000053   -60.89   0.000    -.0033364   -.0031232
  _SstaXgro_37_1 |   .1625567   .0004558   356.64   0.000     .1616407    .1634727
  _SstaXgro_37_2 |   .0449732   .0008011    56.14   0.000     .0433633    .0465832
  _SstaXgro_37_3 |   .1187346   .0005234   226.83   0.000     .1176827    .1197865
  _SstaXgro_37_4 |    .035316   .0006771    52.16   0.000     .0339552    .0366767
  _SstaXgro_37_5 |   .0013287   .0001985     6.69   0.000     .0009297    .0017277
  _SstaXgro_37_7 |  -.0098062   .0003486   -28.13   0.000    -.0105068   -.0091056
  _SstaXgro_37_8 |  -.0184443   .0001741  -105.96   0.000    -.0187941   -.0180945
  _SstaXgro_38_1 |    .269809    .001672   161.37   0.000     .2664489     .273169
  _SstaXgro_38_2 |   .1759286   .0019241    91.43   0.000     .1720619    .1797952
  _SstaXgro_38_3 |   .1341207   .0008917   150.41   0.000     .1323287    .1359126
  _SstaXgro_38_4 |  -.0597229   .0014157   -42.19   0.000    -.0625678    -.056878
  _SstaXgro_38_5 |  -.0042482   .0001173   -36.23   0.000    -.0044839   -.0040126
  _SstaXgro_38_7 |   .0493219   .0001753   281.38   0.000     .0489696    .0496741
  _SstaXgro_38_8 |   .0356795   .0000756   471.97   0.000     .0355276    .0358314
  _SstaXgro_39_1 |   .0754441    .004546    16.60   0.000     .0663086    .0845795
  _SstaXgro_39_2 |   .0178383   .0042733     4.17   0.000     .0092508    .0264258
  _SstaXgro_39_3 |   .0490725   .0050495     9.72   0.000     .0389252    .0592197
  _SstaXgro_39_4 |    .008003   .0049485     1.62   0.112    -.0019414    .0179473
  _SstaXgro_39_5 |  -.0186257    .002532    -7.36   0.000     -.023714   -.0135374
  _SstaXgro_39_7 |  -.0296607   .0035539    -8.35   0.000    -.0368024   -.0225189
  _SstaXgro_39_8 |   .0050624   .0025029     2.02   0.049     .0000326    .0100922
  _SstaXgro_40_1 |   .0918847   .0138407     6.64   0.000     .0640708    .1196986
  _SstaXgro_40_2 |   .0424199    .007282     5.83   0.000     .0277861    .0570536
  _SstaXgro_40_3 |   .0617726   .0074002     8.35   0.000     .0469013    .0766438
  _SstaXgro_40_4 |  -.0093554   .0079135    -1.18   0.243    -.0252582    .0065474
  _SstaXgro_40_5 |  -.0116552   .0021218    -5.49   0.000    -.0159191   -.0073913
  _SstaXgro_40_7 |  -.0301142   .0022969   -13.11   0.000    -.0347301   -.0254984
  _SstaXgro_40_8 |  -.0269768   .0043044    -6.27   0.000    -.0356269   -.0183268
  _SstaXgro_41_1 |   .0757258   .0011805    64.15   0.000     .0733535    .0780981
  _SstaXgro_41_2 |   .0449343   .0010074    44.61   0.000       .04291    .0469587
  _SstaXgro_41_3 |   .0952085   .0007148   133.19   0.000      .093772     .096645
  _SstaXgro_41_4 |  -.0813152   .0005019  -162.00   0.000    -.0823239   -.0803065
  _SstaXgro_41_5 |  -.0072719   .0004863   -14.95   0.000    -.0082491   -.0062947
  _SstaXgro_41_7 |   .0037652   .0004785     7.87   0.000     .0028036    .0047268
  _SstaXgro_41_8 |   .0136963   .0001128   121.39   0.000     .0134696     .013923
  _SstaXgro_42_1 |   .0276741   .0002999    92.27   0.000     .0270713    .0282768
  _SstaXgro_42_2 |   .0233057   .0002369    98.36   0.000     .0228296    .0237819
  _SstaXgro_42_3 |   .0628391   .0003954   158.94   0.000     .0620446    .0636336
  _SstaXgro_42_4 |   .0091226   .0003013    30.27   0.000     .0085171    .0097282
  _SstaXgro_42_5 |    .001141   .0001861     6.13   0.000      .000767     .001515
  _SstaXgro_42_7 |  -.0086112   .0002165   -39.78   0.000    -.0090463   -.0081761
  _SstaXgro_42_8 |  -.0062475   .0000711   -87.85   0.000    -.0063904   -.0061046
  _SstaXgro_44_1 |     .14184   .0130404    10.88   0.000     .1156343    .1680457
  _SstaXgro_44_2 |   .0781894   .0054183    14.43   0.000     .0673009     .089078
  _SstaXgro_44_3 |   .1265629    .005759    21.98   0.000     .1149897    .1381361
  _SstaXgro_44_4 |  -.0056307   .0075729    -0.74   0.461    -.0208489    .0095875
  _SstaXgro_44_5 |   -.027739   .0012546   -22.11   0.000    -.0302603   -.0252178
  _SstaXgro_44_7 |   .0199769   .0013925    14.35   0.000     .0171785    .0227753
  _SstaXgro_44_8 |   .0309925    .002729    11.36   0.000     .0255084    .0364766
  _SstaXgro_45_1 |   .1364082   .0117099    11.65   0.000     .1128762    .1599402
  _SstaXgro_45_2 |   .0517504   .0094905     5.45   0.000     .0326786    .0708222
  _SstaXgro_45_3 |   .0926471   .0131116     7.07   0.000     .0662983    .1189959
  _SstaXgro_45_4 |   .0383076    .011033     3.47   0.001     .0161359    .0604792
  _SstaXgro_45_5 |   .0103778   .0064285     1.61   0.113    -.0025408    .0232964
  _SstaXgro_45_7 |  -.0156116   .0096716    -1.61   0.113    -.0350475    .0038243
  _SstaXgro_45_8 |  -.0138714   .0059948    -2.31   0.025    -.0259185   -.0018244
  _SstaXgro_46_1 |   .3013318    .002655   113.49   0.000     .2959963    .3066673
  _SstaXgro_46_2 |   .1071717   .0015093    71.01   0.000     .1041387    .1102046
  _SstaXgro_46_3 |   .2237501   .0027733    80.68   0.000     .2181769    .2293233
  _SstaXgro_46_4 |   .0610407   .0017194    35.50   0.000     .0575854    .0644961
  _SstaXgro_46_5 |   .0217376   .0001426   152.40   0.000      .021451    .0220242
  _SstaXgro_46_7 |    .059305    .000222   267.11   0.000     .0588588    .0597512
  _SstaXgro_46_8 |   .0433226   .0001012   427.97   0.000     .0431192    .0435261
  _SstaXgro_47_1 |   .0982376   .0058392    16.82   0.000     .0865033    .1099719
  _SstaXgro_47_2 |   .1064382   .0051575    20.64   0.000     .0960739    .1168025
  _SstaXgro_47_3 |    .121898   .0061501    19.82   0.000      .109539    .1342571
  _SstaXgro_47_4 |   .0583655   .0060906     9.58   0.000     .0461259    .0706052
  _SstaXgro_47_5 |  -.0244469   .0033726    -7.25   0.000    -.0312243   -.0176695
  _SstaXgro_47_7 |  -.0447344   .0047048    -9.51   0.000     -.054189   -.0352798
  _SstaXgro_47_8 |  -.0162369   .0032623    -4.98   0.000    -.0227927   -.0096812
  _SstaXgro_48_1 |   .1229373   .0003296   372.96   0.000     .1222749    .1235997
  _SstaXgro_48_2 |    .062197   .0006155   101.05   0.000     .0609601    .0634339
  _SstaXgro_48_3 |   .1291349   .0003998   323.04   0.000     .1283315    .1299382
  _SstaXgro_48_4 |   .0243988   .0005716    42.68   0.000     .0232501    .0255476
  _SstaXgro_48_5 |   .0168444    .000315    53.47   0.000     .0162114    .0174775
  _SstaXgro_48_7 |  -.0175462   .0003363   -52.17   0.000     -.018222   -.0168703
  _SstaXgro_48_8 |  -.0321197   .0000732  -439.02   0.000    -.0322667   -.0319727
  _SstaXgro_49_1 |   .2117125   .0066731    31.73   0.000     .1983024    .2251226
  _SstaXgro_49_2 |   .0757508   .0051659    14.66   0.000     .0653696     .086132
  _SstaXgro_49_3 |   .1933786   .0079441    24.34   0.000     .1774145    .2093428
  _SstaXgro_49_4 |   .0384984   .0065432     5.88   0.000     .0253494    .0516474
  _SstaXgro_49_5 |   .0215975     .00301     7.18   0.000     .0155487    .0276463
  _SstaXgro_49_7 |  -.0039643   .0042196    -0.94   0.352    -.0124438    .0045153
  _SstaXgro_49_8 |  -.0788844   .0028205   -27.97   0.000    -.0845524   -.0732163
  _SstaXgro_50_1 |   .2382811   .0262142     9.09   0.000     .1856016    .2909606
  _SstaXgro_50_2 |   .0373432   .0065989     5.66   0.000     .0240823    .0506042
  _SstaXgro_50_3 |   .1033725   .0154254     6.70   0.000     .0723741     .134371
  _SstaXgro_50_4 |  -.0891566   .0086178   -10.35   0.000    -.1064748   -.0718384
  _SstaXgro_50_5 |  -.0055221   .0014749    -3.74   0.000    -.0084861   -.0025581
  _SstaXgro_50_7 |   .0465538   .0016825    27.67   0.000     .0431728    .0499349
  _SstaXgro_50_8 |   .0371425   .0033031    11.24   0.000     .0305047    .0437803
  _SstaXgro_51_1 |   .1876812    .000223   841.55   0.000      .187233    .1881294
  _SstaXgro_51_2 |   .0854398   .0004353   196.26   0.000      .084565    .0863147
  _SstaXgro_51_3 |   .1555043   .0002778   559.80   0.000      .154946    .1560625
  _SstaXgro_51_4 |    .047942   .0004933    97.19   0.000     .0469507    .0489332
  _SstaXgro_51_5 |   .0123073   .0001814    67.83   0.000     .0119427    .0126719
  _SstaXgro_51_7 |  -.0142401   .0002597   -54.84   0.000    -.0147619   -.0137183
  _SstaXgro_51_8 |  -.0227722   .0001001  -227.47   0.000    -.0229734    -.022571
  _SstaXgro_53_1 |   .1085978   .0010794   100.61   0.000     .1064286    .1107669
  _SstaXgro_53_2 |   .0604138   .0006029   100.20   0.000     .0592022    .0616255
  _SstaXgro_53_3 |   .1526992     .00121   126.19   0.000     .1502676    .1551309
  _SstaXgro_53_4 |    .021729   .0008591    25.29   0.000     .0200025    .0234555
  _SstaXgro_53_5 |  -.0103049   .0005718   -18.02   0.000    -.0114539   -.0091559
  _SstaXgro_53_7 |  -.0145494   .0006729   -21.62   0.000    -.0159016   -.0131972
  _SstaXgro_53_8 |  -.0124266   .0001349   -92.08   0.000    -.0126978   -.0121555
  _SstaXgro_54_1 |   .0618578   .0006333    97.68   0.000     .0605852    .0631304
  _SstaXgro_54_2 |   .0530419   .0009752    54.39   0.000     .0510822    .0550016
  _SstaXgro_54_3 |   .0982729   .0005969   164.64   0.000     .0970734    .0994724
  _SstaXgro_54_4 |   .0011775   .0005314     2.22   0.031     .0001095    .0022454
  _SstaXgro_54_5 |  -.0961503   .0003386  -283.98   0.000    -.0968306   -.0954699
  _SstaXgro_54_7 |  -.1508792   .0002414  -624.96   0.000    -.1513643    -.150394
  _SstaXgro_54_8 |   .0236312   .0001191   198.36   0.000     .0233918    .0238706
  _SstaXgro_55_1 |   .0220285   .0008588    25.65   0.000     .0203027    .0237543
  _SstaXgro_55_2 |   .0019581   .0002272     8.62   0.000     .0015015    .0024146
  _SstaXgro_55_3 |    .065762   .0004906   134.05   0.000     .0647761    .0667478
  _SstaXgro_55_4 |  -.0231909   .0006559   -35.36   0.000     -.024509   -.0218728
  _SstaXgro_55_5 |   .0129605   .0001131   114.59   0.000     .0127332    .0131878
  _SstaXgro_55_7 |   .0871927   .0002035   428.52   0.000     .0867838    .0876016
  _SstaXgro_55_8 |   .0394225    .000104   379.23   0.000     .0392136    .0396314
  _SstaXgro_56_1 |   .1511333   .0010026   150.75   0.000     .1491186     .153148
  _SstaXgro_56_2 |   .0956743   .0009667    98.97   0.000     .0937317    .0976169
  _SstaXgro_56_3 |   .1012408   .0012686    79.81   0.000     .0986915    .1037901
  _SstaXgro_56_4 |   .0220556   .0012399    17.79   0.000      .019564    .0245472
  _SstaXgro_56_5 |   .0038139   .0003003    12.70   0.000     .0032105    .0044173
  _SstaXgro_56_7 |  -.0094471   .0004803   -19.67   0.000    -.0104122   -.0084819
  _SstaXgro_56_8 |  -.0059752   .0002536   -23.56   0.000    -.0064849   -.0054655
    _SstaXttre_1 |   .0003491   .0005773     0.60   0.548     -.000811    .0015091
    _SstaXttre_2 |  -.0010221     .00097    -1.05   0.297    -.0029713    .0009272
    _SstaXttre_4 |   .0023527   .0007295     3.23   0.002     .0008868    .0038186
    _SstaXttre_5 |   .0011197   .0003637     3.08   0.003     .0003888    .0018506
    _SstaXttre_6 |   .0012007   .0005134     2.34   0.023     .0001689    .0022324
    _SstaXttre_8 |  -.0046846   .0004481   -10.45   0.000    -.0055852   -.0037841
    _SstaXttre_9 |   .0033653   .0008307     4.05   0.000      .001696    .0050347
   _SstaXttre_10 |   .0041159    .000893     4.61   0.000     .0023214    .0059103
   _SstaXttre_12 |   .0078596   .0007439    10.57   0.000     .0063647    .0093546
   _SstaXttre_13 |   .0031145   .0006301     4.94   0.000     .0018483    .0043807
   _SstaXttre_15 |  -.0026124   .0007487    -3.49   0.001     -.004117   -.0011079
   _SstaXttre_16 |   .0015457   .0008515     1.82   0.076    -.0001655    .0032568
   _SstaXttre_18 |   .0008082    .000556     1.45   0.152    -.0003092    .0019256
   _SstaXttre_19 |   .0040416   .0007945     5.09   0.000     .0024451    .0056382
   _SstaXttre_20 |  -.0003522    .000285    -1.24   0.222    -.0009249    .0002206
   _SstaXttre_21 |  -.0054821   .0002259   -24.27   0.000    -.0059362   -.0050281
   _SstaXttre_22 |  -.0005329   .0005139    -1.04   0.305    -.0015655    .0004998
   _SstaXttre_23 |   .0030111   .0007475     4.03   0.000      .001509    .0045133
   _SstaXttre_24 |   .0042716   .0003368    12.68   0.000     .0035947    .0049484
   _SstaXttre_25 |    .001858    .000387     4.80   0.000     .0010804    .0026357
   _SstaXttre_26 |   -.001072   .0004404    -2.43   0.019    -.0019569   -.0001871
   _SstaXttre_27 |   .0019986   .0005591     3.57   0.001     .0008751    .0031222
   _SstaXttre_28 |   .0044683   .0010809     4.13   0.000     .0022962    .0066404
   _SstaXttre_29 |  -.0052962   .0003461   -15.30   0.000    -.0059916   -.0046008
   _SstaXttre_30 |   .0045802   .0006967     6.57   0.000     .0031801    .0059804
   _SstaXttre_31 |   .0007698   .0005184     1.48   0.144     -.000272    .0018116
   _SstaXttre_32 |   .0011042   .0005476     2.02   0.049     3.72e-06    .0022046
   _SstaXttre_33 |  -.0004146   .0007248    -0.57   0.570    -.0018712    .0010421
   _SstaXttre_34 |   .0028823   .0006099     4.73   0.000     .0016567    .0041079
   _SstaXttre_35 |  -.0069084   .0004235   -16.31   0.000    -.0077595   -.0060574
   _SstaXttre_36 |  -.0010464   .0004602    -2.27   0.027    -.0019713   -.0001216
   _SstaXttre_37 |   .0052113   .0006714     7.76   0.000     .0038619    .0065606
   _SstaXttre_38 |   .0024396   .0006062     4.02   0.000     .0012214    .0036577
   _SstaXttre_39 |  -.0011663   .0006172    -1.89   0.065    -.0024066     .000074
   _SstaXttre_40 |  -.0013094   .0007057    -1.86   0.070    -.0027274    .0001087
   _SstaXttre_41 |  -.0008704   .0004426    -1.97   0.055    -.0017597     .000019
   _SstaXttre_42 |  -.0018728   .0004232    -4.43   0.000    -.0027233   -.0010223
   _SstaXttre_44 |  -.0009231   .0005958    -1.55   0.128    -.0021204    .0002741
   _SstaXttre_45 |   .0023509   .0012838     1.83   0.073    -.0002291    .0049308
   _SstaXttre_46 |  -.0017094    .000465    -3.68   0.001    -.0026439   -.0007749
   _SstaXttre_47 |   .0027588   .0009444     2.92   0.005     .0008609    .0046568
   _SstaXttre_48 |   .0033082   .0012554     2.64   0.011     .0007853     .005831
   _SstaXttre_49 |   .0019446   .0006769     2.87   0.006     .0005844    .0033049
   _SstaXttre_50 |   .0000625    .000584     0.11   0.915     -.001111     .001236
   _SstaXttre_51 |   .0063766   .0003706    17.20   0.000     .0056318    .0071214
   _SstaXttre_53 |  -.0023314     .00058    -4.02   0.000     -.003497   -.0011658
   _SstaXttre_54 |  -.0005735   .0007017    -0.82   0.418    -.0019836    .0008365
   _SstaXttre_55 |  -.0010408   .0008618    -1.21   0.233    -.0027726     .000691
   _SstaXttre_56 |  -.0051714   .0007822    -6.61   0.000    -.0067434   -.0035995
    _SstaXttrea1 |  -.0001576   .0000527    -2.99   0.004    -.0002636   -.0000517
    _SstaXttrea2 |  -.0000145   .0000677    -0.21   0.831    -.0001506    .0001215
    _SstaXttrea4 |  -.0002066   .0000643    -3.21   0.002    -.0003359   -.0000773
    _SstaXttrea5 |  -.0000747   .0000272    -2.75   0.008    -.0001293   -.0000201
    _SstaXttrea6 |  -.0004418   .0000332   -13.32   0.000    -.0005085   -.0003752
    _SstaXttrea8 |   .0003267   .0000353     9.26   0.000     .0002558    .0003976
    _SstaXttrea9 |   -.000538   .0000944    -5.70   0.000    -.0007277   -.0003483
   _SstaXttrea10 |   -.000289   .0000777    -3.72   0.001     -.000445   -.0001329
   _SstaXttrea12 |  -.0007908   .0000571   -13.84   0.000    -.0009056    -.000676
   _SstaXttrea13 |   -.000499   .0000577    -8.65   0.000    -.0006149   -.0003831
   _SstaXttrea15 |   .0001238   .0000665     1.86   0.069    -9.86e-06    .0002575
   _SstaXttrea16 |   .0001092   .0000723     1.51   0.138    -.0000362    .0002546
   _SstaXttrea18 |  -.0000845   .0000357    -2.37   0.022    -.0001563   -.0000127
   _SstaXttrea19 |  -.0000954   .0000698    -1.37   0.178    -.0002356    .0000449
   _SstaXttrea20 |   .0001186    .000029     4.08   0.000     .0000602    .0001769
   _SstaXttrea21 |   .0003105   .0000185    16.74   0.000     .0002732    .0003477
   _SstaXttrea22 |  -.0001021   .0000628    -1.63   0.110    -.0002282    .0000241
   _SstaXttrea23 |  -.0002788   .0000646    -4.32   0.000    -.0004085   -.0001491
   _SstaXttrea24 |  -.0003383   .0000314   -10.79   0.000    -.0004014   -.0002753
   _SstaXttrea25 |  -.0003219   .0000366    -8.80   0.000    -.0003954   -.0002483
   _SstaXttrea26 |  -.0000331   .0000141    -2.36   0.023    -.0000614   -4.86e-06
   _SstaXttrea27 |  -.0002202   .0000498    -4.42   0.000    -.0003204   -.0001201
   _SstaXttrea28 |  -.0005684   .0001155    -4.92   0.000    -.0008005   -.0003364
   _SstaXttrea29 |   .0004471   .0000344    13.00   0.000      .000378    .0005162
   _SstaXttrea30 |   -.000294   .0000515    -5.71   0.000    -.0003976   -.0001905
   _SstaXttrea31 |   .0001891   .0000418     4.52   0.000     .0001051    .0002732
   _SstaXttrea32 |  -.0003284    .000047    -6.99   0.000    -.0004229    -.000234
   _SstaXttrea33 |  -.0000963   .0000605    -1.59   0.118    -.0002179    .0000254
   _SstaXttrea34 |  -.0003422     .00005    -6.85   0.000    -.0004426   -.0002418
   _SstaXttrea35 |   .0006165   .0000266    23.17   0.000      .000563    .0006699
   _SstaXttrea36 |   -.000089   .0000337    -2.64   0.011    -.0001568   -.0000212
   _SstaXttrea37 |  -.0004473   .0000358   -12.51   0.000    -.0005192   -.0003755
   _SstaXttrea38 |   .0000808   .0000385     2.10   0.041     3.48e-06    .0001581
   _SstaXttrea39 |   .0000409   .0000444     0.92   0.361    -.0000482    .0001301
   _SstaXttrea40 |  -.0001412   .0000605    -2.33   0.024    -.0002627   -.0000196
   _SstaXttrea41 |   .0001253    .000036     3.48   0.001      .000053    .0001977
   _SstaXttrea42 |   .0001437   .0000345     4.16   0.000     .0000743     .000213
   _SstaXttrea44 |  -.0000994   .0000498    -2.00   0.052    -.0001995    7.23e-07
   _SstaXttrea45 |  -.0003714   .0000755    -4.92   0.000    -.0005231   -.0002198
   _SstaXttrea46 |   .0003753   .0000339    11.08   0.000     .0003073    .0004434
   _SstaXttrea47 |  -.0003103   .0000714    -4.34   0.000    -.0004539   -.0001667
   _SstaXttrea48 |  -.0003467    .000147    -2.36   0.022    -.0006422   -.0000512
   _SstaXttrea49 |   .0002152   .0000511     4.21   0.000     .0001126    .0003178
   _SstaXttrea50 |  -.0000593   .0000408    -1.45   0.152    -.0001412    .0000227
   _SstaXttrea51 |  -.0005549   .0000292   -18.98   0.000    -.0006136   -.0004961
   _SstaXttrea53 |   .0000888   .0000367     2.42   0.019      .000015    .0001626
   _SstaXttrea54 |  -.0001186   .0000404    -2.93   0.005    -.0001998   -.0000374
   _SstaXttrea55 |   .0001773   .0000637     2.78   0.008     .0000493    .0003053
   _SstaXttrea56 |   .0004654   .0000533     8.73   0.000     .0003583    .0005725
    _SstaXttreb1 |   3.34e-06   1.19e-06     2.81   0.007     9.49e-07    5.72e-06
    _SstaXttreb2 |   2.17e-06   1.44e-06     1.51   0.137    -7.13e-07    5.06e-06
    _SstaXttreb4 |   3.08e-06   1.45e-06     2.13   0.038     1.73e-07    5.99e-06
    _SstaXttreb5 |   7.80e-07   4.84e-07     1.61   0.113    -1.93e-07    1.75e-06
    _SstaXttreb6 |   .0000133   7.71e-07    17.21   0.000     .0000117    .0000148
    _SstaXttreb8 |  -5.35e-06   6.61e-07    -8.08   0.000    -6.68e-06   -4.02e-06
    _SstaXttreb9 |   .0000143   2.12e-06     6.75   0.000     .0000101    .0000186
   _SstaXttreb10 |   5.53e-06   1.80e-06     3.07   0.003     1.91e-06    9.15e-06
   _SstaXttreb12 |    .000018   1.10e-06    16.38   0.000     .0000158    .0000202
   _SstaXttreb13 |   .0000129   1.16e-06    11.06   0.000     .0000105    .0000152
   _SstaXttreb15 |  -6.37e-07   1.43e-06    -0.45   0.657    -3.50e-06    2.23e-06
   _SstaXttreb16 |  -3.89e-06   1.31e-06    -2.96   0.005    -6.53e-06   -1.25e-06
   _SstaXttreb18 |   2.03e-06   8.22e-07     2.47   0.017     3.76e-07    3.68e-06
   _SstaXttreb19 |   7.08e-07   1.45e-06     0.49   0.628    -2.21e-06    3.62e-06
   _SstaXttreb20 |  -2.54e-06   7.22e-07    -3.51   0.001    -3.99e-06   -1.09e-06
   _SstaXttreb21 |  -5.19e-06   4.92e-07   -10.55   0.000    -6.18e-06   -4.20e-06
   _SstaXttreb22 |   3.65e-06   1.32e-06     2.75   0.008     9.83e-07    6.31e-06
   _SstaXttreb23 |   6.77e-06   1.63e-06     4.15   0.000     3.49e-06      .00001
   _SstaXttreb24 |   6.76e-06   6.79e-07     9.96   0.000     5.40e-06    8.13e-06
   _SstaXttreb25 |   8.11e-06   8.45e-07     9.60   0.000     6.41e-06    9.81e-06
   _SstaXttreb26 |   2.46e-06   2.60e-07     9.44   0.000     1.93e-06    2.98e-06
   _SstaXttreb27 |   5.57e-06   1.19e-06     4.69   0.000     3.18e-06    7.96e-06
   _SstaXttreb28 |   .0000141   2.33e-06     6.05   0.000     9.43e-06    .0000188
   _SstaXttreb29 |  -9.13e-06   6.76e-07   -13.50   0.000    -.0000105   -7.77e-06
   _SstaXttreb30 |   6.32e-06   1.14e-06     5.54   0.000     4.03e-06    8.62e-06
   _SstaXttreb31 |  -5.24e-06   9.76e-07    -5.37   0.000    -7.21e-06   -3.28e-06
   _SstaXttreb32 |   .0000103   1.03e-06    10.04   0.000     8.28e-06    .0000124
   _SstaXttreb33 |   4.10e-06   1.36e-06     3.01   0.004     1.36e-06    6.83e-06
   _SstaXttreb34 |   8.71e-06   1.08e-06     8.06   0.000     6.54e-06    .0000109
   _SstaXttreb35 |  -.0000146   5.60e-07   -25.98   0.000    -.0000157   -.0000134
   _SstaXttreb36 |   4.21e-06   6.82e-07     6.18   0.000     2.84e-06    5.58e-06
   _SstaXttreb37 |   9.88e-06   5.63e-07    17.53   0.000     8.74e-06     .000011
   _SstaXttreb38 |  -1.80e-06   9.24e-07    -1.95   0.057    -3.66e-06    5.80e-08
   _SstaXttreb39 |   4.10e-07   7.99e-07     0.51   0.610    -1.19e-06    2.02e-06
   _SstaXttreb40 |   6.17e-06   1.22e-06     5.05   0.000     3.71e-06    8.62e-06
   _SstaXttreb41 |  -3.27e-06   8.51e-07    -3.85   0.000    -4.98e-06   -1.56e-06
   _SstaXttreb42 |  -1.45e-06   7.94e-07    -1.83   0.073    -3.05e-06    1.42e-07
   _SstaXttreb44 |   4.10e-06   1.13e-06     3.63   0.001     1.83e-06    6.37e-06
   _SstaXttreb45 |   .0000101   1.35e-06     7.51   0.000     7.43e-06    .0000129
   _SstaXttreb46 |  -8.34e-06   6.90e-07   -12.09   0.000    -9.73e-06   -6.95e-06
   _SstaXttreb47 |   7.70e-06   1.27e-06     6.07   0.000     5.15e-06    .0000102
   _SstaXttreb48 |   8.13e-06   3.38e-06     2.40   0.020     1.34e-06    .0000149
   _SstaXttreb49 |  -8.76e-06   9.87e-07    -8.87   0.000    -.0000107   -6.77e-06
   _SstaXttreb50 |   2.38e-06   8.95e-07     2.66   0.010     5.84e-07    4.18e-06
   _SstaXttreb51 |   .0000125   6.05e-07    20.64   0.000     .0000113    .0000137
   _SstaXttreb53 |  -8.44e-08   7.55e-07    -0.11   0.911    -1.60e-06    1.43e-06
   _SstaXttreb54 |   4.02e-06   7.39e-07     5.44   0.000     2.53e-06    5.51e-06
   _SstaXttreb55 |  -3.52e-06   1.17e-06    -3.02   0.004    -5.87e-06   -1.18e-06
   _SstaXttreb56 |  -8.28e-06   1.03e-06    -8.07   0.000    -.0000103   -6.22e-06
   _TgroXttren_1 |  -.0113664   .0024027    -4.73   0.000    -.0161949   -.0065379
   _TgroXttren_2 |   .0028632   .0023897     1.20   0.237    -.0019391    .0076656
   _TgroXttren_3 |  -.0027764   .0034617    -0.80   0.426    -.0097329    .0041802
   _TgroXttren_4 |   .0073245   .0035245     2.08   0.043     .0002418    .0144073
   _TgroXttren_5 |  -.0026199    .001263    -2.07   0.043    -.0051579   -.0000818
   _TgroXttren_7 |   .0086832   .0013065     6.65   0.000     .0060578    .0113086
   _TgroXttren_8 |   .0152033   .0013478    11.28   0.000     .0124948    .0179118
   _TgroXttrena1 |   .0007828   .0002182     3.59   0.001     .0003443    .0012213
   _TgroXttrena2 |  -.0000541   .0001855    -0.29   0.772    -.0004269    .0003186
   _TgroXttrena3 |   .0007214   .0002633     2.74   0.009     .0001923    .0012504
   _TgroXttrena4 |  -.0002101   .0002378    -0.88   0.381     -.000688    .0002677
   _TgroXttrena5 |   .0001943   .0000956     2.03   0.047     2.25e-06    .0003864
   _TgroXttrena7 |  -.0001581   .0000824    -1.92   0.061    -.0003237    7.53e-06
   _TgroXttrena8 |  -.0008108   .0001029    -7.88   0.000    -.0010175   -.0006041
   _TgroXttrenb1 |   -.000017   5.26e-06    -3.22   0.002    -.0000275   -6.38e-06
   _TgroXttrenb2 |  -7.80e-07   3.96e-06    -0.20   0.844    -8.73e-06    7.17e-06
   _TgroXttrenb3 |  -.0000182   5.48e-06    -3.32   0.002    -.0000292   -7.17e-06
   _TgroXttrenb4 |   1.55e-06   4.74e-06     0.33   0.745    -7.97e-06    .0000111
   _TgroXttrenb5 |  -6.65e-06   2.15e-06    -3.09   0.003     -.000011   -2.33e-06
   _TgroXttrenb7 |  -1.53e-06   1.61e-06    -0.95   0.346    -4.77e-06    1.71e-06
   _TgroXttrenb8 |   .0000141   2.21e-06     6.40   0.000     9.70e-06    .0000186
           _cons |    .248564    .021644    11.48   0.000     .2050687    .2920592
----------------------------------------------------------------------------------

. estimates store empd ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    0.29
            Prob > F =    0.5925

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    1.35
            Prob > F =    0.2515

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    0.00
            Prob > F =    0.9804

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    5.30
            Prob > F =    0.0256

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    0.01
            Prob > F =    0.9276

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    0.02
            Prob > F =    0.8970

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    0.90
            Prob > F =    0.3462

. quietly reg empdhi $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdhi ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    5.80
            Prob > F =    0.0198

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.03
            Prob > F =    0.8591

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    1.82
            Prob > F =    0.1839

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    0.59
            Prob > F =    0.4448

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    0.25
            Prob > F =    0.6213

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    3.94
            Prob > F =    0.0527

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    0.16
            Prob > F =    0.6939

. quietly reg empdlg $controls [pw=wtsupp], cluster(statefip) ;

. estimates store empdlg ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    7.10
            Prob > F =    0.0104

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.01
            Prob > F =    0.9298

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    3.47
            Prob > F =    0.0684

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    0.08
            Prob > F =    0.7730

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    0.00
            Prob > F =    0.9686

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    2.56
            Prob > F =    0.1162

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    3.02
            Prob > F =    0.0886

. * note group health coverage and pension are conditional on being asked the question ;
. quietly reg ph $controls [pw=wtsupp], cluster(statefip) ;

. estimates store ph ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    3.43
            Prob > F =    0.0701

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.39
            Prob > F =    0.5363

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    3.37
            Prob > F =    0.0724

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    0.23
            Prob > F =    0.6304

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    0.02
            Prob > F =    0.8828

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    4.96
            Prob > F =    0.0305

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    0.68
            Prob > F =    0.4134

. quietly reg lrhw $controls [pw=wtsupp] if hwagesamp==1, cluster(statefip) ;

. estimates store lrhw ;

. foreach x of numlist 1/5 7/8 { ;
  2.   test _PgroXpro_`x'=_AgroXanti_`x' ;
  3. } ;

 ( 1)  _PgroXpro_1 - _AgroXanti_1 = 0

       F(  1,    49) =    4.16
            Prob > F =    0.0469

 ( 1)  _PgroXpro_2 - _AgroXanti_2 = 0

       F(  1,    49) =    0.79
            Prob > F =    0.3774

 ( 1)  _PgroXpro_3 - _AgroXanti_3 = 0

       F(  1,    49) =    1.75
            Prob > F =    0.1924

 ( 1)  _PgroXpro_4 - _AgroXanti_4 = 0

       F(  1,    49) =    0.12
            Prob > F =    0.7333

 ( 1)  _PgroXpro_5 - _AgroXanti_5 = 0

       F(  1,    49) =    1.82
            Prob > F =    0.1834

 ( 1)  _PgroXpro_7 - _AgroXanti_7 = 0

       F(  1,    49) =    0.04
            Prob > F =    0.8523

 ( 1)  _PgroXpro_8 - _AgroXanti_8 = 0

       F(  1,    49) =    0.03
            Prob > F =    0.8718

. ******* ESTIMATES WITH PRO AND ANTI TESTING DUMMIES ******* ;
. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) se(%7.3f) stats(N) ;

----------------------------------------------------------------
    Variable |  empd     empdhi    empdlg      ph       lrhw    
-------------+--------------------------------------------------
  _Pgroup8_1 |  -0.290     0.155    -0.215    -0.073    -0.362  
             |   0.008     0.015     0.073     0.011     0.013  
  _Pgroup8_2 |  -0.159     0.096     0.154    -0.003    -0.131  
             |   0.010     0.013     0.107     0.010     0.013  
  _Pgroup8_3 |  -0.462    -0.030    -0.105    -0.187    -0.648  
             |   0.010     0.012     0.067     0.008     0.012  
  _Pgroup8_4 |  -0.198    -0.083     0.430    -0.023    -0.322  
             |   0.016     0.013     0.065     0.010     0.014  
  _Pgroup8_5 |  -0.037     0.157    -0.067    -0.018    -0.116  
             |   0.005     0.006     0.037     0.003     0.005  
  _Pgroup8_7 |  -0.290    -0.049    -0.141    -0.206    -0.585  
             |   0.006     0.007     0.040     0.004     0.004  
  _Pgroup8_8 |  -0.192    -0.185    -0.112    -0.123    -0.363  
             |   0.005     0.008     0.033     0.004     0.006  
 _PgroXpro_1 |  -0.006     0.038     0.045     0.042     0.033  
             |   0.014     0.021     0.012     0.011     0.016  
 _PgroXpro_2 |  -0.004    -0.008     0.016     0.025     0.007  
             |   0.011     0.022     0.016     0.013     0.016  
 _PgroXpro_3 |   0.015     0.010     0.008     0.043     0.014  
             |   0.015     0.020     0.013     0.010     0.013  
 _PgroXpro_4 |  -0.018     0.005    -0.007    -0.001    -0.008  
             |   0.012     0.015     0.011     0.011     0.014  
 _PgroXpro_5 |   0.002     0.016     0.007     0.014     0.015  
             |   0.007     0.009     0.005     0.006     0.007  
 _PgroXpro_7 |  -0.010    -0.008    -0.003    -0.004    -0.001  
             |   0.011     0.010     0.008     0.011     0.008  
 _PgroXpro_8 |  -0.001    -0.009    -0.012    -0.006    -0.005  
             |   0.007     0.008     0.006     0.006     0.007  
_AgroXanti_1 |  -0.027    -0.067    -0.082    -0.049    -0.099  
             |   0.039     0.041     0.047     0.049     0.065  
_AgroXanti_2 |  -0.020     0.003     0.021     0.049    -0.013  
             |   0.014     0.056     0.060     0.037     0.019  
_AgroXanti_3 |   0.016    -0.049     0.045    -0.024    -0.030  
             |   0.021     0.042     0.018     0.037     0.034  
_AgroXanti_4 |   0.023    -0.033    -0.021    -0.012    -0.015  
             |   0.016     0.047     0.047     0.022     0.015  
_AgroXanti_5 |   0.003     0.011     0.007     0.016    -0.010  
             |   0.005     0.010     0.017     0.014     0.018  
_AgroXanti_7 |  -0.012     0.026     0.017     0.032     0.001  
             |   0.007     0.015     0.012     0.015     0.013  
_AgroXanti_8 |   0.009    -0.002     0.007     0.006    -0.007  
             |   0.009     0.016     0.010     0.014     0.012  
         pro |   0.012    -0.010     0.004     0.004     0.024  
             |   0.007     0.010     0.007     0.011     0.008  
        anti |   0.012    -0.001     0.005    -0.019    -0.007  
             |   0.004     0.011     0.015     0.014     0.024  
         age |   0.039     0.024    -0.002     0.049     0.090  
             |   0.001     0.001     0.001     0.001     0.002  
        age2 |  -0.000    -0.000     0.000    -0.001    -0.001  
             |   0.000     0.000     0.000     0.000     0.000  
-------------+--------------------------------------------------
           N | 2355785   1792491   1471265   1976076   1738844  
----------------------------------------------------------------
                                                    legend: b/se

. estimates table empd empdhi empdlg ph lrhw, keep($outvars) b(%7.3f) star ;

-------------------------------------------------------------------------------
    Variable |    empd        empdhi       empdlg         ph          lrhw     
-------------+-----------------------------------------------------------------
  _Pgroup8_1 |  -0.290***     0.155***    -0.215**     -0.073***    -0.362***  
  _Pgroup8_2 |  -0.159***     0.096***     0.154       -0.003       -0.131***  
  _Pgroup8_3 |  -0.462***    -0.030*      -0.105       -0.187***    -0.648***  
  _Pgroup8_4 |  -0.198***    -0.083***     0.430***    -0.023*      -0.322***  
  _Pgroup8_5 |  -0.037***     0.157***    -0.067       -0.018***    -0.116***  
  _Pgroup8_7 |  -0.290***    -0.049***    -0.141***    -0.206***    -0.585***  
  _Pgroup8_8 |  -0.192***    -0.185***    -0.112**     -0.123***    -0.363***  
 _PgroXpro_1 |  -0.006        0.038        0.045***     0.042***     0.033*    
 _PgroXpro_2 |  -0.004       -0.008        0.016        0.025        0.007     
 _PgroXpro_3 |   0.015        0.010        0.008        0.043***     0.014     
 _PgroXpro_4 |  -0.018        0.005       -0.007       -0.001       -0.008     
 _PgroXpro_5 |   0.002        0.016        0.007        0.014*       0.015*    
 _PgroXpro_7 |  -0.010       -0.008       -0.003       -0.004       -0.001     
 _PgroXpro_8 |  -0.001       -0.009       -0.012*      -0.006       -0.005     
_AgroXanti_1 |  -0.027       -0.067       -0.082       -0.049       -0.099     
_AgroXanti_2 |  -0.020        0.003        0.021        0.049       -0.013     
_AgroXanti_3 |   0.016       -0.049        0.045*      -0.024       -0.030     
_AgroXanti_4 |   0.023       -0.033       -0.021       -0.012       -0.015     
_AgroXanti_5 |   0.003        0.011        0.007        0.016       -0.010     
_AgroXanti_7 |  -0.012        0.026        0.017        0.032*       0.001     
_AgroXanti_8 |   0.009       -0.002        0.007        0.006       -0.007     
         pro |   0.012       -0.010        0.004        0.004        0.024**   
        anti |   0.012**     -0.001        0.005       -0.019       -0.007     
         age |   0.039***     0.024***    -0.002**      0.049***     0.090***  
        age2 |  -0.000***    -0.000***     0.000***    -0.001***    -0.001***  
-------------------------------------------------------------------------------
                                       legend: * p<0.05; ** p<0.01; *** p<0.001

. log close ;
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_6\basic_exclusive.log
  log type:  text
 closed on:   9 Mar 2020, 09:54:46
-------------------------------------------------------------------------------------------------------------------------------------------------------
