-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_3\Table3_divisions2.log
  log type:  text
 opened on:   6 Mar 2020, 20:40:18

. /*****
> 
> Tests prediction that testing sector employment of non-users increased in post periods.
> Second prediction, that this is larger for blacks is also tested.
> Specifications with SEs printed using estimates table are those reported in paper.
> 
> *****/
> 
> set mem 700m ;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set matsize 300 ;

. set more off ;

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_NSDUH/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_NSDUH

. use Output/DRUGDATA_FINAL2.dta ;
(NSDUH 2006, Dataset 0001)

.  cd ../Tables/Table_3/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_3

. *use drugdata_hitest.dta ;
. *use "H:\Other\Data and do files\Data and do files\Data_NSDUH\DRUGDATA_FINAL2.dta" ;
. summ surveyyr ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    surveyyr |    661,146    1999.268    5.602541       1979       2006

. tab1 surveyyr ;

-> tabulation of surveyyr  

    year of |
     survey |      Freq.     Percent        Cum.
------------+-----------------------------------
       1979 |      7,224        1.09        1.09
       1982 |      5,624        0.85        1.94
       1985 |      8,021        1.21        3.16
       1988 |      8,814        1.33        4.49
       1990 |      9,259        1.40        5.89
       1991 |     32,594        4.93       10.82
       1992 |     28,832        4.36       15.18
       1993 |     26,489        4.01       19.19
       1994 |      4,372        0.66       19.85
       1995 |     17,747        2.68       22.53
       1996 |     18,269        2.76       25.30
       1997 |     24,505        3.71       29.00
       1998 |     25,500        3.86       32.86
       1999 |     53,560        8.10       40.96
       2000 |     58,680        8.88       49.84
       2001 |     55,561        8.40       58.24
       2002 |     54,079        8.18       66.42
       2003 |     55,230        8.35       74.77
       2004 |     55,602        8.41       83.18
       2005 |     55,905        8.46       91.64
       2006 |     55,279        8.36      100.00
------------+-----------------------------------
      Total |    661,146      100.00

. *gen young=(age<=12) ;
. gen young=age1825 ;

. ***This drops people younger than 18;
. drop if age<7;
(205,102 observations deleted)

. ***This drops people 65 or older;
. drop if age>16;
(27,173 observations deleted)

. *gen edgrp4=education if education <5;
. gen edgrp4=educcat2 if educcat2 <5;
(26 missing values generated)

. * High testing ind dummy ;
. *label define industry 1 "Mining" 2 "Comm, util, trans" 3 "Manufacturing" 4 "Construction"
> 5 "Wholesale trade" 6 "Retail trade" 7 "FIRE" 8 "Services" 9 "Agriculture" 10 "Government" 11 "Missing" ;
. gen empdhi=1 if employed==1 & inlist(industry,1,2, 3, 10)==1 ;
(364,246 missing values generated)

. replace empdhi=0 if employed==1 & inlist(industry,4,5,6,7,8,9)==1 ;
(212,184 real changes made)

. tab1 surveyyr ;

-> tabulation of surveyyr  

    year of |
     survey |      Freq.     Percent        Cum.
------------+-----------------------------------
       1979 |      4,718        1.10        1.10
       1982 |      3,751        0.87        1.97
       1985 |      5,252        1.22        3.20
       1988 |      5,182        1.21        4.41
       1990 |      6,421        1.50        5.90
       1991 |     22,654        5.28       11.19
       1992 |     20,718        4.83       16.02
       1993 |     18,896        4.41       20.42
       1994 |      3,142        0.73       21.16
       1995 |     12,656        2.95       24.11
       1996 |     13,174        3.07       27.18
       1997 |     15,407        3.59       30.77
       1998 |     17,383        4.05       34.82
       1999 |     32,628        7.61       42.43
       2000 |     36,489        8.51       50.94
       2001 |     35,693        8.32       59.26
       2002 |     34,351        8.01       67.27
       2003 |     35,091        8.18       75.46
       2004 |     35,309        8.23       83.69
       2005 |     35,215        8.21       91.90
       2006 |     34,741        8.10      100.00
------------+-----------------------------------
      Total |    428,871      100.00

. drop if empdhi==. ;
(152,062 observations deleted)

.   * This drops years before 1985 - no industry data ;
. tab1 surveyyr ;

-> tabulation of surveyyr  

    year of |
     survey |      Freq.     Percent        Cum.
------------+-----------------------------------
       1985 |      3,408        1.23        1.23
       1988 |      3,576        1.29        2.52
       1990 |      4,679        1.69        4.21
       1991 |     15,395        5.56        9.77
       1992 |     14,221        5.14       14.91
       1993 |     13,351        4.82       19.74
       1994 |      2,242        0.81       20.55
       1995 |      8,861        3.20       23.75
       1997 |     10,857        3.92       27.67
       1998 |     12,230        4.42       32.09
       2000 |     28,674       10.36       42.45
       2001 |     27,848       10.06       52.51
       2002 |     26,407        9.54       62.05
       2003 |     26,197        9.46       71.51
       2004 |     26,238        9.48       80.99
       2005 |     26,491        9.57       90.56
       2006 |     26,134        9.44      100.00
------------+-----------------------------------
      Total |    276,809      100.00

. * Drug use variables ;
. gen usermon=summon ;

. gen useryr=0 ;

. replace useryr=1 if mrjyr==1 | inhyr==1 | anlyr==1 | stmyr==1 | sedyr==1 ;
(55,007 real changes made)

. gen useryr2=useryr ;

. replace useryr2=1 if iemyr==1 ;
(3,001 real changes made)

.  * this var only available for 1990 on.
> 
> *rename anydrug  user;
. rename employed empd;

. gen female = 1 if gender==0;
(137,523 missing values generated)

. replace female = 0  if gender==1;
(137,523 real changes made)

. replace age2=age*age ;
variable age2 was byte now int
(276,809 real changes made)

. rename hispanic hisp;

. rename surveyyr  year;

. *drop if year > 1999 ;
. drop if year > 1997 ;
(200,219 observations deleted)

.  * No division data for 1998 and 1999. ;
. * Construct period variables ;
. gen p8893=(year>=1988 & year<=1993) ;

. gen p9499=(year>=1994 & year<=1999) ;

. gen post=(p9499==1) ;

. * Code divisions by testing rates in NSDUH state data: 1=lowest, 3=highest ;
. * These are tabulated in state_test_rates_table.do - 3 is borderline, could go with 6 & 7 ;
. gen divtest=. ;
(76,590 missing values generated)

. replace divtest=1 if inlist(division,1,2,9)==1 ;
(24,925 real changes made)

. replace divtest=2 if inlist(division,4,5,8)==1 ;
(30,652 real changes made)

. replace divtest=3 if inlist(division,6,7,3)==1 ;
(21,013 real changes made)

. summ year useryr useryr2 usermon divtest ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |     76,590    1992.467    2.833905       1985       1997
      useryr |     76,590    .1666406    .3726571          0          1
     useryr2 |     76,590    .1776211     .382196          0          1
     usermon |     76,590    .0954041    .2937742          0          1
     divtest |     76,590    1.948923    .7727807          1          3

. ** Create controls for regression adjustment ;
. * group specific qtts ;
. gen tt=year-1980 ;

. gen qtt=tt*tt ;

. gen ctt=tt*qtt ;

. gen btt=black*tt ;

. gen htt=hisp*tt ;

. gen ftt=female*tt ;

. gen ytt=young*tt ;

. gen bqtt=black*qtt ;

. gen hqtt=hisp*qtt ;

. gen fqtt=female*qtt ;

. gen yqtt=young*qtt ;

. gen bctt=black*ctt ;

. gen hctt=hisp*ctt ;

. gen fctt=female*ctt ;

. gen yctt=young*ctt ;

. char edgrp4[omit] 2 ;

. xi, prefix(_E) i.edgrp4*tt i.edgrp4*qtt i.edgrp4*ctt ;
i.edgrp4          _Eedgrp4_1-4        (naturally coded; _Eedgrp4_2 omitted)
i.edgrp4*tt       _EedgXtt_#          (coded as above)
i.edgrp4*qtt      _EedgXqtt_#         (coded as above)
i.edgrp4*ctt      _EedgXctt_#         (coded as above)

. xi, prefix(_D) i.division*black i.division*hisp i.division*female i.division*young i.division*i.edgrp4 i.division*tt ;
i.division        _Ddivision_1-9      (naturally coded; _Ddivision_1 omitted)
i.divis~n*black   _DdivXblack_#       (coded as above)
i.division*hisp   _DdivXhisp_#        (coded as above)
i.divi~n*female   _DdivXfemal_#       (coded as above)
i.divis~n*young   _DdivXyoung_#       (coded as above)
i.edgrp4          _Dedgrp4_1-4        (naturally coded; _Dedgrp4_2 omitted)
i.div~n*i.edg~4   _DdivXedg_#_#       (coded as above)
i.division*tt     _DdivXtt_#          (coded as above)

. drop _Dedgrp4* ;

. global controls1 black hisp female age age2 _E* _D*
>   tt qtt ctt btt htt ftt ytt bqtt hqtt fqtt yqtt bctt hctt fctt yctt ;

. reg empdhi $controls1 ;

      Source |       SS           df       MS      Number of obs   =    76,578
-------------+----------------------------------   F(104, 76473)   =     36.34
       Model |  718.487294       104  6.90853168   Prob > F        =    0.0000
    Residual |  14539.3677    76,473  .190124196   R-squared       =    0.0471
-------------+----------------------------------   Adj R-squared   =    0.0458
       Total |   15257.855    76,577  .199248534   Root MSE        =    .43603

-------------------------------------------------------------------------------
       empdhi |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        black |  -.1187199   .1428535    -0.83   0.406    -.3987121    .1612723
         hisp |   .1559276   .1454049     1.07   0.284    -.1290653    .4409205
       female |  -.1025469   .1103497    -0.93   0.353    -.3188317    .1137379
          age |   .0713032   .0065838    10.83   0.000      .058399    .0842075
         age2 |  -.0020311   .0002786    -7.29   0.000    -.0025771    -.001485
   _Eedgrp4_1 |  -.1914826   .1604675    -1.19   0.233    -.5059982     .123033
   _Eedgrp4_3 |   .1670978   .1447055     1.15   0.248    -.1165242    .4507198
   _Eedgrp4_4 |  -.1398966   .1539243    -0.91   0.363    -.4415875    .1617943
   _EedgXtt_1 |   .0565349   .0479412     1.18   0.238    -.0374296    .1504993
   _EedgXtt_3 |  -.0909032   .0431723    -2.11   0.035    -.1755208   -.0062857
   _EedgXtt_4 |  -.0149494   .0461117    -0.32   0.746    -.1053281    .0754294
  _EedgXqtt_1 |   -.004136   .0045174    -0.92   0.360      -.01299    .0047181
  _EedgXqtt_3 |   .0096249   .0040434     2.38   0.017     .0016999    .0175499
  _EedgXqtt_4 |   .0030165   .0043255     0.70   0.486    -.0054615    .0114946
  _EedgXctt_1 |   .0001001   .0001329     0.75   0.452    -.0001605    .0003606
  _EedgXctt_3 |  -.0003013   .0001184    -2.54   0.011    -.0005334   -.0000692
  _EedgXctt_4 |  -.0001181    .000127    -0.93   0.352     -.000367    .0001308
 _Ddivision_2 |  -.0571285   .0474122    -1.20   0.228    -.1500562    .0357993
 _Ddivision_3 |  -.0220762   .0465677    -0.47   0.635    -.1133487    .0691963
 _Ddivision_4 |  -.1041571   .0551518    -1.89   0.059    -.2122543      .00394
 _Ddivision_5 |  -.0566286   .0457096    -1.24   0.215    -.1462192     .032962
 _Ddivision_6 |    .059025   .0551411     1.07   0.284    -.0490514    .1671013
 _Ddivision_7 |  -.0368973   .0477772    -0.77   0.440    -.1305405    .0567458
 _Ddivision_8 |  -.0641799   .0493222    -1.30   0.193    -.1608511    .0324913
 _Ddivision_9 |  -.0664987   .0463843    -1.43   0.152    -.1574117    .0244143
_DdivXblack_2 |   .0179971   .0367241     0.49   0.624    -.0539819    .0899761
_DdivXblack_3 |   .0168704   .0368284     0.46   0.647    -.0553131    .0890538
_DdivXblack_4 |   .0264415   .0437226     0.60   0.545    -.0592547    .1121376
_DdivXblack_5 |   .0592406   .0359483     1.65   0.099    -.0112178     .129699
_DdivXblack_6 |   .0397146   .0393421     1.01   0.313    -.0373958    .1168249
_DdivXblack_7 |   .0258015   .0377005     0.68   0.494    -.0480912    .0996942
_DdivXblack_8 |   .0144515   .0406935     0.36   0.722    -.0653075    .0942105
_DdivXblack_9 |   .0670782   .0375808     1.78   0.074    -.0065801    .1407365
 _DdivXhisp_2 |  -.0425574   .0383111    -1.11   0.267    -.1176469    .0325322
 _DdivXhisp_3 |   .0111763   .0392767     0.28   0.776    -.0658059    .0881585
 _DdivXhisp_4 |  -.0907517   .0585838    -1.55   0.121    -.2055757    .0240724
 _DdivXhisp_5 |  -.1462708   .0376028    -3.89   0.000    -.2199722   -.0725694
 _DdivXhisp_6 |  -.1848467   .0894891    -2.07   0.039     -.360245   -.0094485
 _DdivXhisp_7 |  -.1163519   .0384153    -3.03   0.002    -.1916457   -.0410581
 _DdivXhisp_8 |  -.0532695    .038233    -1.39   0.164     -.128206    .0216669
 _DdivXhisp_9 |  -.0482196   .0376105    -1.28   0.200    -.1219361    .0254969
_DdivXfemal_2 |   .0453777   .0216418     2.10   0.036     .0029597    .0877956
_DdivXfemal_3 |  -.0097585   .0215436    -0.45   0.651    -.0519838    .0324667
_DdivXfemal_4 |    .040881   .0251709     1.62   0.104    -.0084539    .0902158
_DdivXfemal_5 |   .0828654   .0207778     3.99   0.000     .0421411    .1235898
_DdivXfemal_6 |   .0222443   .0256019     0.87   0.385    -.0279353    .0724239
_DdivXfemal_7 |   .0204988   .0221312     0.93   0.354    -.0228783    .0638759
_DdivXfemal_8 |   .0602537   .0219003     2.75   0.006     .0173292    .1031782
_DdivXfemal_9 |   .0736819   .0211791     3.48   0.001     .0321709    .1151929
_DdivXyoung_2 |   .0247734   .0238518     1.04   0.299    -.0219761    .0715229
_DdivXyoung_3 |  -.0131767   .0235908    -0.56   0.576    -.0594145    .0330611
_DdivXyoung_4 |  -.0258232   .0276513    -0.93   0.350    -.0800196    .0283732
_DdivXyoung_5 |   .0297939   .0228355     1.30   0.192    -.0149636    .0745514
_DdivXyoung_6 |   .0075033   .0279238     0.27   0.788    -.0472272    .0622337
_DdivXyoung_7 |   .0059606   .0241914     0.25   0.805    -.0414545    .0533757
_DdivXyoung_8 |   .0113923    .023995     0.47   0.635    -.0356377    .0584223
_DdivXyoung_9 |   .0109035   .0232274     0.47   0.639     -.034622     .056429
_DdivXedg_2_1 |     -.0578   .0359884    -1.61   0.108    -.1283371    .0127371
_DdivXedg_2_3 |   .0347939   .0280616     1.24   0.215    -.0202066    .0897944
_DdivXedg_2_4 |   .0021389   .0278731     0.08   0.939    -.0524922    .0567701
_DdivXedg_3_1 |  -.0817998   .0360811    -2.27   0.023    -.1525186   -.0110811
_DdivXedg_3_3 |   .0155595   .0277096     0.56   0.574    -.0387511    .0698701
_DdivXedg_3_4 |  -.0309094   .0279317    -1.11   0.268    -.0856555    .0238367
_DdivXedg_4_1 |  -.0894956   .0427187    -2.09   0.036    -.1732242   -.0057671
_DdivXedg_4_3 |   .0247796   .0319778     0.77   0.438    -.0378968    .0874559
_DdivXedg_4_4 |  -.0616876   .0329784    -1.87   0.061     -.126325    .0029498
_DdivXedg_5_1 |  -.1110323   .0345321    -3.22   0.001     -.178715   -.0433495
_DdivXedg_5_3 |   .0453381   .0268658     1.69   0.091    -.0073187    .0979949
_DdivXedg_5_4 |   .0472206   .0268944     1.76   0.079    -.0054922    .0999334
_DdivXedg_6_1 |  -.0825105   .0400073    -2.06   0.039    -.1609247   -.0040964
_DdivXedg_6_3 |   .0411951   .0329412     1.25   0.211    -.0233694    .1057597
_DdivXedg_6_4 |   .0059655   .0350478     0.17   0.865    -.0627279     .074659
_DdivXedg_7_1 |  -.1122042   .0357682    -3.14   0.002    -.1823097   -.0420988
_DdivXedg_7_3 |   .0433295   .0287423     1.51   0.132    -.0130053    .0996642
_DdivXedg_7_4 |   .0180557    .029664     0.61   0.543    -.0400855     .076197
_DdivXedg_8_1 |  -.1312965   .0362314    -3.62   0.000    -.2023098   -.0602833
_DdivXedg_8_3 |   .0580924   .0282485     2.06   0.040     .0027255    .1134592
_DdivXedg_8_4 |   .0542112   .0287302     1.89   0.059    -.0020999    .1105223
_DdivXedg_9_1 |  -.0589921   .0349808    -1.69   0.092    -.1275543    .0095701
_DdivXedg_9_3 |   .0582187   .0274916     2.12   0.034     .0043354    .1121021
_DdivXedg_9_4 |   .0664271   .0279228     2.38   0.017     .0116984    .1211557
   _DdivXtt_2 |   -.001186   .0034266    -0.35   0.729    -.0079022    .0055302
   _DdivXtt_3 |   .0058257   .0033697     1.73   0.084    -.0007789    .0124302
   _DdivXtt_4 |   .0073467   .0039652     1.85   0.064    -.0004252    .0151185
   _DdivXtt_5 |  -.0004508   .0033052    -0.14   0.892     -.006929    .0060274
   _DdivXtt_6 |  -.0051971    .003966    -1.31   0.190    -.0129705    .0025762
   _DdivXtt_7 |   .0013076     .00342     0.38   0.702    -.0053955    .0080108
   _DdivXtt_8 |  -.0019078   .0035335    -0.54   0.589    -.0088334    .0050178
   _DdivXtt_9 |  -.0019719   .0033085    -0.60   0.551    -.0084566    .0045129
           tt |   .0381692   .0355116     1.07   0.282    -.0314333    .1077716
          qtt |  -.0063695   .0033412    -1.91   0.057    -.0129183    .0001793
          ctt |   .0002335   .0000986     2.37   0.018     .0000401    .0004268
          btt |   .0309196   .0420556     0.74   0.462    -.0515091    .1133483
          htt |  -.0092295   .0425302    -0.22   0.828    -.0925885    .0741295
          ftt |  -.0293457   .0330343    -0.89   0.374    -.0940929    .0354014
          ytt |  -.0011709   .0088846    -0.13   0.895    -.0185846    .0162429
         bqtt |  -.0027892   .0039465    -0.71   0.480    -.0105242    .0049458
         hqtt |   .0003059   .0039823     0.08   0.939    -.0074994    .0081112
         fqtt |   .0034785   .0031013     1.12   0.262    -.0026001     .009557
         yqtt |  -.0003771     .00109    -0.35   0.729    -.0025135    .0017593
         bctt |   .0000746   .0001159     0.64   0.520    -.0001526    .0003017
         hctt |  -1.43e-06   .0001167    -0.01   0.990    -.0002301    .0002273
         fctt |  -.0001193    .000091    -1.31   0.190    -.0002977    .0000591
         yctt |   .0000239   .0000379     0.63   0.529    -.0000504    .0000981
        _cons |  -.1242819   .1291677    -0.96   0.336    -.3774499    .1288861
-------------------------------------------------------------------------------

. predict rempdhi, resid ;
(12 missing values generated)

. summ empdhi rempdhi ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      empdhi |     76,590    .2747487    .4463905          0          1
     rempdhi |     76,578    8.84e-11    .4357361  -.6537898   1.071931

. *** Tabulate means of resid empdhi by divtest and time period ;
. gen timepd=. ;
(76,590 missing values generated)

. replace timepd=1 if year>=1985 & year<=1988 ;
(6,984 real changes made)

. replace timepd=2 if year>=1989 & year<=1993 ;
(47,646 real changes made)

. replace timepd=3 if year>=1994 ;
(21,960 real changes made)

. tab1 timepd ;

-> tabulation of timepd  

     timepd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,984        9.12        9.12
          2 |     47,646       62.21       71.33
          3 |     21,960       28.67      100.00
------------+-----------------------------------
      Total |     76,590      100.00

. summ timepd divtest ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      timepd |     76,590    2.195535    .5828198          1          3
     divtest |     76,590    1.948923    .7727807          1          3

. sort timepd divtest ;

. by timepd divtest: ttest rempdhi, by(useryr) ;

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,012    .0074799     .010424    .4675728   -.0129631    .0279229
       1 |     588    -.028814    .0188838    .4579076   -.0659021     .008274
---------+--------------------------------------------------------------------
combined |   2,600   -.0007281    .0091305    .4655647   -.0186318    .0171757
---------+--------------------------------------------------------------------
    diff |             .036294    .0218181               -.0064886    .0790765
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.6635
Ho: diff = 0                                     degrees of freedom =     2598

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9518         Pr(|T| > |t|) = 0.0963          Pr(T > t) = 0.0482

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,435    .0225423    .0124177    .4704009   -.0018166    .0469011
       1 |     404   -.0121099    .0229022    .4603285   -.0571326    .0329128
---------+--------------------------------------------------------------------
combined |   1,839    .0149297    .0109203    .4683023   -.0064878    .0363473
---------+--------------------------------------------------------------------
    diff |            .0346522    .0263703               -.0170667    .0863711
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.3141
Ho: diff = 0                                     degrees of freedom =     1837

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9055         Pr(|T| > |t|) = 0.1890          Pr(T > t) = 0.0945

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,994     .000508    .0103106    .4604123   -.0197127    .0207287
       1 |     539   -.0286179    .0197646    .4588622   -.0674431    .0102074
---------+--------------------------------------------------------------------
combined |   2,533   -.0056897    .0091428    .4601469   -.0236178    .0122384
---------+--------------------------------------------------------------------
    diff |            .0291259    .0223356                -.014672    .0729237
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.3040
Ho: diff = 0                                     degrees of freedom =     2531

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9038         Pr(|T| > |t|) = 0.1923          Pr(T > t) = 0.0962

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |  12,274    .0090868    .0039691    .4397278    .0013067    .0168668
       1 |   2,476   -.0451581    .0081362    .4048546   -.0611127   -.0292036
---------+--------------------------------------------------------------------
combined |  14,750    -.000019    .0035779    .4345296   -.0070321     .006994
---------+--------------------------------------------------------------------
    diff |            .0542449    .0095629                .0355005    .0729893
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   5.6724
Ho: diff = 0                                     degrees of freedom =    14748

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |  17,263    .0033668    .0033381    .4385834   -.0031762    .0099097
       1 |   3,614   -.0336031    .0068502    .4118121   -.0470338   -.0201724
---------+--------------------------------------------------------------------
combined |  20,877   -.0030331    .0030057     .434283   -.0089244    .0028582
---------+--------------------------------------------------------------------
    diff |            .0369699    .0079404                .0214062    .0525336
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   4.6559
Ho: diff = 0                                     degrees of freedom =    20875

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |  10,136    .0052591    .0043863    .4416042    -.003339    .0138571
       1 |   1,883   -.0119858    .0100864    .4376866   -.0317676     .007796
---------+--------------------------------------------------------------------
combined |  12,019    .0025574    .0040228    .4410192   -.0053279    .0104426
---------+--------------------------------------------------------------------
    diff |            .0172449    .0110664               -.0044471    .0389369
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.5583
Ho: diff = 0                                     degrees of freedom =    12017

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9404         Pr(|T| > |t|) = 0.1192          Pr(T > t) = 0.0596

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   6,472      .00309    .0052775     .424566   -.0072555    .0134356
       1 |   1,099   -.0162196    .0122328    .4055309   -.0402219    .0077826
---------+--------------------------------------------------------------------
combined |   7,571    .0002871    .0048486    .4218849   -.0092176    .0097917
---------+--------------------------------------------------------------------
    diff |            .0193097    .0137634               -.0076703    .0462897
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.4030
Ho: diff = 0                                     degrees of freedom =     7569

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9197         Pr(|T| > |t|) = 0.1607          Pr(T > t) = 0.0803

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   6,645    .0121011     .005288    .4310613     .001735    .0224673
       1 |   1,290   -.0345321    .0108141    .3884042   -.0557472    -.013317
---------+--------------------------------------------------------------------
combined |   7,935    .0045199    .0047682    .4247439    -.004827    .0138668
---------+--------------------------------------------------------------------
    diff |            .0466332    .0129131                .0213203    .0719462
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   3.6113
Ho: diff = 0                                     degrees of freedom =     7933

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9998         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0002

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   5,585   -.0001512    .0057799    .4319498   -.0114821    .0111797
       1 |     869   -.0178141    .0143571    .4232303   -.0459928    .0103646
---------+--------------------------------------------------------------------
combined |   6,454   -.0025294    .0053624    .4307959   -.0130414    .0079826
---------+--------------------------------------------------------------------
    diff |            .0176629    .0157093               -.0131325    .0484582
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.1244
Ho: diff = 0                                     degrees of freedom =     6452

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8695         Pr(|T| > |t|) = 0.2609          Pr(T > t) = 0.1305

. by timepd divtest: ttest rempdhi, by(usermon) ;

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,215    .0023294    .0098947    .4656843   -.0170746    .0217334
       1 |     385   -.0183186    .0237032    .4650902   -.0649229    .0282857
---------+--------------------------------------------------------------------
combined |   2,600   -.0007281    .0091305    .4655647   -.0186318    .0171757
---------+--------------------------------------------------------------------
    diff |             .020648    .0257086               -.0297635    .0710595
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.8032
Ho: diff = 0                                     degrees of freedom =     2598

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7890         Pr(|T| > |t|) = 0.4220          Pr(T > t) = 0.2110

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,573    .0174104    .0118115    .4684561   -.0057576    .0405783
       1 |     266    .0002604    .0286952    .4680039   -.0562391      .05676
---------+--------------------------------------------------------------------
combined |   1,839    .0149297    .0109203    .4683023   -.0064878    .0363473
---------+--------------------------------------------------------------------
    diff |            .0171499    .0310523               -.0437516    .0780515
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.5523
Ho: diff = 0                                     degrees of freedom =     1837

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7096         Pr(|T| > |t|) = 0.5808          Pr(T > t) = 0.2904

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,183   -.0004466    .0098414    .4598155   -.0197461    .0188529
       1 |     350   -.0383919    .0246694    .4615228   -.0869114    .0101276
---------+--------------------------------------------------------------------
combined |   2,533   -.0056897    .0091428    .4601469   -.0236178    .0122384
---------+--------------------------------------------------------------------
    diff |            .0379453    .0264888               -.0139967    .0898873
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.4325
Ho: diff = 0                                     degrees of freedom =     2531

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9239         Pr(|T| > |t|) = 0.1521          Pr(T > t) = 0.0761

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |  13,332    .0058899    .0037877    .4373395   -.0015345    .0133142
       1 |   1,418    -.055574    .0107045    .4030932   -.0765724   -.0345756
---------+--------------------------------------------------------------------
combined |  14,750    -.000019    .0035779    .4345296   -.0070321     .006994
---------+--------------------------------------------------------------------
    diff |            .0614639    .0121274                .0376927     .085235
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   5.0682
Ho: diff = 0                                     degrees of freedom =    14748

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |  18,894    .0008594    .0031747    .4363764   -.0053633     .007082
       1 |   1,983   -.0401203    .0092536    .4120707   -.0582681   -.0219725
---------+--------------------------------------------------------------------
combined |  20,877   -.0030331    .0030057     .434283   -.0089244    .0028582
---------+--------------------------------------------------------------------
    diff |            .0409797    .0102477                .0208934    .0610661
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   3.9989
Ho: diff = 0                                     degrees of freedom =    20875

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0001          Pr(T > t) = 0.0000

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |  11,041    .0063895    .0042026    .4415901   -.0018483    .0146273
       1 |     978   -.0407052    .0138264    .4323928   -.0678381   -.0135724
---------+--------------------------------------------------------------------
combined |  12,019    .0025574    .0040228    .4410192   -.0053279    .0104426
---------+--------------------------------------------------------------------
    diff |            .0470947    .0147079                .0182648    .0759246
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   3.2020
Ho: diff = 0                                     degrees of freedom =    12017

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9993         Pr(|T| > |t|) = 0.0014          Pr(T > t) = 0.0007

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   6,910    .0018194    .0050837    .4225891   -.0081462     .011785
       1 |     661    -.015732    .0161194    .4144273   -.0473834    .0159194
---------+--------------------------------------------------------------------
combined |   7,571    .0002871    .0048486    .4218849   -.0092176    .0097917
---------+--------------------------------------------------------------------
    diff |            .0175514    .0171763               -.0161189    .0512217
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.0218
Ho: diff = 0                                     degrees of freedom =     7569

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8466         Pr(|T| > |t|) = 0.3069          Pr(T > t) = 0.1534

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   7,163    .0117762    .0050737    .4294071    .0018303     .021722
       1 |     772    -.062807    .0133997    .3723087   -.0891112   -.0365028
---------+--------------------------------------------------------------------
combined |   7,935    .0045199    .0047682    .4247439    -.004827    .0138668
---------+--------------------------------------------------------------------
    diff |            .0745832    .0160688                .0430842    .1060822
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   4.6415
Ho: diff = 0                                     degrees of freedom =     7933

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   5,960    .0007984    .0055928    .4317665   -.0101654    .0117623
       1 |     494   -.0426793    .0187727    .4172443   -.0795637   -.0057949
---------+--------------------------------------------------------------------
combined |   6,454   -.0025294    .0053624    .4307959   -.0130414    .0079826
---------+--------------------------------------------------------------------
    diff |            .0434777     .020164                .0039496    .0830059
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   2.1562
Ho: diff = 0                                     degrees of freedom =     6452

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9844         Pr(|T| > |t|) = 0.0311          Pr(T > t) = 0.0156

. by timepd divtest: ttest rempdhi if black==1, by(usermon) ;

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     304   -.0089302    .0261222    .4554562   -.0603341    .0424737
       1 |      69   -.0158146    .0562717    .4674279    -.128103    .0964739
---------+--------------------------------------------------------------------
combined |     373   -.0102037     .023666    .4570662   -.0567396    .0363322
---------+--------------------------------------------------------------------
    diff |            .0068844    .0610308               -.1131253    .1268941
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.1128
Ho: diff = 0                                     degrees of freedom =      371

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.5449         Pr(|T| > |t|) = 0.9102          Pr(T > t) = 0.4551

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     433    .0449151    .0235148    .4893122   -.0013026    .0911328
       1 |      72   -.0333452    .0548145     .465116   -.1426422    .0759517
---------+--------------------------------------------------------------------
combined |     505    .0337572    .0216383    .4862595   -.0087551    .0762695
---------+--------------------------------------------------------------------
    diff |            .0782603    .0618507               -.0432573    .1997779
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.2653
Ho: diff = 0                                     degrees of freedom =      503

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8968         Pr(|T| > |t|) = 0.2063          Pr(T > t) = 0.1032

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     456    .0051513    .0222401     .474919   -.0385547    .0488574
       1 |      76   -.0337097    .0555109    .4839326   -.1442931    .0768736
---------+--------------------------------------------------------------------
combined |     532   -.0004002    .0206351    .4759509   -.0409367    .0401362
---------+--------------------------------------------------------------------
    diff |            .0388611    .0590011               -.0770437    .1547659
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.6586
Ho: diff = 0                                     degrees of freedom =      530

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7448         Pr(|T| > |t|) = 0.5104          Pr(T > t) = 0.2552

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,205    .0110303    .0093522    .4391534   -.0073097    .0293703
       1 |     250   -.0200036    .0276592    .4373298   -.0744794    .0344721
---------+--------------------------------------------------------------------
combined |   2,455      .00787    .0088597    .4389796   -.0095032    .0252433
---------+--------------------------------------------------------------------
    diff |            .0310339    .0292944               -.0264104    .0884783
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.0594
Ho: diff = 0                                     degrees of freedom =     2453

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8552         Pr(|T| > |t|) = 0.2895          Pr(T > t) = 0.1448

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   4,673   -.0107054     .006649    .4545213   -.0237406    .0023298
       1 |     396   -.0339698    .0225004    .4477533   -.0782054    .0102658
---------+--------------------------------------------------------------------
combined |   5,069   -.0125229    .0063766    .4539954   -.0250238   -.0000219
---------+--------------------------------------------------------------------
    diff |            .0232644    .0237612               -.0233179    .0698467
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.9791
Ho: diff = 0                                     degrees of freedom =     5067

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8362         Pr(|T| > |t|) = 0.3276          Pr(T > t) = 0.1638

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   2,289    .0107197    .0093001    .4449506   -.0075178    .0289573
       1 |     237   -.0215478    .0294706    .4536943   -.0796069    .0365113
---------+--------------------------------------------------------------------
combined |   2,526    .0076923    .0088697    .4457865   -.0097004    .0250849
---------+--------------------------------------------------------------------
    diff |            .0322675    .0304184               -.0273799     .091915
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.0608
Ho: diff = 0                                     degrees of freedom =     2524

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8556         Pr(|T| > |t|) = 0.2889          Pr(T > t) = 0.1444

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,045   -.0153768    .0125913    .4070321    -.040084    .0093303
       1 |     111    .0049898     .040901    .4309192   -.0760665     .086046
---------+--------------------------------------------------------------------
combined |   1,156   -.0134212    .0120363    .4092359   -.0370368    .0101943
---------+--------------------------------------------------------------------
    diff |           -.0203666    .0408671               -.1005489    .0598156
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.4984
Ho: diff = 0                                     degrees of freedom =     1154

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3092         Pr(|T| > |t|) = 0.6183          Pr(T > t) = 0.6908

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,660    .0334751    .0112378    .4578618    .0114333    .0555168
       1 |     136    -.067188    .0353515    .4122656   -.1371023    .0027264
---------+--------------------------------------------------------------------
combined |   1,796    .0258525    .0107421    .4552432    .0047841    .0469209
---------+--------------------------------------------------------------------
    diff |             .100663    .0405461                .0211404    .1801856
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   2.4827
Ho: diff = 0                                     degrees of freedom =     1794

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9934         Pr(|T| > |t|) = 0.0131          Pr(T > t) = 0.0066

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,614   -.0056028    .0105958    .4256815   -.0263858    .0151801
       1 |     126   -.0807525    .0363607    .4081477   -.1527148   -.0087902
---------+--------------------------------------------------------------------
combined |   1,740   -.0110447    .0101831    .4247696    -.031017    .0089277
---------+--------------------------------------------------------------------
    diff |            .0751497    .0392608               -.0018536     .152153
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.9141
Ho: diff = 0                                     degrees of freedom =     1738

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9721         Pr(|T| > |t|) = 0.0558          Pr(T > t) = 0.0279

. by timepd divtest: ttest rempdhi if black==0 & hisp==0, by(usermon) ;

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,125    .0028345    .0135522    .4545545   -.0237559     .029425
       1 |     227   -.0153227    .0305024    .4595652   -.0754282    .0447828
---------+--------------------------------------------------------------------
combined |   1,352   -.0002141     .012382    .4552792    -.024504    .0240759
---------+--------------------------------------------------------------------
    diff |            .0181573    .0331352               -.0468448    .0831593
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.5480
Ho: diff = 0                                     degrees of freedom =     1350

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7081         Pr(|T| > |t|) = 0.5838          Pr(T > t) = 0.2919

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     901    .0037474    .0153084    .4595057   -.0262968    .0337916
       1 |     153    .0116079    .0378233    .4678478   -.0631193    .0863351
---------+--------------------------------------------------------------------
combined |   1,054    .0048885    .0141847    .4605099   -.0229449    .0327219
---------+--------------------------------------------------------------------
    diff |           -.0078605    .0402856               -.0869097    .0711887
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.1951
Ho: diff = 0                                     degrees of freedom =     1052

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4227         Pr(|T| > |t|) = 0.8453          Pr(T > t) = 0.5773

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 1, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,346    .0074875    .0125351     .459888    -.017103    .0320781
       1 |     218   -.0396099    .0308011    .4547724   -.1003175    .0210977
---------+--------------------------------------------------------------------
combined |   1,564    .0009228    .0116145    .4593237   -.0218588    .0237044
---------+--------------------------------------------------------------------
    diff |            .0470974    .0335236               -.0186587    .1128535
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.4049
Ho: diff = 0                                     degrees of freedom =     1562

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9199         Pr(|T| > |t|) = 0.1602          Pr(T > t) = 0.0801

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   7,138    .0007473    .0050135    .4235775   -.0090807    .0105754
       1 |     825   -.0694987    .0133148    .3824398   -.0956337   -.0433637
---------+--------------------------------------------------------------------
combined |   7,963   -.0065304    .0047069    .4200264   -.0157573    .0026964
---------+--------------------------------------------------------------------
    diff |             .070246    .0154263                .0400064    .1004856
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   4.5536
Ho: diff = 0                                     degrees of freedom =     7961

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |  10,724    .0068261    .0041944    .4343575   -.0013957    .0150479
       1 |   1,275    -.043841    .0112609    .4020951    -.065933   -.0217491
---------+--------------------------------------------------------------------
combined |  11,999    .0014423    .0039375    .4313109   -.0062758    .0091603
---------+--------------------------------------------------------------------
    diff |            .0506671    .0127692                .0256375    .0756968
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   3.9679
Ho: diff = 0                                     degrees of freedom =    11997

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0001          Pr(T > t) = 0.0000

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 2, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   6,473    .0042804    .0054551    .4388885   -.0064134    .0149741
       1 |     605   -.0432279    .0172333    .4238834   -.0770724   -.0093835
---------+--------------------------------------------------------------------
combined |   7,078    .0002195    .0052038    .4377984   -.0099814    .0104205
---------+--------------------------------------------------------------------
    diff |            .0475083     .018605                .0110369    .0839797
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   2.5535
Ho: diff = 0                                     degrees of freedom =     7076

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9947         Pr(|T| > |t|) = 0.0107          Pr(T > t) = 0.0053

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 1

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   3,730    .0083938    .0067858    .4144367   -.0049106    .0216981
       1 |     405    .0005568    .0205287    .4131322   -.0397997    .0409132
---------+--------------------------------------------------------------------
combined |   4,135    .0076262    .0064423    .4142658   -.0050042    .0202565
---------+--------------------------------------------------------------------
    diff |             .007837    .0216761               -.0346598    .0503338
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   0.3616
Ho: diff = 0                                     degrees of freedom =     4133

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6411         Pr(|T| > |t|) = 0.7177          Pr(T > t) = 0.3589

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 2

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   4,139    .0013293    .0065371    .4205629   -.0114868    .0141455
       1 |     512   -.0665904    .0160641    .3634882   -.0981502   -.0350307
---------+--------------------------------------------------------------------
combined |   4,651   -.0061475    .0060878     .415174   -.0180824    .0057873
---------+--------------------------------------------------------------------
    diff |            .0679198    .0194266                .0298344    .1060051
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   3.4962
Ho: diff = 0                                     degrees of freedom =     4649

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9998         Pr(|T| > |t|) = 0.0005          Pr(T > t) = 0.0002

-------------------------------------------------------------------------------------------------------------------------------------------------------------
-> timepd = 3, divtest = 3

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   3,000    .0027188    .0079164    .4335996   -.0128034    .0182409
       1 |     303   -.0276547    .0244721     .425983   -.0758121    .0205027
---------+--------------------------------------------------------------------
combined |   3,303   -.0000675    .0075329    .4329316   -.0148373    .0147022
---------+--------------------------------------------------------------------
    diff |            .0303735    .0260957               -.0207918    .0815388
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.1639
Ho: diff = 0                                     degrees of freedom =     3301

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8777         Pr(|T| > |t|) = 0.2445          Pr(T > t) = 0.1223

. log close ;
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_3\Table3_divisions2.log
  log type:  text
 closed on:   6 Mar 2020, 20:40:43
-------------------------------------------------------------------------------------------------------------------------------------------------------------
