-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_2\descrip.log
  log type:  text
 opened on:   6 Mar 2020, 20:33:49

. /*****
> 
> Descriptive statistics.
> 
> *****/
> 
> set mem 700m ;
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are performed on the fly automatically.

. set matsize 300 ;

. set more off ;

. cd .. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables

. cd ../Data_Setup_March_CPS/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Data_Setup_March_CPS

. use Output/marcps.dta ;

. cd ../Tables/Table_2/. ;
H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_2

. *use "/afs/crc.nd.edu/user/a/awaggone/Private/Private/Drugs_2011/marcps.dta" ;
. *use marcps_test.dta ;
. gen empdhi=1 if empd==1 & inlist(ind1,1,4,5,3,11)==1 ;
(2,189,585 missing values generated)

. replace empdhi=0 if empd==1 & inlist(ind1,1,4,5,3,11)~=1 ;
(1,504,219 real changes made)

. summ empdhi ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      empdhi |  2,075,347    .2751964    .4466133          0          1

. gen empdmid=1 if firmsizer==2 | firmsizer==3 ;
(2,292,171 missing values generated)

. replace empdmid=0 if firmsizer==1 | firmsizer==4 ;
(1,266,443 real changes made)

. gen lrhw=log(rhwage) ;
(608,313 missing values generated)

. gen somecoll=(edgrp4>=3) ;

. replace somecoll=. if edgrp4==. ;
(0 real changes made)

. gen young=(age<=25) ;

. * Pro and anti dummies, by state-year ;
. gen pro=0 ;

. replace pro=1 if (year>=yrpro & yrpro~=0) ;
(287,572 real changes made)

. gen anti=0 ;

. replace anti=1 if (year>=yranti & yranti~=0) ;
(119,778 real changes made)

. gen empdlg=1 if firmsizer==4 ;
(2,005,557 missing values generated)

. replace empdlg=0 if firmsizer==1 | firmsizer==2 | firmsizer==3 ;
(979,829 real changes made)

. gen ph=. ;
(2,760,713 missing values generated)

. replace ph=1 if pensionr==1 | inclughr==1 ;
(1,524,078 real changes made)

. replace ph=0 if pensionr==0 & inclughr==0 ;
(764,615 real changes made)

. replace ph=. if pensionr==. | inclughr==. ;
(0 real changes made)

. sort state ;

. by state: egen everanti=max(anti) ;

. by state: egen everpro=max(pro) ;

. summ everanti everpro ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    everanti |  2,760,713    .0894457    .2853861          0          1
     everpro |  2,760,713    .2343141    .4235694          0          1

. summ yranti if everanti==1 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      yranti |    246,934    1999.447    4.126454       1993       2005

. summ yrpro if everpro==1 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       yrpro |    646,874    1998.739    3.868297       1985       2003

. /* Not sure weights below are right. Using pw in estimation but that's not allowed in summ, so did both here. */
> 
> * Unweighted ;
. summ year age empd empdhi empdlg rhwage lrhw hwagesamp inclughr pensionr ph female black hisp 
>  somecoll young pro anti ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |  2,760,713    1995.826    9.249745       1980       2010
         age |  2,760,713    35.78253    10.54069         18         55
        empd |  2,760,034    .7519281    .4318939          0          1
      empdhi |  2,075,347    .2751964    .4466133          0          1
      empdlg |  1,734,985    .4352522    .4957901          0          1
-------------+---------------------------------------------------------
      rhwage |  2,288,695     14.8031    229.5463          0   323885.3
        lrhw |  2,152,400    2.446702    .7767176  -8.419633   12.68814
   hwagesamp |  2,760,713    .7327908    .4425026          0          1
    inclughr |  2,288,695    .5322631    .4989581          0          1
    pensionr |  2,288,693     .527183    .4992606          0          1
-------------+---------------------------------------------------------
          ph |  2,288,693    .6659163    .4716692          0          1
      female |  2,760,713    .5172175    .4997036          0          1
       black |  2,760,713     .097498    .2966347          0          1
        hisp |  2,760,713    .1341588    .3408229          0          1
    somecoll |  2,760,713    .4904595    .4999091          0          1
-------------+---------------------------------------------------------
       young |  2,760,713    .2112277    .4081796          0          1
         pro |  2,760,713    .1041658    .3054756          0          1
        anti |  2,760,713    .0433866    .2037259          0          1

. summ year age empd empdhi empdlg rhwage lrhw hwagesamp inclughr pensionr ph female black hisp 
>  somecoll young pro anti if year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |    762,083    1983.889    2.597719       1980       1988
         age |    762,083    34.15929    10.52288         18         55
        empd |    762,083    .7244224    .4468052          0          1
      empdhi |    552,070    .3255131    .4685667          0          1
      empdlg |     68,338    .4222541    .4939222          0          1
-------------+---------------------------------------------------------
      rhwage |    622,662    12.60185    14.46435          0   4460.394
        lrhw |    580,492    2.358811     .802986  -8.130766   8.402992
   hwagesamp |    762,083    .7220355    .4479961          0          1
    inclughr |    622,662    .5873363    .4923137          0          1
    pensionr |    622,662    .4942971    .4999679          0          1
-------------+---------------------------------------------------------
          ph |    622,662    .6634241    .4725388          0          1
      female |    762,083    .5165264    .4997271          0          1
       black |    762,083     .088556    .2841019          0          1
        hisp |    762,083    .0980589    .2973944          0          1
    somecoll |    762,083    .3872006    .4871105          0          1
-------------+---------------------------------------------------------
       young |    762,083    .2568841    .4369152          0          1
         pro |    762,083    .0052357    .0721682          0          1
        anti |    762,083           0           0          0          0

. summ year age empd empdhi empdlg rhwage lrhw hwagesamp inclughr pensionr ph female black hisp 
>  somecoll young pro anti if everpro==1 & year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |    179,728    1983.853    2.602349       1980       1988
         age |    179,728    34.18519    10.56013         18         55
        empd |    179,728    .7150361    .4513985          0          1
      empdhi |    128,512    .3240631    .4680256          0          1
      empdlg |     16,056    .4337942    .4956128          0          1
-------------+---------------------------------------------------------
      rhwage |    145,739    12.07522    15.98479          0   3712.427
        lrhw |    135,545    2.308898    .8091403  -7.957695   8.219441
   hwagesamp |    179,728    .7128272    .4524442          0          1
    inclughr |    145,739    .5757347    .4942327          0          1
    pensionr |    145,739     .475487    .4994005          0          1
-------------+---------------------------------------------------------
          ph |    145,739    .6503338    .4768661          0          1
      female |    179,728    .5197298     .499612          0          1
       black |    179,728    .1284441    .3345846          0          1
        hisp |    179,728    .0570529    .2319443          0          1
    somecoll |    179,728    .3609955    .4802906          0          1
-------------+---------------------------------------------------------
       young |    179,728     .258613    .4378737          0          1
         pro |    179,728    .0222002    .1473346          0          1
        anti |    179,728           0           0          0          0

. summ year age empd empdhi empdlg rhwage lrhw hwagesamp inclughr pensionr ph female black hisp 
>  somecoll young pro anti if everanti==1 & year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |     63,323    1983.654    2.557736       1980       1988
         age |     63,323    34.14431    10.45885         18         55
        empd |     63,323    .7502645    .4328633          0          1
      empdhi |     47,509    .3248648    .4683292          0          1
      empdlg |      4,930    .3636917    .4811102          0          1
-------------+---------------------------------------------------------
      rhwage |     54,192    11.74828    10.69383          0   536.6963
        lrhw |     49,748     2.30804     .806582  -7.594101   6.285432
   hwagesamp |     63,323    .7418631    .4376131          0          1
    inclughr |     54,192    .5664305    .4955719          0          1
    pensionr |     54,192    .4764172    .4994481          0          1
-------------+---------------------------------------------------------
          ph |     54,192    .6437851    .4788842          0          1
      female |     63,323    .5103201    .4998974          0          1
       black |     63,323    .0258042     .158552          0          1
        hisp |     63,323    .0216035    .1453862          0          1
    somecoll |     63,323    .3941696    .4886754          0          1
-------------+---------------------------------------------------------
       young |     63,323    .2531782    .4348356          0          1
         pro |     63,323           0           0          0          0
        anti |     63,323           0           0          0          0

. * Weighted ;
. summ year age empd empdhi empdlg rhwage lrhw hwagesamp inclughr pensionr ph female black hisp 
>  somecoll young pro anti [w=wtsupp] ;
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        year | 2760644  4.3403e+09    1995.879   8.867443       1980       2010
         age | 2760644  4.3403e+09    35.58452   10.60552         18         55
        empd | 2759965  4.3394e+09    .7495134   .4332934          0          1
      empdhi | 2075295  3.2525e+09    .2781594   .4480924          0          1
      empdlg | 1734957  2.7978e+09    .4440087   .4968552          0          1
-------------+-----------------------------------------------------------------
      rhwage | 2288635  3.5883e+09    15.11684   324.7872          0   323885.3
        lrhw | 2152345  3.3863e+09    2.452499   .7720664  -8.419633   12.68814
   hwagesamp | 2760644  4.3403e+09    .7334483   .4421561          0          1
    inclughr | 2288635  3.5883e+09    .5372563   .4986101          0          1
    pensionr | 2288633  3.5883e+09    .5291687   .4991486          0          1
-------------+-----------------------------------------------------------------
          ph | 2288633  3.5883e+09    .6692888   .4704693          0          1
      female | 2760644  4.3403e+09    .5061088   .4999628          0          1
       black | 2760644  4.3403e+09    .1217337    .326978          0          1
        hisp | 2760644  4.3403e+09    .1082278   .3106679          0          1
    somecoll | 2760644  4.3403e+09    .4963586   .4999868          0          1
-------------+-----------------------------------------------------------------
       young | 2760644  4.3403e+09     .220325   .4144659          0          1
         pro | 2760644  4.3403e+09    .1120257   .3153982          0          1
        anti | 2760644  4.3403e+09    .0260981   .1594271          0          1

. summ year age empd empdhi empdlg rhwage lrhw hwagesamp inclughr pensionr ph female black hisp 
>  somecoll young pro anti if year<=1988 [w=wtsupp] ;
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        year | 762,047  1.1021e+09    1984.098   2.574741       1980       1988
         age | 762,047  1.1021e+09    34.04134   10.52365         18         55
        empd | 762,047  1.1021e+09    .7246005   .4467156          0          1
      empdhi | 552,042   798600446    .3299092   .4701803          0          1
      empdlg |  68,338   109004893    .4297258   .4950405          0          1
-------------+-----------------------------------------------------------------
      rhwage | 622,630   900443292    12.82083   15.40483          0   4460.394
        lrhw | 580,463   843765780    2.372507   .7926999  -8.130766   8.402992
   hwagesamp | 762,047  1.1021e+09     .726385    .445814          0          1
    inclughr | 622,630   900443292     .595366   .4908215          0          1
    pensionr | 622,630   900443292    .5018812   .4999969          0          1
-------------+-----------------------------------------------------------------
          ph | 622,630   900443292    .6711008   .4698137          0          1
      female | 762,047  1.1021e+09    .5094922   .4999102          0          1
       black | 762,047  1.1021e+09    .1137555   .3175142          0          1
        hisp | 762,047  1.1021e+09    .0678815   .2515426          0          1
    somecoll | 762,047  1.1021e+09    .3926566   .4883418          0          1
-------------+-----------------------------------------------------------------
       young | 762,047  1.1021e+09    .2622822   .4398755          0          1
         pro | 762,047  1.1021e+09    .0062738   .0789583          0          1
        anti | 762,047  1.1021e+09           0          0          0          0

. summ year age empd empdhi empdlg rhwage lrhw hwagesamp inclughr pensionr ph female black hisp 
>  somecoll young pro anti if everpro==1 & year<=1988 [w=wtsupp] ;
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        year | 179,693   262813799    1984.122   2.572341       1980       1988
         age | 179,693   262813799    34.08879   10.57983         18         55
        empd | 179,693   262813799    .7152592   .4512921          0          1
      empdhi | 128,485   187979993    .3269377   .4690961          0          1
      empdlg |  16,056    26228030    .4386212   .4962338          0          1
-------------+-----------------------------------------------------------------
      rhwage | 145,708   212608224    11.87135   16.76191          0   3712.427
        lrhw | 135,516   199169266    2.293491   .7864497  -7.957695   8.219441
   hwagesamp | 179,693   262813799    .7185127   .4497258          0          1
    inclughr | 145,708   212608224    .5815722   .4933028          0          1
    pensionr | 145,708   212608224    .4777132   .4995048          0          1
-------------+-----------------------------------------------------------------
          ph | 145,708   212608224     .655902   .4750748          0          1
      female | 179,693   262813799    .5141277   .4998018          0          1
       black | 179,693   262813799    .1651271   .3712962          0          1
        hisp | 179,693   262813799    .0368396   .1883684          0          1
    somecoll | 179,693   262813799     .349494   .4768115          0          1
-------------+-----------------------------------------------------------------
       young | 179,693   262813799     .264187   .4409006          0          1
         pro | 179,693   262813799    .0263094   .1600543          0          1
        anti | 179,693   262813799           0          0          0          0

. summ year age empd empdhi empdlg rhwage lrhw hwagesamp inclughr pensionr ph female black hisp 
>  somecoll young pro anti if everanti==1 & year<=1988 [w=wtsupp] ;
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        year |  63,323    65162715    1984.071   2.566229       1980       1988
         age |  63,323    65162715     33.9533   10.44071         18         55
        empd |  63,323    65162715    .7664002   .4231238          0          1
      empdhi |  47,509    49940716    .3265652   .4689616          0          1
      empdlg |   4,930     6503899    .3861693   .4869196          0          1
-------------+-----------------------------------------------------------------
      rhwage |  54,192    56305309    12.37142   11.15365          0   536.6963
        lrhw |  49,748    51936969     2.35275   .8078453  -7.594101   6.285432
   hwagesamp |  63,323    65162715    .7522063   .4317348          0          1
    inclughr |  54,192    56305309    .5767265   .4940825          0          1
    pensionr |  54,192    56305309    .4912475    .499928          0          1
-------------+-----------------------------------------------------------------
          ph |  54,192    56305309    .6556226   .4751692          0          1
      female |  63,323    65162715     .503425   .4999922          0          1
       black |  63,323    65162715    .0403245   .1967208          0          1
        hisp |  63,323    65162715    .0172343   .1301443          0          1
    somecoll |  63,323    65162715    .4096954   .4917814          0          1
-------------+-----------------------------------------------------------------
       young |  63,323    65162715    .2607511   .4390479          0          1
         pro |  63,323    65162715           0          0          0          0
        anti |  63,323    65162715           0          0          0          0

.   * Unweighted - by subsamples ;
. summ empd empdhi empdlg inclughr pensionr ph lrhw if black==1 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |    269,073    .6661872    .4715746          0          1
      empdhi |    179,253    .3086197    .4619251          0          1
      empdlg |    160,050    .5586629    .4965483          0          1
    inclughr |    203,064     .535708    .4987245          0          1
    pensionr |    203,064     .538968    .4984804          0          1
-------------+---------------------------------------------------------
          ph |    203,064    .6793179      .46674          0          1
        lrhw |    197,788    2.311029    .7159979   -7.97532   10.49622

. summ empd empdhi empdlg inclughr pensionr ph lrhw if black==1 & year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |     67,487    .6223569    .4848013          0          1
      empdhi |     42,001    .3700626    .4828269          0          1
      empdlg |      5,654    .5463389    .4978921          0          1
    inclughr |     48,759    .5941262    .4910654          0          1
    pensionr |     48,759    .5147768    .4997867          0          1
-------------+---------------------------------------------------------
          ph |     48,759    .6737013    .4688629          0          1
        lrhw |     47,729     2.21728    .6735184  -7.224525    7.07156

. summ empd empdhi empdlg inclughr pensionr ph lrhw if black==1 & everpro==1 & year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |     23,085    .6158545    .4864031          0          1
      empdhi |     14,217    .3618204    .4805441          0          1
      empdlg |      1,912    .5177824    .4998144          0          1
    inclughr |     16,708    .5516519    .4973398          0          1
    pensionr |     16,708    .4546325    .4979524          0          1
-------------+---------------------------------------------------------
          ph |     16,708    .6281422    .4833152          0          1
        lrhw |     16,342    2.089027    .6620707  -7.224525   6.933076

. summ empd empdhi empdlg inclughr pensionr ph lrhw if black==1 & everanti==1 & year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      1,634    .6695226     .470529          0          1
      empdhi |      1,094    .4140768    .4927871          0          1
      empdlg |        138    .5724638    .4965234          0          1
    inclughr |      1,238    .6268174    .4838455          0          1
    pensionr |      1,238    .5468498    .4980014          0          1
-------------+---------------------------------------------------------
          ph |      1,238    .7059774    .4557863          0          1
        lrhw |      1,213    2.269587    .6228484  -1.536011   4.055667

.      summ empd empdhi empdlg inclughr pensionr ph lrhw if black==0 & hisp==0 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |  2,120,666    .7733811    .4186441          0          1
      empdhi |  1,640,083    .2723844    .4451868          0          1
      empdlg |  1,340,630    .4311078    .4952313          0          1
    inclughr |  1,802,439    .5488574    .4976074          0          1
    pensionr |  1,802,437     .549263    .4975674          0          1
-------------+---------------------------------------------------------
          ph |  1,802,437    .6850081    .4645128          0          1
        lrhw |  1,684,049    2.494469    .7893998  -8.419633   12.68814

. summ empd empdhi empdlg inclughr pensionr ph lrhw if black==0 & hisp==0 & year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |    619,867    .7448904    .4359231          0          1
      empdhi |    461,733    .3183571    .4658394          0          1
      empdlg |     56,242    .4166637    .4930105          0          1
    inclughr |    518,515      .59233    .4914017          0          1
    pensionr |    518,515    .5022323    .4999955          0          1
-------------+---------------------------------------------------------
          ph |    518,515    .6694117    .4704255          0          1
        lrhw |    479,938    2.387172     .823039  -8.130766   8.402992

. summ empd empdhi empdlg inclughr pensionr ph lrhw if black==0 & hisp==0 & everpro==1 & year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |    146,389    .7322135    .4428072          0          1
      empdhi |    107,188    .3199985    .4664778          0          1
      empdlg |     13,145    .4282997    .4948512          0          1
    inclughr |    120,998     .582803     .493098          0          1
    pensionr |    120,998    .4849915    .4997768          0          1
-------------+---------------------------------------------------------
          ph |    120,998    .6580026    .4743807          0          1
        lrhw |    111,638    2.346478    .8284784  -7.957695   8.219441

. summ empd empdhi empdlg inclughr pensionr ph lrhw if black==0 & hisp==0 & everanti==1 & year<=1988 ;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |     60,321     .754215    .4305553          0          1
      empdhi |     45,495    .3208484    .4668078          0          1
      empdlg |      4,658    .3574495    .4793002          0          1
    inclughr |     51,910    .5650356    .4957571          0          1
    pensionr |     51,910    .4754768    .4994031          0          1
-------------+---------------------------------------------------------
          ph |     51,910    .6425544    .4792522          0          1
        lrhw |     47,557     2.31142    .8134722  -7.594101   6.285432

.         log close ;
      name:  <unnamed>
       log:  H:\Other\Paper Codes for Uploading\drug-testing\Tables\Table_2\descrip.log
  log type:  text
 closed on:   6 Mar 2020, 20:34:55
-------------------------------------------------------------------------------------------------------------------------------------------------------------
